UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
/*
 * Copyright 2023 MindMotion Microelectronics Co., Ltd.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


#ifndef __MM32G0001A_H__
#define __MM32G0001A_H__

#ifdef __cplusplus
extern "C" {
#endif

/* -----------------------------------------------------------------------------
  -- Interrupt vector numbers
  ----------------------------------------------------------------------------- */

/*!
* @addtogroup Interrupt_vector_numbers Interrupt vector numbers

* @{
*/

/** Interrupt Number Definitions */

#define NUMBER_OF_INT_VECTORS 26                 /**< Number of interrupts in the Vector table */

typedef enum IRQ {
    Reset_IRQn                          = -15,                                   /*!< reset */
    NMI_IRQn                            = -14,                                   /*!< Non-Maskable Interrupt/RCC Clock Security System (CSS) connected to NMI vector */
    Hardwarefault_IRQn                  = -13,                                   /*!< All types of failures */
    SVCall_IRQn                         = -5,                                    /*!< System service calls via SWI instructions */
    DebugMonitor_IRQn                   = -4,                                    /*!< debug monitor */
    PendSV_IRQn                         = -2,                                    /*!< Suspendable system services */
    SysTick_IRQn                        = -1,                                    /*!< System tick timer */
    IWDG_IRQn                           = 0,                                     /*!< Watchdog interrupt (IWDG is EXTI17) */
    PVD_IRQn                            = 1,                                     /*!< Supply Voltage Detect (PVD) Interrupt (EXTI16) */
    FLASH_IRQn                          = 3,                                     /*!< Flash Global Interrupt */
    RCC_IRQn                            = 4,                                     /*!< RCC  global interrupt */
    EXTI0_1_IRQn                        = 5,                                     /*!< EXTI line [1: 0] interrupt */
    EXTI2_3_IRQn                        = 6,                                     /*!< EXTI line [3: 2] interrupt */
    EXTI4_15_IRQn                       = 7,                                     /*!< EXTI line [15: 4] interrupt */
    ADC1_IRQn                           = 12,                                    /*!< ADC1 global interrupt */
    TIM1_BRK_UP_TRG_COM_IRQn            = 13,                                    /*!< TIM1 brake, update, trigger, and COM interrupt */
    TIM1_CC_IRQn                        = 14,                                    /*!< TIM1 capture compare interrupt */
    TIM3_IRQn                           = 16,                                    /*!< TIM3 global interrupt */
    TIM14_IRQn                          = 19,                                    /*!< TIM14 global interrupt */
    I2C1_IRQn                           = 23,                                    /*!< I2C1 global interrupt */
    SPI1_IRQn                           = 25,                                    /*!< SPI1 global interrupt */
    USART1_IRQn                         = 27,                                    /*!< USART1 global interrupt */
    USART2_IRQn                         = 28,                                    /*!< USART2 global interrupt */

} IRQn_Type;

/*!

 * @}
 */ /* end of group Interrupt_vector_numbers */


/* -----------------------------------------------------------------------------
 -- Cortex M0 Core Configuration
  ----------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M0 Core Configuration
 * @{
 */
#define __CM0_REV                 0x0000U   /* Core revision r0p0 */
#define __MPU_PRESENT             0U        /* no MPU present */
#define __VTOR_PRESENT            0U        /* no VTOR present */
#define __NVIC_PRIO_BITS          2U        /* Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0U        /* Set to 1 if different SysTick Config is used */

#include "core_cm0.h"                /* Core Peripheral Access Layer */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */



/* -----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ----------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{

 */

/*
** Start of section using anonymous unions
*/

#if   defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/* Define the base address of the large memory block mapping */

#define BOOT_BASE                   0x00000000u
#define FLASH_ADDR_BASE             0x08000000u
#define SYSTEMMEMORY_BASE           0x1FFFF400u
#define OPTIONBYTES_BASE            0x1FFFF800u
#define SRAM_BASE                   0x20000000u
#define APB1_0_BASE                 0x40000000u
#define APB1_1_BASE                 0x40010000u
#define AHB_0_BASE                  0x40020000u
#define AHB_1_BASE                  0x48000000u


/* Define the mapping base address of the peripheral module */
#define TIM3_BASE                   (APB1_0_BASE + 0x0400)
#define IWDG_BASE                   (APB1_0_BASE + 0x3000)
#define USART2_BASE                 (APB1_0_BASE + 0x4400)
#define I2C1_BASE                   (APB1_0_BASE + 0x5400)
#define PWR_BASE                    (APB1_0_BASE + 0x7000)

#define SYSCFG_BASE                 (APB1_1_BASE + 0x0000)
#define EXTI_BASE                   (APB1_1_BASE + 0x0400)
#define ADC1_BASE                   (APB1_1_BASE + 0x2400)
#define TIM1_BASE                   (APB1_1_BASE + 0x2C00)
#define SPI1_BASE                   (APB1_1_BASE + 0x3000)
#define DBGMCU_BASE                 (APB1_1_BASE + 0x3400)
#define USART1_BASE                 (APB1_1_BASE + 0x3800)
#define TIM14_BASE                  (APB1_1_BASE + 0x4000)

#define RCC_BASE                    (AHB_0_BASE + 0x1000)
#define FLASH_BASE                  (AHB_0_BASE + 0x2000)
#define CRC_BASE                    (AHB_0_BASE + 0x3000)

#define GPIOA_BASE                  (AHB_1_BASE + 0x0000)
#define GPIOB_BASE                  (AHB_1_BASE + 0x0400)



/*!
 * @addtogroup ADC_Peripheral_Access_Layer ADC Peripheral Access Layer
 *  @{
 */

