UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
/*******************************************************************************
 * ADC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t ADDATA;                                                         ///< Data register                                offset: 0x00
    __IO uint32_t ADCFG;                                                         ///< Configure register                           offset: 0x04
    __IO uint32_t ADCR;                                                           ///< Control register                             offset: 0x08
    __IO uint32_t Reserved0[1];                                                   ///< Reserved
    __IO uint32_t ADCMPR;                                                         ///< Compare register                             offset: 0x10
    __IO uint32_t ADSTA;                                                          ///< Status register                              offset: 0x14
    __IO uint32_t ADDR[9];                                                        ///< Channel data register                        offset: 0x18
    __IO uint32_t Reserved1[8];                                                   ///< Reserved
    __IO uint32_t CHANY0;                                                         ///< Arbitrary channel channel selection register 0offset: 0x5C
    __IO uint32_t CHANY1;                                                         ///< Arbitrary channel channel selection register 1offset: 0x60
    __IO uint32_t ANYCFG;                                                         ///< Arbitrary channel configuration register     offset: 0x64
    __IO uint32_t ANYCR;                                                          ///< Arbitrary channel control register           offset: 0x68
} ADC_Type;

/*!
 * @addtogroup ADC_Register_Masks Register Masks
 * @{ */

/*!
 * @brief ADC_ADDATA Register Bit Definition
 */

#define ADC_ADDATA_VALID_SHIFT                          (21)
#define ADC_ADDATA_VALID_MASK                           (0x01U << ADC_ADDATA_VALID_SHIFT)
#define ADC_ADDATA_VALID(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_VALID_SHIFT)) & ADC_ADDATA_VALID_MASK)

#define ADC_ADDATA_OVERRUN_SHIFT                        (20)
#define ADC_ADDATA_OVERRUN_MASK                         (0x01U << ADC_ADDATA_OVERRUN_SHIFT)
#define ADC_ADDATA_OVERRUN(x)                           (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_OVERRUN_SHIFT)) & ADC_ADDATA_OVERRUN_MASK)

#define ADC_ADDATA_CHANNELSEL_SHIFT                     (16)
#define ADC_ADDATA_CHANNELSEL_MASK                      (0x0FU << ADC_ADDATA_CHANNELSEL_SHIFT)
#define ADC_ADDATA_CHANNELSEL(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_CHANNELSEL_SHIFT)) & ADC_ADDATA_CHANNELSEL_MASK)

#define ADC_ADDATA_DATA_SHIFT                           (0)
#define ADC_ADDATA_DATA_MASK                            (0xFFFFU << ADC_ADDATA_DATA_SHIFT)
#define ADC_ADDATA_DATA(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_DATA_SHIFT)) & ADC_ADDATA_DATA_MASK)

/*!
 * @brief ADC_ADCFG Register Bit Definition
 */

#define ADC_ADCFG_ADCPREL_SHIFT                        (14)
#define ADC_ADCFG_ADCPREL_MASK                         (0x01U << ADC_ADCFG_ADCPREL_SHIFT)
#define ADC_ADCFG_ADCPREL(x)                           (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_ADCPREL_SHIFT)) & ADC_ADCFG_ADCPREL_MASK)

#define ADC_ADCFG_SAMCTL_SHIFT                         (10)
#define ADC_ADCFG_SAMCTL_MASK                          (0x0FU << ADC_ADCFG_SAMCTL_SHIFT)
#define ADC_ADCFG_SAMCTL(x)                            (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_SAMCTL_SHIFT)) & ADC_ADCFG_SAMCTL_MASK)

#define ADC_ADCFG_RSLTCTL_SHIFT                        (7)
#define ADC_ADCFG_RSLTCTL_MASK                         (0x07U << ADC_ADCFG_RSLTCTL_SHIFT)
#define ADC_ADCFG_RSLTCTL(x)                           (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_RSLTCTL_SHIFT)) & ADC_ADCFG_RSLTCTL_MASK)

#define ADC_ADCFG_ADCPREH_SHIFT                        (4)
#define ADC_ADCFG_ADCPREH_MASK                         (0x07U << ADC_ADCFG_ADCPREH_SHIFT)
#define ADC_ADCFG_ADCPREH(x)                           (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_ADCPREH_SHIFT)) & ADC_ADCFG_ADCPREH_MASK)

#define ADC_ADCFG_VSEN_SHIFT                           (3)
#define ADC_ADCFG_VSEN_MASK                            (0x01U << ADC_ADCFG_VSEN_SHIFT)
#define ADC_ADCFG_VSEN(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_VSEN_SHIFT)) & ADC_ADCFG_VSEN_MASK)

#define ADC_ADCFG_AWDEN_SHIFT                          (1)
#define ADC_ADCFG_AWDEN_MASK                           (0x01U << ADC_ADCFG_AWDEN_SHIFT)
#define ADC_ADCFG_AWDEN(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_AWDEN_SHIFT)) & ADC_ADCFG_AWDEN_MASK)

#define ADC_ADCFG_ADEN_SHIFT                           (0)
#define ADC_ADCFG_ADEN_MASK                            (0x01U << ADC_ADCFG_ADEN_SHIFT)
#define ADC_ADCFG_ADEN(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_ADEN_SHIFT)) & ADC_ADCFG_ADEN_MASK)

/*!
 * @brief ADC_ADCR Register Bit Definition
 */

#define ADC_ADCR_TRGEDGE_SHIFT                          (24)
#define ADC_ADCR_TRGEDGE_MASK                           (0x03U << ADC_ADCR_TRGEDGE_SHIFT)
#define ADC_ADCR_TRGEDGE(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_TRGEDGE_SHIFT)) & ADC_ADCR_TRGEDGE_MASK)

#define ADC_ADCR_TRGSHIFT_SHIFT                         (19)
#define ADC_ADCR_TRGSHIFT_MASK                          (0x07U << ADC_ADCR_TRGSHIFT_SHIFT)
#define ADC_ADCR_TRGSHIFT(x)                            (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_TRGSHIFT_SHIFT)) & ADC_ADCR_TRGSHIFT_MASK)

#define ADC_ADCR_TRGSELH_SHIFT                          (17)
#define ADC_ADCR_TRGSELH_MASK                           (0x03U << ADC_ADCR_TRGSELH_SHIFT)
#define ADC_ADCR_TRGSELH(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_TRGSELH_SHIFT)) & ADC_ADCR_TRGSELH_MASK)

#define ADC_ADCR_CMPCH_SHIFT                            (12)
#define ADC_ADCR_CMPCH_MASK                             (0x0FU << ADC_ADCR_CMPCH_SHIFT)
#define ADC_ADCR_CMPCH(x)                               (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_CMPCH_SHIFT)) & ADC_ADCR_CMPCH_MASK)

