UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define ADC_ADCR_ALIGN_SHIFT                            (11)
#define ADC_ADCR_ALIGN_MASK                             (0x01U << ADC_ADCR_ALIGN_SHIFT)
#define ADC_ADCR_ALIGN(x)                               (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_ALIGN_SHIFT)) & ADC_ADCR_ALIGN_MASK)

#define ADC_ADCR_ADMD_SHIFT                             (9)
#define ADC_ADCR_ADMD_MASK                              (0x03U << ADC_ADCR_ADMD_SHIFT)
#define ADC_ADCR_ADMD(x)                                (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_ADMD_SHIFT)) & ADC_ADCR_ADMD_MASK)

#define ADC_ADCR_ADST_SHIFT                             (8)
#define ADC_ADCR_ADST_MASK                              (0x01U << ADC_ADCR_ADST_SHIFT)
#define ADC_ADCR_ADST(x)                                (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_ADST_SHIFT)) & ADC_ADCR_ADST_MASK)

#define ADC_ADCR_TRGSELL_SHIFT                          (4)
#define ADC_ADCR_TRGSELL_MASK                           (0x07U << ADC_ADCR_TRGSELL_SHIFT)
#define ADC_ADCR_TRGSELL(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_TRGSELL_SHIFT)) & ADC_ADCR_TRGSELL_MASK)

#define ADC_ADCR_TRGEN_SHIFT                            (2)
#define ADC_ADCR_TRGEN_MASK                             (0x01U << ADC_ADCR_TRGEN_SHIFT)
#define ADC_ADCR_TRGEN(x)                               (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_TRGEN_SHIFT)) & ADC_ADCR_TRGEN_MASK)

#define ADC_ADCR_AWDIE_SHIFT                            (1)
#define ADC_ADCR_AWDIE_MASK                             (0x01U << ADC_ADCR_AWDIE_SHIFT)
#define ADC_ADCR_AWDIE(x)                               (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_AWDIE_SHIFT)) & ADC_ADCR_AWDIE_MASK)

#define ADC_ADCR_ADIE_SHIFT                             (0)
#define ADC_ADCR_ADIE_MASK                              (0x01U << ADC_ADCR_ADIE_SHIFT)
#define ADC_ADCR_ADIE(x)                                (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_ADIE_SHIFT)) & ADC_ADCR_ADIE_MASK)

/*!
 * @brief ADC_ADCMPR Register Bit Definition
 */

#define ADC_ADCMPR_CMPHDATA_SHIFT                       (16)
#define ADC_ADCMPR_CMPHDATA_MASK                        (0xFFFU << ADC_ADCMPR_CMPHDATA_SHIFT)
#define ADC_ADCMPR_CMPHDATA(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_ADCMPR_CMPHDATA_SHIFT)) & ADC_ADCMPR_CMPHDATA_MASK)

#define ADC_ADCMPR_CMPLDATA_SHIFT                       (0)
#define ADC_ADCMPR_CMPLDATA_MASK                        (0xFFFU << ADC_ADCMPR_CMPLDATA_SHIFT)
#define ADC_ADCMPR_CMPLDATA(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_ADCMPR_CMPLDATA_SHIFT)) & ADC_ADCMPR_CMPLDATA_MASK)

/*!
 * @brief ADC_ADSTA Register Bit Definition
 */

#define ADC_ADSTA_OVERRUN_SHIFT                         (20)
#define ADC_ADSTA_OVERRUN_MASK                          (0x3FFU << ADC_ADSTA_OVERRUN_SHIFT)
#define ADC_ADSTA_OVERRUN(x)                            (((uint32_t)(((uint32_t)(x)) << ADC_ADSTA_OVERRUN_SHIFT)) & ADC_ADSTA_OVERRUN_MASK)

#define ADC_ADSTA_VALID_SHIFT                           (8)
#define ADC_ADSTA_VALID_MASK                            (0x1FFU << ADC_ADSTA_VALID_SHIFT)
#define ADC_ADSTA_VALID(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_ADSTA_VALID_SHIFT)) & ADC_ADSTA_VALID_MASK)

#define ADC_ADSTA_CH_SHIFT                              (4)
#define ADC_ADSTA_CH_MASK                               (0x0FU << ADC_ADSTA_CH_SHIFT)
#define ADC_ADSTA_CH(x)                                 (((uint32_t)(((uint32_t)(x)) << ADC_ADSTA_CH_SHIFT)) & ADC_ADSTA_CH_MASK)

#define ADC_ADSTA_BUSY_SHIFT                            (2)
#define ADC_ADSTA_BUSY_MASK                             (0x01U << ADC_ADSTA_BUSY_SHIFT)
#define ADC_ADSTA_BUSY(x)                               (((uint32_t)(((uint32_t)(x)) << ADC_ADSTA_BUSY_SHIFT)) & ADC_ADSTA_BUSY_MASK)

#define ADC_ADSTA_AWDIF_SHIFT                           (1)
#define ADC_ADSTA_AWDIF_MASK                            (0x01U << ADC_ADSTA_AWDIF_SHIFT)
#define ADC_ADSTA_AWDIF(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_ADSTA_AWDIF_SHIFT)) & ADC_ADSTA_AWDIF_MASK)

#define ADC_ADSTA_ADIF_SHIFT                            (0)
#define ADC_ADSTA_ADIF_MASK                             (0x01U << ADC_ADSTA_ADIF_SHIFT)
#define ADC_ADSTA_ADIF(x)                               (((uint32_t)(((uint32_t)(x)) << ADC_ADSTA_ADIF_SHIFT)) & ADC_ADSTA_ADIF_MASK)

/*!
 * @brief ADC_ADDR Register Bit Definition
 */

#define ADC_ADDR_VALID_SHIFT                            (21)
#define ADC_ADDR_VALID_MASK                             (0x01U << ADC_ADDR_VALID_SHIFT)
#define ADC_ADDR_VALID(x)                               (((uint32_t)(((uint32_t)(x)) << ADC_ADDR_VALID_SHIFT)) & ADC_ADDR_VALID_MASK)
#define ADC_ADDR_OVERRUN_SHIFT                          (20)
#define ADC_ADDR_OVERRUN_MASK                           (0x01U << ADC_ADDR_OVERRUN_SHIFT)
#define ADC_ADDR_OVERRUN(x)                             (((uint32_t)(((uint32_t)(x)) << ADC_ADDR_OVERRUN_SHIFT)) & ADC_ADDR_OVERRUN_MASK)
#define ADC_ADDR_DATA_SHIFT                             (0)
#define ADC_ADDR_DATA_MASK                              (0xFFFFU << ADC_ADDR_DATA_SHIFT)
#define ADC_ADDR_DATA(x)                                (((uint32_t)(((uint32_t)(x)) << ADC_ADDR_DATA_SHIFT)) & ADC_ADDR_DATA_MASK)

/*!
 * @brief ADC_CHANY0 Register Bit Definition
 */

#define ADC_CHANY0_CHANYSEL7_SHIFT                      (28)
#define ADC_CHANY0_CHANYSEL7_MASK                       (0x0FU << ADC_CHANY0_CHANYSEL7_SHIFT)
#define ADC_CHANY0_CHANYSEL7(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSEL7_SHIFT)) & ADC_CHANY0_CHANYSEL7_MASK)

#define ADC_CHANY0_CHANYSEL6_SHIFT                      (24)
#define ADC_CHANY0_CHANYSEL6_MASK                       (0x0FU << ADC_CHANY0_CHANYSEL6_SHIFT)
#define ADC_CHANY0_CHANYSEL6(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSEL6_SHIFT)) & ADC_CHANY0_CHANYSEL6_MASK)

#define ADC_CHANY0_CHANYSEL5_SHIFT                      (20)
#define ADC_CHANY0_CHANYSEL5_MASK                       (0x0FU << ADC_CHANY0_CHANYSEL5_SHIFT)
#define ADC_CHANY0_CHANYSEL5(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSEL5_SHIFT)) & ADC_CHANY0_CHANYSEL5_MASK)

#define ADC_CHANY0_CHANYSEL4_SHIFT                      (16)
#define ADC_CHANY0_CHANYSEL4_MASK                       (0x0FU << ADC_CHANY0_CHANYSEL4_SHIFT)
#define ADC_CHANY0_CHANYSEL4(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSEL4_SHIFT)) & ADC_CHANY0_CHANYSEL4_MASK)

#define ADC_CHANY0_CHANYSEL3_SHIFT                      (12)
#define ADC_CHANY0_CHANYSEL3_MASK                       (0x0FU << ADC_CHANY0_CHANYSEL3_SHIFT)
#define ADC_CHANY0_CHANYSEL3(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSEL3_SHIFT)) & ADC_CHANY0_CHANYSEL3_MASK)

#define ADC_CHANY0_CHANYSEL2_SHIFT                      (8)
#define ADC_CHANY0_CHANYSEL2_MASK                       (0x0FU << ADC_CHANY0_CHANYSEL2_SHIFT)
#define ADC_CHANY0_CHANYSEL2(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSEL2_SHIFT)) & ADC_CHANY0_CHANYSEL2_MASK)

#define ADC_CHANY0_CHANYSEL1_SHIFT                      (4)
#define ADC_CHANY0_CHANYSEL1_MASK                       (0x0FU << ADC_CHANY0_CHANYSEL1_SHIFT)
#define ADC_CHANY0_CHANYSEL1(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSEL1_SHIFT)) & ADC_CHANY0_CHANYSEL1_MASK)

#define ADC_CHANY0_CHANYSEL0_SHIFT                      (0)
#define ADC_CHANY0_CHANYSEL0_MASK                       (0x0FU << ADC_CHANY0_CHANYSEL0_SHIFT)
#define ADC_CHANY0_CHANYSEL0(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSEL0_SHIFT)) & ADC_CHANY0_CHANYSEL0_MASK)

/*!
 * @brief ADC_CHANY1 Register Bit Definition
 */

#define ADC_CHANY1_CHANYSEL8_SHIFT                      (0)
#define ADC_CHANY1_CHANYSEL8_MASK                       (0x0FU << ADC_CHANY1_CHANYSEL8_SHIFT)
#define ADC_CHANY1_CHANYSEL8(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CHANY1_CHANYSEL8_SHIFT)) & ADC_CHANY1_CHANYSEL8_MASK)

/*!
 * @brief ADC_ANYCFG Register Bit Definition
 */

#define ADC_ANYCFG_CHANYNUM_SHIFT                      (0)
#define ADC_ANYCFG_CHANYNUM_MASK                       (0x0FU << ADC_ANYCFG_CHANYNUM_SHIFT)
#define ADC_ANYCFG_CHANYNUM(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYNUM_SHIFT)) & ADC_ANYCFG_CHANYNUM_MASK)

/*!
 * @brief ADC_ANYCR Register Bit Definition
 */

#define ADC_ANYCR_CHANYMDEN_SHIFT                      (0)
#define ADC_ANYCR_CHANYMDEN_MASK                       (0x01U << ADC_ANYCR_CHANYMDEN_SHIFT)
#define ADC_ANYCR_CHANYMDEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_ANYCR_CHANYMDEN_SHIFT)) & ADC_ANYCR_CHANYMDEN_MASK)

/*!
 * @}
 */ /* end of group ADC_Register_Masks */
/******************************************************************************
 * ADC Instance
 ******************************************************************************/

