UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define ADC1                ((ADC_Type*)ADC1_BASE)

/*!
 * @}
 */ /* end of group ADC_Peripheral_Access_Layer */

/*!
 * @addtogroup CRC_Peripheral_Access_Layer CRC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * CRC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t DR;                                                             ///< Data register                                offset: 0x00
    __IO uint32_t IDR;                                                            ///< Independent data register                    offset: 0x04
    __IO uint32_t CTRL;                                                           ///< Control register                             offset: 0x08
} CRC_Type;

/*!
 * @addtogroup CRC_Register_Masks Register Masks
 * @{ */

/*!
 * @brief CRC_DR Register Bit Definition
 */

#define CRC_DR_DR_SHIFT                                 (0)
#define CRC_DR_DR_MASK                                  (0xFFFFFFFFU << CRC_DR_DR_SHIFT)
#define CRC_DR_DR(x)                                    (((uint32_t)(((uint32_t)(x)) << CRC_DR_DR_SHIFT)) & CRC_DR_DR_MASK)

/*!
 * @brief CRC_IDR Register Bit Definition
 */

#define CRC_IDR_IDR_SHIFT                               (0)
#define CRC_IDR_IDR_MASK                                (0xFFU << CRC_IDR_IDR_SHIFT)
#define CRC_IDR_IDR(x)                                  (((uint32_t)(((uint32_t)(x)) << CRC_IDR_IDR_SHIFT)) & CRC_IDR_IDR_MASK)

/*!
 * @brief CRC_CTRL Register Bit Definition
 */

#define CRC_CTRL_RESET_SHIFT                            (0)
#define CRC_CTRL_RESET_MASK                             (0x01U << CRC_CTRL_RESET_SHIFT)
#define CRC_CTRL_RESET(x)                               (((uint32_t)(((uint32_t)(x)) << CRC_CTRL_RESET_SHIFT)) & CRC_CTRL_RESET_MASK)

/*!
 * @}
 */ /* end of group CRC_Register_Masks */
/******************************************************************************
 * CRC Instance
 ******************************************************************************/

#define CRC                ((CRC_Type*)CRC_BASE)

/*!
 * @}
 */ /* end of group CRC_Peripheral_Access_Layer */

/*!
 * @addtogroup DBGMCU_Peripheral_Access_Layer DBG Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * DBGMCU Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t IDCODE;                                                         ///< ID CODE                                      offset: 0x00
    __IO uint32_t CR;                                                             ///< Control Register                             offset: 0x04
} DBGMCU_Type;

/*!
 * @addtogroup DBGMCU_Register_Masks Register Masks
 * @{ */

/*!
 * @brief DBGMCU_IDCODE Register Bit Definition
 */

#define DBGMCU_IDCODE_DEVID_SHIFT                          (0)
#define DBGMCU_IDCODE_DEVID_MASK                           (0xFFFFFFFFU << DBGMCU_IDCODE_DEVID_SHIFT)
#define DBGMCU_IDCODE_DEVID(x)                             (((uint32_t)(((uint32_t)(x)) << DBGMCU_IDCODE_DEVID_SHIFT)) & DBGMCU_IDCODE_DEVID_MASK)

/*!
 * @brief DBGMCU_CR Register Bit Definition
 */

#define DBGMCU_CR_DBGTIM14STOP_SHIFT                       (18)
#define DBGMCU_CR_DBGTIM14STOP_MASK                        (0x01U << DBGMCU_CR_DBGTIM14STOP_SHIFT)
#define DBGMCU_CR_DBGTIM14STOP(x)                          (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM14STOP_SHIFT)) & DBGMCU_CR_DBGTIM14STOP_MASK)

#define DBGMCU_CR_DBGTIM3PWMOFF_SHIFT                      (15)
#define DBGMCU_CR_DBGTIM3PWMOFF_MASK                       (0x01U << DBGMCU_CR_DBGTIM3PWMOFF_SHIFT)
#define DBGMCU_CR_DBGTIM3PWMOFF(x)                         (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM3PWMOFF_SHIFT)) & DBGMCU_CR_DBGTIM3PWMOFF_MASK)

#define DBGMCU_CR_DBGTIM1PWMOFF_SHIFT                      (13)
#define DBGMCU_CR_DBGTIM1PWMOFF_MASK                       (0x01U << DBGMCU_CR_DBGTIM1PWMOFF_SHIFT)
#define DBGMCU_CR_DBGTIM1PWMOFF(x)                         (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM1PWMOFF_SHIFT)) & DBGMCU_CR_DBGTIM1PWMOFF_MASK)

#define DBGMCU_CR_DBGTIM3STOP_SHIFT                        (12)
#define DBGMCU_CR_DBGTIM3STOP_MASK                         (0x01U << DBGMCU_CR_DBGTIM3STOP_SHIFT)
#define DBGMCU_CR_DBGTIM3STOP(x)                           (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM3STOP_SHIFT)) & DBGMCU_CR_DBGTIM3STOP_MASK)

#define DBGMCU_CR_DBGTIM1STOP_SHIFT                        (10)
#define DBGMCU_CR_DBGTIM1STOP_MASK                         (0x01U << DBGMCU_CR_DBGTIM1STOP_SHIFT)
#define DBGMCU_CR_DBGTIM1STOP(x)                           (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM1STOP_SHIFT)) & DBGMCU_CR_DBGTIM1STOP_MASK)

#define DBGMCU_CR_DBGIWDGSTOP_SHIFT                        (8)
#define DBGMCU_CR_DBGIWDGSTOP_MASK                         (0x01U << DBGMCU_CR_DBGIWDGSTOP_SHIFT)
#define DBGMCU_CR_DBGIWDGSTOP(x)                           (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGIWDGSTOP_SHIFT)) & DBGMCU_CR_DBGIWDGSTOP_MASK)

#define DBGMCU_CR_DBGSTOPFORLDO_SHIFT                      (3)
#define DBGMCU_CR_DBGSTOPFORLDO_MASK                       (0x01U << DBGMCU_CR_DBGSTOPFORLDO_SHIFT)
#define DBGMCU_CR_DBGSTOPFORLDO(x)                         (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGSTOPFORLDO_SHIFT)) & DBGMCU_CR_DBGSTOPFORLDO_MASK)

#define DBGMCU_CR_DBGSTOP_SHIFT                            (1)
#define DBGMCU_CR_DBGSTOP_MASK                             (0x01U << DBGMCU_CR_DBGSTOP_SHIFT)
#define DBGMCU_CR_DBGSTOP(x)                               (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGSTOP_SHIFT)) & DBGMCU_CR_DBGSTOP_MASK)

#define DBGMCU_CR_DBGSLEEP_SHIFT                           (0)
#define DBGMCU_CR_DBGSLEEP_MASK                            (0x01U << DBGMCU_CR_DBGSLEEP_SHIFT)
#define DBGMCU_CR_DBGSLEEP(x)                              (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGSLEEP_SHIFT)) & DBGMCU_CR_DBGSLEEP_MASK)

/*!
 * @}
 */ /* end of group DBGMCU_Register_Masks */
/******************************************************************************
 * DBGMCU Instance
 ******************************************************************************/

#define DBGMCU                ((DBGMCU_Type*)DBGMCU_BASE)

/*!
 * @}
 */ /* end of group DBGMCU_Peripheral_Access_Layer */

/*!
 * @addtogroup DEVICE_Peripheral_Access_Layer DEVICE Peripheral Access Layer
 *  @{
 */

