UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
/*******************************************************************************
 * DEVICE Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t UID1;                                                           ///< Configuration register                       offset: 0x00
    __IO uint32_t UID2;                                                           ///< Configuration register                       offset: 0x04
    __IO uint32_t UID3;                                                           ///< Configuration register                       offset: 0x08
} DEVICE_Type;

/*!
 * @addtogroup DEVICE_Register_Masks Register Masks
 * @{ */

/*!
 * @brief DEVICE_UID1 Register Bit Definition
 */

#define DEVICE_UID1_UID_SHIFT                           (0)
#define DEVICE_UID1_UID_MASK                            (0xFFFFFFFFU << DEVICE_UID1_UID_SHIFT)
#define DEVICE_UID1_UID(x)                              (((uint32_t)(((uint32_t)(x)) << DEVICE_UID1_UID_SHIFT)) & DEVICE_UID1_UID_MASK)

/*!
 * @brief DEVICE_UID2 Register Bit Definition
 */

#define DEVICE_UID2_UID_SHIFT                           (0)
#define DEVICE_UID2_UID_MASK                            (0xFFFFFFFFU << DEVICE_UID2_UID_SHIFT)
#define DEVICE_UID2_UID(x)                              (((uint32_t)(((uint32_t)(x)) << DEVICE_UID2_UID_SHIFT)) & DEVICE_UID2_UID_MASK)

/*!
 * @brief DEVICE_UID3 Register Bit Definition
 */

#define DEVICE_UID3_UID_SHIFT                           (0)
#define DEVICE_UID3_UID_MASK                            (0xFFFFFFFFU << DEVICE_UID3_UID_SHIFT)
#define DEVICE_UID3_UID(x)                              (((uint32_t)(((uint32_t)(x)) << DEVICE_UID3_UID_SHIFT)) & DEVICE_UID3_UID_MASK)

/*!
 * @}
 */ /* end of group DEVICE_Register_Masks */
/******************************************************************************
 * DEVICE Instance
 ******************************************************************************/

#define DEVICE                ((DEVICE_Type*)DEVICE_BASE)

/*!
 * @}
 */ /* end of group DEVICE_Peripheral_Access_Layer */

/*!
 * @addtogroup SYSCFG_Peripheral_Access_Layer SYSCFG Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * SYSCFG Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CFGR;                                                           ///< Configuration register                       offset: 0x00
    __IO uint32_t Reserved0[1];                                                   ///< Reserved
    __IO uint32_t EXTICR1;                                                        ///< External interrupt configuration register 1  offset: 0x08
    __IO uint32_t EXTICR2;                                                        ///< External interrupt configuration register 2  offset: 0x0C
    __IO uint32_t EXTICR3;                                                        ///< External interrupt configuration register 3  offset: 0x10
    __IO uint32_t EXTICR4;                                                        ///< External interrupt configuration register 4  offset: 0x14
    __IO uint32_t PADHYS;                                                         ///< PAD configuration register                   offset: 0x18
} SYSCFG_Type;

/*!
 * @addtogroup SYSCFG_Register_Masks Register Masks
 * @{ */

/*!
 * @brief SYSCFG_CFGR Register Bit Definition
 */

#define SYSCFG_CFGR_MEMMODE_SHIFT                       (0)
#define SYSCFG_CFGR_MEMMODE_MASK                        (0x03U << SYSCFG_CFGR_MEMMODE_SHIFT)
#define SYSCFG_CFGR_MEMMODE(x)                          (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR_MEMMODE_SHIFT)) & SYSCFG_CFGR_MEMMODE_MASK)

/*!
 * @brief SYSCFG_EXTICR1 Register Bit Definition
 */

#define SYSCFG_EXTICR1_EXTI3_SHIFT                      (12)
#define SYSCFG_EXTICR1_EXTI3_MASK                       (0x0FU << SYSCFG_EXTICR1_EXTI3_SHIFT)
#define SYSCFG_EXTICR1_EXTI3(x)                         (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI3_SHIFT)) & SYSCFG_EXTICR1_EXTI3_MASK)

#define SYSCFG_EXTICR1_EXTI2_SHIFT                      (8)
#define SYSCFG_EXTICR1_EXTI2_MASK                       (0x0FU << SYSCFG_EXTICR1_EXTI2_SHIFT)
#define SYSCFG_EXTICR1_EXTI2(x)                         (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI2_SHIFT)) & SYSCFG_EXTICR1_EXTI2_MASK)

#define SYSCFG_EXTICR1_EXTI1_SHIFT                      (4)
#define SYSCFG_EXTICR1_EXTI1_MASK                       (0x0FU << SYSCFG_EXTICR1_EXTI1_SHIFT)
#define SYSCFG_EXTICR1_EXTI1(x)                         (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI1_SHIFT)) & SYSCFG_EXTICR1_EXTI1_MASK)

#define SYSCFG_EXTICR1_EXTI0_SHIFT                      (0)
#define SYSCFG_EXTICR1_EXTI0_MASK                       (0x0FU << SYSCFG_EXTICR1_EXTI0_SHIFT)
#define SYSCFG_EXTICR1_EXTI0(x)                         (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI0_SHIFT)) & SYSCFG_EXTICR1_EXTI0_MASK)

/*!
 * @brief SYSCFG_EXTICR2 Register Bit Definition
 */

#define SYSCFG_EXTICR2_EXTI7_SHIFT                      (12)
#define SYSCFG_EXTICR2_EXTI7_MASK                       (0x0FU << SYSCFG_EXTICR2_EXTI7_SHIFT)
#define SYSCFG_EXTICR2_EXTI7(x)                         (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI7_SHIFT)) & SYSCFG_EXTICR2_EXTI7_MASK)

#define SYSCFG_EXTICR2_EXTI6_SHIFT                      (8)
#define SYSCFG_EXTICR2_EXTI6_MASK                       (0x0FU << SYSCFG_EXTICR2_EXTI6_SHIFT)
#define SYSCFG_EXTICR2_EXTI6(x)                         (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI6_SHIFT)) & SYSCFG_EXTICR2_EXTI6_MASK)

#define SYSCFG_EXTICR2_EXTI5_SHIFT                      (4)
#define SYSCFG_EXTICR2_EXTI5_MASK                       (0x0FU << SYSCFG_EXTICR2_EXTI5_SHIFT)
#define SYSCFG_EXTICR2_EXTI5(x)                         (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI5_SHIFT)) & SYSCFG_EXTICR2_EXTI5_MASK)

#define SYSCFG_EXTICR2_EXTI4_SHIFT                      (0)
#define SYSCFG_EXTICR2_EXTI4_MASK                       (0x0FU << SYSCFG_EXTICR2_EXTI4_SHIFT)
#define SYSCFG_EXTICR2_EXTI4(x)                         (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI4_SHIFT)) & SYSCFG_EXTICR2_EXTI4_MASK)

/*!
 * @brief SYSCFG_EXTICR3 Register Bit Definition
 */

