UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define SYSCFG_EXTICR3_EXTI11_SHIFT                     (12)
#define SYSCFG_EXTICR3_EXTI11_MASK                      (0x0FU << SYSCFG_EXTICR3_EXTI11_SHIFT)
#define SYSCFG_EXTICR3_EXTI11(x)                        (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI11_SHIFT)) & SYSCFG_EXTICR3_EXTI11_MASK)

#define SYSCFG_EXTICR3_EXTI10_SHIFT                     (8)
#define SYSCFG_EXTICR3_EXTI10_MASK                      (0x0FU << SYSCFG_EXTICR3_EXTI10_SHIFT)
#define SYSCFG_EXTICR3_EXTI10(x)                        (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI10_SHIFT)) & SYSCFG_EXTICR3_EXTI10_MASK)

#define SYSCFG_EXTICR3_EXTI9_SHIFT                      (4)
#define SYSCFG_EXTICR3_EXTI9_MASK                       (0x0FU << SYSCFG_EXTICR3_EXTI9_SHIFT)
#define SYSCFG_EXTICR3_EXTI9(x)                         (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI9_SHIFT)) & SYSCFG_EXTICR3_EXTI9_MASK)

#define SYSCFG_EXTICR3_EXTI8_SHIFT                      (0)
#define SYSCFG_EXTICR3_EXTI8_MASK                       (0x0FU << SYSCFG_EXTICR3_EXTI8_SHIFT)
#define SYSCFG_EXTICR3_EXTI8(x)                         (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI8_SHIFT)) & SYSCFG_EXTICR3_EXTI8_MASK)

/*!
 * @brief SYSCFG_EXTICR4 Register Bit Definition
 */

#define SYSCFG_EXTICR4_EXTI15_SHIFT                     (12)
#define SYSCFG_EXTICR4_EXTI15_MASK                      (0x0FU << SYSCFG_EXTICR4_EXTI15_SHIFT)
#define SYSCFG_EXTICR4_EXTI15(x)                        (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI15_SHIFT)) & SYSCFG_EXTICR4_EXTI15_MASK)

#define SYSCFG_EXTICR4_EXTI14_SHIFT                     (8)
#define SYSCFG_EXTICR4_EXTI14_MASK                      (0x0FU << SYSCFG_EXTICR4_EXTI14_SHIFT)
#define SYSCFG_EXTICR4_EXTI14(x)                        (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI14_SHIFT)) & SYSCFG_EXTICR4_EXTI14_MASK)

#define SYSCFG_EXTICR4_EXTI13_SHIFT                     (4)
#define SYSCFG_EXTICR4_EXTI13_MASK                      (0x0FU << SYSCFG_EXTICR4_EXTI13_SHIFT)
#define SYSCFG_EXTICR4_EXTI13(x)                        (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI13_SHIFT)) & SYSCFG_EXTICR4_EXTI13_MASK)

#define SYSCFG_EXTICR4_EXTI12_SHIFT                     (0)
#define SYSCFG_EXTICR4_EXTI12_MASK                      (0x0FU << SYSCFG_EXTICR4_EXTI12_SHIFT)
#define SYSCFG_EXTICR4_EXTI12(x)                        (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI12_SHIFT)) & SYSCFG_EXTICR4_EXTI12_MASK)

/*!
 * @brief SYSCFG_PADHYS Register Bit Definition
 */

#define SYSCFG_PADHYS_I2C1MODESEL_SHIFT                 (16)
#define SYSCFG_PADHYS_I2C1MODESEL_MASK                  (0x01U << SYSCFG_PADHYS_I2C1MODESEL_SHIFT)
#define SYSCFG_PADHYS_I2C1MODESEL(x)                    (((uint32_t)(((uint32_t)(x)) << SYSCFG_PADHYS_I2C1MODESEL_SHIFT)) & SYSCFG_PADHYS_I2C1MODESEL_MASK)

/*!
 * @}
 */ /* end of group SYSCFG_Register_Masks */
/******************************************************************************
 * SYSCFG Instance
 ******************************************************************************/

#define SYSCFG                ((SYSCFG_Type*)SYSCFG_BASE)

/*!
 * @}
 */ /* end of group SYSCFG_Peripheral_Access_Layer */

/*!
 * @addtogroup EXTI_Peripheral_Access_Layer EXTI Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * EXTI Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t IMR;                                                            ///< Interrupt mask register                      offset: 0x00
    __IO uint32_t EMR;                                                            ///< Event mask register                          offset: 0x04
    __IO uint32_t RTSR;                                                           ///< Rising trigger selection register            offset: 0x08
    __IO uint32_t FTSR;                                                           ///< Falling trigger selection register           offset: 0x0C
    __IO uint32_t SWIER;                                                          ///< Software interrupt event register            offset: 0x10
    __IO uint32_t PR;                                                             ///< Pending register                             offset: 0x14
} EXTI_Type;

/*!
 * @addtogroup EXTI_Register_Masks Register Masks
 * @{ */

/*!
 * @brief EXTI_IMR Register Bit Definition
 */

#define EXTI_IMR_IMR17_SHIFT                            (17)
#define EXTI_IMR_IMR17_MASK                             (0x01U << EXTI_IMR_IMR17_SHIFT)
#define EXTI_IMR_IMR17(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR17_SHIFT)) & EXTI_IMR_IMR17_MASK)

#define EXTI_IMR_IMR16_SHIFT                            (16)
#define EXTI_IMR_IMR16_MASK                             (0x01U << EXTI_IMR_IMR16_SHIFT)
#define EXTI_IMR_IMR16(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR16_SHIFT)) & EXTI_IMR_IMR16_MASK)

#define EXTI_IMR_IMR15_SHIFT                            (15)
#define EXTI_IMR_IMR15_MASK                             (0x01U << EXTI_IMR_IMR15_SHIFT)
#define EXTI_IMR_IMR15(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR15_SHIFT)) & EXTI_IMR_IMR15_MASK)

#define EXTI_IMR_IMR14_SHIFT                            (14)
#define EXTI_IMR_IMR14_MASK                             (0x01U << EXTI_IMR_IMR14_SHIFT)
#define EXTI_IMR_IMR14(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR14_SHIFT)) & EXTI_IMR_IMR14_MASK)

#define EXTI_IMR_IMR13_SHIFT                            (13)
#define EXTI_IMR_IMR13_MASK                             (0x01U << EXTI_IMR_IMR13_SHIFT)
#define EXTI_IMR_IMR13(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR13_SHIFT)) & EXTI_IMR_IMR13_MASK)

#define EXTI_IMR_IMR12_SHIFT                            (12)
#define EXTI_IMR_IMR12_MASK                             (0x01U << EXTI_IMR_IMR12_SHIFT)
#define EXTI_IMR_IMR12(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR12_SHIFT)) & EXTI_IMR_IMR12_MASK)

#define EXTI_IMR_IMR11_SHIFT                            (11)
#define EXTI_IMR_IMR11_MASK                             (0x01U << EXTI_IMR_IMR11_SHIFT)
#define EXTI_IMR_IMR11(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR11_SHIFT)) & EXTI_IMR_IMR11_MASK)

#define EXTI_IMR_IMR10_SHIFT                            (10)
#define EXTI_IMR_IMR10_MASK                             (0x01U << EXTI_IMR_IMR10_SHIFT)
#define EXTI_IMR_IMR10(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR10_SHIFT)) & EXTI_IMR_IMR10_MASK)

#define EXTI_IMR_IMR9_SHIFT                             (9)
#define EXTI_IMR_IMR9_MASK                              (0x01U << EXTI_IMR_IMR9_SHIFT)
#define EXTI_IMR_IMR9(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR9_SHIFT)) & EXTI_IMR_IMR9_MASK)

#define EXTI_IMR_IMR8_SHIFT                             (8)
#define EXTI_IMR_IMR8_MASK                              (0x01U << EXTI_IMR_IMR8_SHIFT)
#define EXTI_IMR_IMR8(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR8_SHIFT)) & EXTI_IMR_IMR8_MASK)

