UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define EXTI_IMR_IMR7_SHIFT                             (7)
#define EXTI_IMR_IMR7_MASK                              (0x01U << EXTI_IMR_IMR7_SHIFT)
#define EXTI_IMR_IMR7(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR7_SHIFT)) & EXTI_IMR_IMR7_MASK)

#define EXTI_IMR_IMR6_SHIFT                             (6)
#define EXTI_IMR_IMR6_MASK                              (0x01U << EXTI_IMR_IMR6_SHIFT)
#define EXTI_IMR_IMR6(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR6_SHIFT)) & EXTI_IMR_IMR6_MASK)

#define EXTI_IMR_IMR5_SHIFT                             (5)
#define EXTI_IMR_IMR5_MASK                              (0x01U << EXTI_IMR_IMR5_SHIFT)
#define EXTI_IMR_IMR5(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR5_SHIFT)) & EXTI_IMR_IMR5_MASK)

#define EXTI_IMR_IMR4_SHIFT                             (4)
#define EXTI_IMR_IMR4_MASK                              (0x01U << EXTI_IMR_IMR4_SHIFT)
#define EXTI_IMR_IMR4(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR4_SHIFT)) & EXTI_IMR_IMR4_MASK)

#define EXTI_IMR_IMR3_SHIFT                             (3)
#define EXTI_IMR_IMR3_MASK                              (0x01U << EXTI_IMR_IMR3_SHIFT)
#define EXTI_IMR_IMR3(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR3_SHIFT)) & EXTI_IMR_IMR3_MASK)

#define EXTI_IMR_IMR2_SHIFT                             (2)
#define EXTI_IMR_IMR2_MASK                              (0x01U << EXTI_IMR_IMR2_SHIFT)
#define EXTI_IMR_IMR2(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR2_SHIFT)) & EXTI_IMR_IMR2_MASK)

#define EXTI_IMR_IMR1_SHIFT                             (1)
#define EXTI_IMR_IMR1_MASK                              (0x01U << EXTI_IMR_IMR1_SHIFT)
#define EXTI_IMR_IMR1(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR1_SHIFT)) & EXTI_IMR_IMR1_MASK)

#define EXTI_IMR_IMR0_SHIFT                             (0)
#define EXTI_IMR_IMR0_MASK                              (0x01U << EXTI_IMR_IMR0_SHIFT)
#define EXTI_IMR_IMR0(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR0_SHIFT)) & EXTI_IMR_IMR0_MASK)

/*!
 * @brief EXTI_EMR Register Bit Definition
 */

#define EXTI_EMR_EMR17_SHIFT                            (17)
#define EXTI_EMR_EMR17_MASK                             (0x01U << EXTI_EMR_EMR17_SHIFT)
#define EXTI_EMR_EMR17(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR17_SHIFT)) & EXTI_EMR_EMR17_MASK)

#define EXTI_EMR_EMR16_SHIFT                            (16)
#define EXTI_EMR_EMR16_MASK                             (0x01U << EXTI_EMR_EMR16_SHIFT)
#define EXTI_EMR_EMR16(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR16_SHIFT)) & EXTI_EMR_EMR16_MASK)

#define EXTI_EMR_EMR15_SHIFT                            (15)
#define EXTI_EMR_EMR15_MASK                             (0x01U << EXTI_EMR_EMR15_SHIFT)
#define EXTI_EMR_EMR15(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR15_SHIFT)) & EXTI_EMR_EMR15_MASK)

#define EXTI_EMR_EMR14_SHIFT                            (14)
#define EXTI_EMR_EMR14_MASK                             (0x01U << EXTI_EMR_EMR14_SHIFT)
#define EXTI_EMR_EMR14(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR14_SHIFT)) & EXTI_EMR_EMR14_MASK)

#define EXTI_EMR_EMR13_SHIFT                            (13)
#define EXTI_EMR_EMR13_MASK                             (0x01U << EXTI_EMR_EMR13_SHIFT)
#define EXTI_EMR_EMR13(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR13_SHIFT)) & EXTI_EMR_EMR13_MASK)

#define EXTI_EMR_EMR12_SHIFT                            (12)
#define EXTI_EMR_EMR12_MASK                             (0x01U << EXTI_EMR_EMR12_SHIFT)
#define EXTI_EMR_EMR12(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR12_SHIFT)) & EXTI_EMR_EMR12_MASK)

#define EXTI_EMR_EMR11_SHIFT                            (11)
#define EXTI_EMR_EMR11_MASK                             (0x01U << EXTI_EMR_EMR11_SHIFT)
#define EXTI_EMR_EMR11(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR11_SHIFT)) & EXTI_EMR_EMR11_MASK)

#define EXTI_EMR_EMR10_SHIFT                            (10)
#define EXTI_EMR_EMR10_MASK                             (0x01U << EXTI_EMR_EMR10_SHIFT)
#define EXTI_EMR_EMR10(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR10_SHIFT)) & EXTI_EMR_EMR10_MASK)

#define EXTI_EMR_EMR9_SHIFT                             (9)
#define EXTI_EMR_EMR9_MASK                              (0x01U << EXTI_EMR_EMR9_SHIFT)
#define EXTI_EMR_EMR9(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR9_SHIFT)) & EXTI_EMR_EMR9_MASK)

#define EXTI_EMR_EMR8_SHIFT                             (8)
#define EXTI_EMR_EMR8_MASK                              (0x01U << EXTI_EMR_EMR8_SHIFT)
#define EXTI_EMR_EMR8(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR8_SHIFT)) & EXTI_EMR_EMR8_MASK)

#define EXTI_EMR_EMR7_SHIFT                             (7)
#define EXTI_EMR_EMR7_MASK                              (0x01U << EXTI_EMR_EMR7_SHIFT)
#define EXTI_EMR_EMR7(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR7_SHIFT)) & EXTI_EMR_EMR7_MASK)

#define EXTI_EMR_EMR6_SHIFT                             (6)
#define EXTI_EMR_EMR6_MASK                              (0x01U << EXTI_EMR_EMR6_SHIFT)
#define EXTI_EMR_EMR6(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR6_SHIFT)) & EXTI_EMR_EMR6_MASK)

#define EXTI_EMR_EMR5_SHIFT                             (5)
#define EXTI_EMR_EMR5_MASK                              (0x01U << EXTI_EMR_EMR5_SHIFT)
#define EXTI_EMR_EMR5(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR5_SHIFT)) & EXTI_EMR_EMR5_MASK)

#define EXTI_EMR_EMR4_SHIFT                             (4)
#define EXTI_EMR_EMR4_MASK                              (0x01U << EXTI_EMR_EMR4_SHIFT)
#define EXTI_EMR_EMR4(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR4_SHIFT)) & EXTI_EMR_EMR4_MASK)

#define EXTI_EMR_EMR3_SHIFT                             (3)
#define EXTI_EMR_EMR3_MASK                              (0x01U << EXTI_EMR_EMR3_SHIFT)
#define EXTI_EMR_EMR3(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR3_SHIFT)) & EXTI_EMR_EMR3_MASK)

#define EXTI_EMR_EMR2_SHIFT                             (2)
#define EXTI_EMR_EMR2_MASK                              (0x01U << EXTI_EMR_EMR2_SHIFT)
#define EXTI_EMR_EMR2(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR2_SHIFT)) & EXTI_EMR_EMR2_MASK)

#define EXTI_EMR_EMR1_SHIFT                             (1)
#define EXTI_EMR_EMR1_MASK                              (0x01U << EXTI_EMR_EMR1_SHIFT)
#define EXTI_EMR_EMR1(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR1_SHIFT)) & EXTI_EMR_EMR1_MASK)

#define EXTI_EMR_EMR0_SHIFT                             (0)
#define EXTI_EMR_EMR0_MASK                              (0x01U << EXTI_EMR_EMR0_SHIFT)
#define EXTI_EMR_EMR0(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_EMR0_SHIFT)) & EXTI_EMR_EMR0_MASK)

/*!
 * @brief EXTI_RTSR Register Bit Definition
 */

