UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define EXTI_RTSR_TR17_SHIFT                            (17)
#define EXTI_RTSR_TR17_MASK                             (0x01U << EXTI_RTSR_TR17_SHIFT)
#define EXTI_RTSR_TR17(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR17_SHIFT)) & EXTI_RTSR_TR17_MASK)

#define EXTI_RTSR_TR16_SHIFT                            (16)
#define EXTI_RTSR_TR16_MASK                             (0x01U << EXTI_RTSR_TR16_SHIFT)
#define EXTI_RTSR_TR16(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR16_SHIFT)) & EXTI_RTSR_TR16_MASK)

#define EXTI_RTSR_TR15_SHIFT                            (15)
#define EXTI_RTSR_TR15_MASK                             (0x01U << EXTI_RTSR_TR15_SHIFT)
#define EXTI_RTSR_TR15(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR15_SHIFT)) & EXTI_RTSR_TR15_MASK)

#define EXTI_RTSR_TR14_SHIFT                            (14)
#define EXTI_RTSR_TR14_MASK                             (0x01U << EXTI_RTSR_TR14_SHIFT)
#define EXTI_RTSR_TR14(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR14_SHIFT)) & EXTI_RTSR_TR14_MASK)

#define EXTI_RTSR_TR13_SHIFT                            (13)
#define EXTI_RTSR_TR13_MASK                             (0x01U << EXTI_RTSR_TR13_SHIFT)
#define EXTI_RTSR_TR13(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR13_SHIFT)) & EXTI_RTSR_TR13_MASK)

#define EXTI_RTSR_TR12_SHIFT                            (12)
#define EXTI_RTSR_TR12_MASK                             (0x01U << EXTI_RTSR_TR12_SHIFT)
#define EXTI_RTSR_TR12(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR12_SHIFT)) & EXTI_RTSR_TR12_MASK)

#define EXTI_RTSR_TR11_SHIFT                            (11)
#define EXTI_RTSR_TR11_MASK                             (0x01U << EXTI_RTSR_TR11_SHIFT)
#define EXTI_RTSR_TR11(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR11_SHIFT)) & EXTI_RTSR_TR11_MASK)

#define EXTI_RTSR_TR10_SHIFT                            (10)
#define EXTI_RTSR_TR10_MASK                             (0x01U << EXTI_RTSR_TR10_SHIFT)
#define EXTI_RTSR_TR10(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR10_SHIFT)) & EXTI_RTSR_TR10_MASK)

#define EXTI_RTSR_TR9_SHIFT                             (9)
#define EXTI_RTSR_TR9_MASK                              (0x01U << EXTI_RTSR_TR9_SHIFT)
#define EXTI_RTSR_TR9(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR9_SHIFT)) & EXTI_RTSR_TR9_MASK)

#define EXTI_RTSR_TR8_SHIFT                             (8)
#define EXTI_RTSR_TR8_MASK                              (0x01U << EXTI_RTSR_TR8_SHIFT)
#define EXTI_RTSR_TR8(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR8_SHIFT)) & EXTI_RTSR_TR8_MASK)

#define EXTI_RTSR_TR7_SHIFT                             (7)
#define EXTI_RTSR_TR7_MASK                              (0x01U << EXTI_RTSR_TR7_SHIFT)
#define EXTI_RTSR_TR7(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR7_SHIFT)) & EXTI_RTSR_TR7_MASK)

#define EXTI_RTSR_TR6_SHIFT                             (6)
#define EXTI_RTSR_TR6_MASK                              (0x01U << EXTI_RTSR_TR6_SHIFT)
#define EXTI_RTSR_TR6(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR6_SHIFT)) & EXTI_RTSR_TR6_MASK)

#define EXTI_RTSR_TR5_SHIFT                             (5)
#define EXTI_RTSR_TR5_MASK                              (0x01U << EXTI_RTSR_TR5_SHIFT)
#define EXTI_RTSR_TR5(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR5_SHIFT)) & EXTI_RTSR_TR5_MASK)

#define EXTI_RTSR_TR4_SHIFT                             (4)
#define EXTI_RTSR_TR4_MASK                              (0x01U << EXTI_RTSR_TR4_SHIFT)
#define EXTI_RTSR_TR4(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR4_SHIFT)) & EXTI_RTSR_TR4_MASK)

#define EXTI_RTSR_TR3_SHIFT                             (3)
#define EXTI_RTSR_TR3_MASK                              (0x01U << EXTI_RTSR_TR3_SHIFT)
#define EXTI_RTSR_TR3(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR3_SHIFT)) & EXTI_RTSR_TR3_MASK)

#define EXTI_RTSR_TR2_SHIFT                             (2)
#define EXTI_RTSR_TR2_MASK                              (0x01U << EXTI_RTSR_TR2_SHIFT)
#define EXTI_RTSR_TR2(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR2_SHIFT)) & EXTI_RTSR_TR2_MASK)

#define EXTI_RTSR_TR1_SHIFT                             (1)
#define EXTI_RTSR_TR1_MASK                              (0x01U << EXTI_RTSR_TR1_SHIFT)
#define EXTI_RTSR_TR1(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR1_SHIFT)) & EXTI_RTSR_TR1_MASK)

#define EXTI_RTSR_TR0_SHIFT                             (0)
#define EXTI_RTSR_TR0_MASK                              (0x01U << EXTI_RTSR_TR0_SHIFT)
#define EXTI_RTSR_TR0(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR0_SHIFT)) & EXTI_RTSR_TR0_MASK)

/*!
 * @brief EXTI_FTSR Register Bit Definition
 */

#define EXTI_FTSR_TR17_SHIFT                            (17)
#define EXTI_FTSR_TR17_MASK                             (0x01U << EXTI_FTSR_TR17_SHIFT)
#define EXTI_FTSR_TR17(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR17_SHIFT)) & EXTI_FTSR_TR17_MASK)

#define EXTI_FTSR_TR16_SHIFT                            (16)
#define EXTI_FTSR_TR16_MASK                             (0x01U << EXTI_FTSR_TR16_SHIFT)
#define EXTI_FTSR_TR16(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR16_SHIFT)) & EXTI_FTSR_TR16_MASK)

#define EXTI_FTSR_TR15_SHIFT                            (15)
#define EXTI_FTSR_TR15_MASK                             (0x01U << EXTI_FTSR_TR15_SHIFT)
#define EXTI_FTSR_TR15(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR15_SHIFT)) & EXTI_FTSR_TR15_MASK)

#define EXTI_FTSR_TR14_SHIFT                            (14)
#define EXTI_FTSR_TR14_MASK                             (0x01U << EXTI_FTSR_TR14_SHIFT)
#define EXTI_FTSR_TR14(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR14_SHIFT)) & EXTI_FTSR_TR14_MASK)

#define EXTI_FTSR_TR13_SHIFT                            (13)
#define EXTI_FTSR_TR13_MASK                             (0x01U << EXTI_FTSR_TR13_SHIFT)
#define EXTI_FTSR_TR13(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR13_SHIFT)) & EXTI_FTSR_TR13_MASK)

#define EXTI_FTSR_TR12_SHIFT                            (12)
#define EXTI_FTSR_TR12_MASK                             (0x01U << EXTI_FTSR_TR12_SHIFT)
#define EXTI_FTSR_TR12(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR12_SHIFT)) & EXTI_FTSR_TR12_MASK)

#define EXTI_FTSR_TR11_SHIFT                            (11)
#define EXTI_FTSR_TR11_MASK                             (0x01U << EXTI_FTSR_TR11_SHIFT)
#define EXTI_FTSR_TR11(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR11_SHIFT)) & EXTI_FTSR_TR11_MASK)

#define EXTI_FTSR_TR10_SHIFT                            (10)
#define EXTI_FTSR_TR10_MASK                             (0x01U << EXTI_FTSR_TR10_SHIFT)
#define EXTI_FTSR_TR10(x)                               (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR10_SHIFT)) & EXTI_FTSR_TR10_MASK)

#define EXTI_FTSR_TR9_SHIFT                             (9)
#define EXTI_FTSR_TR9_MASK                              (0x01U << EXTI_FTSR_TR9_SHIFT)
#define EXTI_FTSR_TR9(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR9_SHIFT)) & EXTI_FTSR_TR9_MASK)

#define EXTI_FTSR_TR8_SHIFT                             (8)
#define EXTI_FTSR_TR8_MASK                              (0x01U << EXTI_FTSR_TR8_SHIFT)
#define EXTI_FTSR_TR8(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR8_SHIFT)) & EXTI_FTSR_TR8_MASK)

#define EXTI_FTSR_TR7_SHIFT                             (7)
#define EXTI_FTSR_TR7_MASK                              (0x01U << EXTI_FTSR_TR7_SHIFT)
#define EXTI_FTSR_TR7(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR7_SHIFT)) & EXTI_FTSR_TR7_MASK)

#define EXTI_FTSR_TR6_SHIFT                             (6)
#define EXTI_FTSR_TR6_MASK                              (0x01U << EXTI_FTSR_TR6_SHIFT)
#define EXTI_FTSR_TR6(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR6_SHIFT)) & EXTI_FTSR_TR6_MASK)

#define EXTI_FTSR_TR5_SHIFT                             (5)
#define EXTI_FTSR_TR5_MASK                              (0x01U << EXTI_FTSR_TR5_SHIFT)
#define EXTI_FTSR_TR5(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR5_SHIFT)) & EXTI_FTSR_TR5_MASK)

#define EXTI_FTSR_TR4_SHIFT                             (4)
#define EXTI_FTSR_TR4_MASK                              (0x01U << EXTI_FTSR_TR4_SHIFT)
#define EXTI_FTSR_TR4(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR4_SHIFT)) & EXTI_FTSR_TR4_MASK)

