UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define EXTI_FTSR_TR3_SHIFT                             (3)
#define EXTI_FTSR_TR3_MASK                              (0x01U << EXTI_FTSR_TR3_SHIFT)
#define EXTI_FTSR_TR3(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR3_SHIFT)) & EXTI_FTSR_TR3_MASK)

#define EXTI_FTSR_TR2_SHIFT                             (2)
#define EXTI_FTSR_TR2_MASK                              (0x01U << EXTI_FTSR_TR2_SHIFT)
#define EXTI_FTSR_TR2(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR2_SHIFT)) & EXTI_FTSR_TR2_MASK)

#define EXTI_FTSR_TR1_SHIFT                             (1)
#define EXTI_FTSR_TR1_MASK                              (0x01U << EXTI_FTSR_TR1_SHIFT)
#define EXTI_FTSR_TR1(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR1_SHIFT)) & EXTI_FTSR_TR1_MASK)

#define EXTI_FTSR_TR0_SHIFT                             (0)
#define EXTI_FTSR_TR0_MASK                              (0x01U << EXTI_FTSR_TR0_SHIFT)
#define EXTI_FTSR_TR0(x)                                (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR0_SHIFT)) & EXTI_FTSR_TR0_MASK)

/*!
 * @brief EXTI_SWIER Register Bit Definition
 */

#define EXTI_SWIER_SWIER17_SHIFT                        (17)
#define EXTI_SWIER_SWIER17_MASK                         (0x01U << EXTI_SWIER_SWIER17_SHIFT)
#define EXTI_SWIER_SWIER17(x)                           (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER17_SHIFT)) & EXTI_SWIER_SWIER17_MASK)

#define EXTI_SWIER_SWIER16_SHIFT                        (16)
#define EXTI_SWIER_SWIER16_MASK                         (0x01U << EXTI_SWIER_SWIER16_SHIFT)
#define EXTI_SWIER_SWIER16(x)                           (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER16_SHIFT)) & EXTI_SWIER_SWIER16_MASK)

#define EXTI_SWIER_SWIER15_SHIFT                        (15)
#define EXTI_SWIER_SWIER15_MASK                         (0x01U << EXTI_SWIER_SWIER15_SHIFT)
#define EXTI_SWIER_SWIER15(x)                           (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER15_SHIFT)) & EXTI_SWIER_SWIER15_MASK)

#define EXTI_SWIER_SWIER14_SHIFT                        (14)
#define EXTI_SWIER_SWIER14_MASK                         (0x01U << EXTI_SWIER_SWIER14_SHIFT)
#define EXTI_SWIER_SWIER14(x)                           (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER14_SHIFT)) & EXTI_SWIER_SWIER14_MASK)

#define EXTI_SWIER_SWIER13_SHIFT                        (13)
#define EXTI_SWIER_SWIER13_MASK                         (0x01U << EXTI_SWIER_SWIER13_SHIFT)
#define EXTI_SWIER_SWIER13(x)                           (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER13_SHIFT)) & EXTI_SWIER_SWIER13_MASK)

#define EXTI_SWIER_SWIER12_SHIFT                        (12)
#define EXTI_SWIER_SWIER12_MASK                         (0x01U << EXTI_SWIER_SWIER12_SHIFT)
#define EXTI_SWIER_SWIER12(x)                           (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER12_SHIFT)) & EXTI_SWIER_SWIER12_MASK)

#define EXTI_SWIER_SWIER11_SHIFT                        (11)
#define EXTI_SWIER_SWIER11_MASK                         (0x01U << EXTI_SWIER_SWIER11_SHIFT)
#define EXTI_SWIER_SWIER11(x)                           (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER11_SHIFT)) & EXTI_SWIER_SWIER11_MASK)

#define EXTI_SWIER_SWIER10_SHIFT                        (10)
#define EXTI_SWIER_SWIER10_MASK                         (0x01U << EXTI_SWIER_SWIER10_SHIFT)
#define EXTI_SWIER_SWIER10(x)                           (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER10_SHIFT)) & EXTI_SWIER_SWIER10_MASK)

#define EXTI_SWIER_SWIER9_SHIFT                         (9)
#define EXTI_SWIER_SWIER9_MASK                          (0x01U << EXTI_SWIER_SWIER9_SHIFT)
#define EXTI_SWIER_SWIER9(x)                            (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER9_SHIFT)) & EXTI_SWIER_SWIER9_MASK)

#define EXTI_SWIER_SWIER8_SHIFT                         (8)
#define EXTI_SWIER_SWIER8_MASK                          (0x01U << EXTI_SWIER_SWIER8_SHIFT)
#define EXTI_SWIER_SWIER8(x)                            (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER8_SHIFT)) & EXTI_SWIER_SWIER8_MASK)

#define EXTI_SWIER_SWIER7_SHIFT                         (7)
#define EXTI_SWIER_SWIER7_MASK                          (0x01U << EXTI_SWIER_SWIER7_SHIFT)
#define EXTI_SWIER_SWIER7(x)                            (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER7_SHIFT)) & EXTI_SWIER_SWIER7_MASK)

#define EXTI_SWIER_SWIER6_SHIFT                         (6)
#define EXTI_SWIER_SWIER6_MASK                          (0x01U << EXTI_SWIER_SWIER6_SHIFT)
#define EXTI_SWIER_SWIER6(x)                            (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER6_SHIFT)) & EXTI_SWIER_SWIER6_MASK)

#define EXTI_SWIER_SWIER5_SHIFT                         (5)
#define EXTI_SWIER_SWIER5_MASK                          (0x01U << EXTI_SWIER_SWIER5_SHIFT)
#define EXTI_SWIER_SWIER5(x)                            (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER5_SHIFT)) & EXTI_SWIER_SWIER5_MASK)

#define EXTI_SWIER_SWIER4_SHIFT                         (4)
#define EXTI_SWIER_SWIER4_MASK                          (0x01U << EXTI_SWIER_SWIER4_SHIFT)
#define EXTI_SWIER_SWIER4(x)                            (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER4_SHIFT)) & EXTI_SWIER_SWIER4_MASK)

#define EXTI_SWIER_SWIER3_SHIFT                         (3)
#define EXTI_SWIER_SWIER3_MASK                          (0x01U << EXTI_SWIER_SWIER3_SHIFT)
#define EXTI_SWIER_SWIER3(x)                            (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER3_SHIFT)) & EXTI_SWIER_SWIER3_MASK)

#define EXTI_SWIER_SWIER2_SHIFT                         (2)
#define EXTI_SWIER_SWIER2_MASK                          (0x01U << EXTI_SWIER_SWIER2_SHIFT)
#define EXTI_SWIER_SWIER2(x)                            (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER2_SHIFT)) & EXTI_SWIER_SWIER2_MASK)

#define EXTI_SWIER_SWIER1_SHIFT                         (1)
#define EXTI_SWIER_SWIER1_MASK                          (0x01U << EXTI_SWIER_SWIER1_SHIFT)
#define EXTI_SWIER_SWIER1(x)                            (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER1_SHIFT)) & EXTI_SWIER_SWIER1_MASK)

