UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define EXTI_SWIER_SWIER0_SHIFT                         (0)
#define EXTI_SWIER_SWIER0_MASK                          (0x01U << EXTI_SWIER_SWIER0_SHIFT)
#define EXTI_SWIER_SWIER0(x)                            (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIER0_SHIFT)) & EXTI_SWIER_SWIER0_MASK)

/*!
 * @brief EXTI_PR Register Bit Definition
 */

#define EXTI_PR_PR17_SHIFT                              (17)
#define EXTI_PR_PR17_MASK                               (0x01U << EXTI_PR_PR17_SHIFT)
#define EXTI_PR_PR17(x)                                 (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR17_SHIFT)) & EXTI_PR_PR17_MASK)

#define EXTI_PR_PR16_SHIFT                              (16)
#define EXTI_PR_PR16_MASK                               (0x01U << EXTI_PR_PR16_SHIFT)
#define EXTI_PR_PR16(x)                                 (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR16_SHIFT)) & EXTI_PR_PR16_MASK)

#define EXTI_PR_PR15_SHIFT                              (15)
#define EXTI_PR_PR15_MASK                               (0x01U << EXTI_PR_PR15_SHIFT)
#define EXTI_PR_PR15(x)                                 (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR15_SHIFT)) & EXTI_PR_PR15_MASK)

#define EXTI_PR_PR14_SHIFT                              (14)
#define EXTI_PR_PR14_MASK                               (0x01U << EXTI_PR_PR14_SHIFT)
#define EXTI_PR_PR14(x)                                 (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR14_SHIFT)) & EXTI_PR_PR14_MASK)

#define EXTI_PR_PR13_SHIFT                              (13)
#define EXTI_PR_PR13_MASK                               (0x01U << EXTI_PR_PR13_SHIFT)
#define EXTI_PR_PR13(x)                                 (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR13_SHIFT)) & EXTI_PR_PR13_MASK)

#define EXTI_PR_PR12_SHIFT                              (12)
#define EXTI_PR_PR12_MASK                               (0x01U << EXTI_PR_PR12_SHIFT)
#define EXTI_PR_PR12(x)                                 (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR12_SHIFT)) & EXTI_PR_PR12_MASK)

#define EXTI_PR_PR11_SHIFT                              (11)
#define EXTI_PR_PR11_MASK                               (0x01U << EXTI_PR_PR11_SHIFT)
#define EXTI_PR_PR11(x)                                 (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR11_SHIFT)) & EXTI_PR_PR11_MASK)

#define EXTI_PR_PR10_SHIFT                              (10)
#define EXTI_PR_PR10_MASK                               (0x01U << EXTI_PR_PR10_SHIFT)
#define EXTI_PR_PR10(x)                                 (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR10_SHIFT)) & EXTI_PR_PR10_MASK)

#define EXTI_PR_PR9_SHIFT                               (9)
#define EXTI_PR_PR9_MASK                                (0x01U << EXTI_PR_PR9_SHIFT)
#define EXTI_PR_PR9(x)                                  (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR9_SHIFT)) & EXTI_PR_PR9_MASK)

#define EXTI_PR_PR8_SHIFT                               (8)
#define EXTI_PR_PR8_MASK                                (0x01U << EXTI_PR_PR8_SHIFT)
#define EXTI_PR_PR8(x)                                  (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR8_SHIFT)) & EXTI_PR_PR8_MASK)

#define EXTI_PR_PR7_SHIFT                               (7)
#define EXTI_PR_PR7_MASK                                (0x01U << EXTI_PR_PR7_SHIFT)
#define EXTI_PR_PR7(x)                                  (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR7_SHIFT)) & EXTI_PR_PR7_MASK)

#define EXTI_PR_PR6_SHIFT                               (6)
#define EXTI_PR_PR6_MASK                                (0x01U << EXTI_PR_PR6_SHIFT)
#define EXTI_PR_PR6(x)                                  (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR6_SHIFT)) & EXTI_PR_PR6_MASK)

#define EXTI_PR_PR5_SHIFT                               (5)
#define EXTI_PR_PR5_MASK                                (0x01U << EXTI_PR_PR5_SHIFT)
#define EXTI_PR_PR5(x)                                  (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR5_SHIFT)) & EXTI_PR_PR5_MASK)

#define EXTI_PR_PR4_SHIFT                               (4)
#define EXTI_PR_PR4_MASK                                (0x01U << EXTI_PR_PR4_SHIFT)
#define EXTI_PR_PR4(x)                                  (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR4_SHIFT)) & EXTI_PR_PR4_MASK)

#define EXTI_PR_PR3_SHIFT                               (3)
#define EXTI_PR_PR3_MASK                                (0x01U << EXTI_PR_PR3_SHIFT)
#define EXTI_PR_PR3(x)                                  (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR3_SHIFT)) & EXTI_PR_PR3_MASK)

#define EXTI_PR_PR2_SHIFT                               (2)
#define EXTI_PR_PR2_MASK                                (0x01U << EXTI_PR_PR2_SHIFT)
#define EXTI_PR_PR2(x)                                  (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR2_SHIFT)) & EXTI_PR_PR2_MASK)

#define EXTI_PR_PR1_SHIFT                               (1)
#define EXTI_PR_PR1_MASK                                (0x01U << EXTI_PR_PR1_SHIFT)
#define EXTI_PR_PR1(x)                                  (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR1_SHIFT)) & EXTI_PR_PR1_MASK)

#define EXTI_PR_PR0_SHIFT                               (0)
#define EXTI_PR_PR0_MASK                                (0x01U << EXTI_PR_PR0_SHIFT)
#define EXTI_PR_PR0(x)                                  (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PR0_SHIFT)) & EXTI_PR_PR0_MASK)

/*!
 * @}
 */ /* end of group EXTI_Register_Masks */
/******************************************************************************
 * EXTI Instance
 ******************************************************************************/

#define EXTI                ((EXTI_Type*)EXTI_BASE)

/*!
 * @}
 */ /* end of group EXTI_Peripheral_Access_Layer */

/*!
 * @addtogroup FLASH_Peripheral_Access_Layer FLASH Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * FLASH Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t ACR;                                                            ///< Flash access control register                offset: 0x00
    __IO uint32_t KEYR;                                                           ///< Flash key                                    offset: 0x04
    __IO uint32_t OPTKEYR;                                                        ///< Option byte key                              offset: 0x08
    __IO uint32_t SR;                                                             ///< Flash status register                        offset: 0x0C
    __IO uint32_t CR;                                                             ///< Flash control register                       offset: 0x10
    __IO uint32_t AR;                                                             ///< Flash address register                       offset: 0x14
    __IO uint32_t Reserved0[1];                                                   ///< Reserved
    __IO uint32_t OBR;                                                            ///< Option byte register                         offset: 0x1c
    __IO uint32_t WRPR;                                                           ///< Write protect register                       offset: 0x20
} FLASH_Type;

/*!
 * @addtogroup FLASH_Register_Masks Register Masks
 * @{ */

/*!
 * @brief FLASH_ACR Register Bit Definition
 */

#define FLASH_ACR_PRFTBS_SHIFT                          (5)
#define FLASH_ACR_PRFTBS_MASK                           (0x01U << FLASH_ACR_PRFTBS_SHIFT)
#define FLASH_ACR_PRFTBS(x)                             (((uint32_t)(((uint32_t)(x)) << FLASH_ACR_PRFTBS_SHIFT)) & FLASH_ACR_PRFTBS_MASK)

