UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define FLASH_ACR_PRFTBE_SHIFT                          (4)
#define FLASH_ACR_PRFTBE_MASK                           (0x01U << FLASH_ACR_PRFTBE_SHIFT)
#define FLASH_ACR_PRFTBE(x)                             (((uint32_t)(((uint32_t)(x)) << FLASH_ACR_PRFTBE_SHIFT)) & FLASH_ACR_PRFTBE_MASK)

#define FLASH_ACR_HLFCYA_SHIFT                          (3)
#define FLASH_ACR_HLFCYA_MASK                           (0x01U << FLASH_ACR_HLFCYA_SHIFT)
#define FLASH_ACR_HLFCYA(x)                             (((uint32_t)(((uint32_t)(x)) << FLASH_ACR_HLFCYA_SHIFT)) & FLASH_ACR_HLFCYA_MASK)

#define FLASH_ACR_LATENCY_SHIFT                         (0)
#define FLASH_ACR_LATENCY_MASK                          (0x07U << FLASH_ACR_LATENCY_SHIFT)
#define FLASH_ACR_LATENCY(x)                            (((uint32_t)(((uint32_t)(x)) << FLASH_ACR_LATENCY_SHIFT)) & FLASH_ACR_LATENCY_MASK)

/*!
 * @brief FLASH_KEYR Register Bit Definition
 */

#define FLASH_KEYR_FKEYR_SHIFT                          (0)
#define FLASH_KEYR_FKEYR_MASK                           (0xFFFFFFFFU << FLASH_KEYR_FKEYR_SHIFT)
#define FLASH_KEYR_FKEYR(x)                             (((uint32_t)(((uint32_t)(x)) << FLASH_KEYR_FKEYR_SHIFT)) & FLASH_KEYR_FKEYR_MASK)

/*!
 * @brief FLASH_OPTKEYR Register Bit Definition
 */

#define FLASH_OPTKEYR_OPTKEYR_SHIFT                     (0)
#define FLASH_OPTKEYR_OPTKEYR_MASK                      (0xFFFFFFFFU << FLASH_OPTKEYR_OPTKEYR_SHIFT)
#define FLASH_OPTKEYR_OPTKEYR(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_OPTKEYR_OPTKEYR_SHIFT)) & FLASH_OPTKEYR_OPTKEYR_MASK)

/*!
 * @brief FLASH_SR Register Bit Definition
 */

#define FLASH_SR_EOP_SHIFT                              (5)
#define FLASH_SR_EOP_MASK                               (0x01U << FLASH_SR_EOP_SHIFT)
#define FLASH_SR_EOP(x)                                 (((uint32_t)(((uint32_t)(x)) << FLASH_SR_EOP_SHIFT)) & FLASH_SR_EOP_MASK)

#define FLASH_SR_WRPRTERR_SHIFT                         (4)
#define FLASH_SR_WRPRTERR_MASK                          (0x01U << FLASH_SR_WRPRTERR_SHIFT)
#define FLASH_SR_WRPRTERR(x)                            (((uint32_t)(((uint32_t)(x)) << FLASH_SR_WRPRTERR_SHIFT)) & FLASH_SR_WRPRTERR_MASK)

#define FLASH_SR_PGERR_SHIFT                            (2)
#define FLASH_SR_PGERR_MASK                             (0x01U << FLASH_SR_PGERR_SHIFT)
#define FLASH_SR_PGERR(x)                               (((uint32_t)(((uint32_t)(x)) << FLASH_SR_PGERR_SHIFT)) & FLASH_SR_PGERR_MASK)

#define FLASH_SR_BSY_SHIFT                              (0)
#define FLASH_SR_BSY_MASK                               (0x01U << FLASH_SR_BSY_SHIFT)
#define FLASH_SR_BSY(x)                                 (((uint32_t)(((uint32_t)(x)) << FLASH_SR_BSY_SHIFT)) & FLASH_SR_BSY_MASK)

/*!
 * @brief FLASH_CR Register Bit Definition
 */

#define FLASH_CR_EOPIE_SHIFT                            (12)
#define FLASH_CR_EOPIE_MASK                             (0x01U << FLASH_CR_EOPIE_SHIFT)
#define FLASH_CR_EOPIE(x)                               (((uint32_t)(((uint32_t)(x)) << FLASH_CR_EOPIE_SHIFT)) & FLASH_CR_EOPIE_MASK)

#define FLASH_CR_ERRIE_SHIFT                            (10)
#define FLASH_CR_ERRIE_MASK                             (0x01U << FLASH_CR_ERRIE_SHIFT)
#define FLASH_CR_ERRIE(x)                               (((uint32_t)(((uint32_t)(x)) << FLASH_CR_ERRIE_SHIFT)) & FLASH_CR_ERRIE_MASK)

#define FLASH_CR_OPTWRE_SHIFT                           (9)
#define FLASH_CR_OPTWRE_MASK                            (0x01U << FLASH_CR_OPTWRE_SHIFT)
#define FLASH_CR_OPTWRE(x)                              (((uint32_t)(((uint32_t)(x)) << FLASH_CR_OPTWRE_SHIFT)) & FLASH_CR_OPTWRE_MASK)

#define FLASH_CR_LOCK_SHIFT                             (7)
#define FLASH_CR_LOCK_MASK                              (0x01U << FLASH_CR_LOCK_SHIFT)
#define FLASH_CR_LOCK(x)                                (((uint32_t)(((uint32_t)(x)) << FLASH_CR_LOCK_SHIFT)) & FLASH_CR_LOCK_MASK)

#define FLASH_CR_STRT_SHIFT                             (6)
#define FLASH_CR_STRT_MASK                              (0x01U << FLASH_CR_STRT_SHIFT)
#define FLASH_CR_STRT(x)                                (((uint32_t)(((uint32_t)(x)) << FLASH_CR_STRT_SHIFT)) & FLASH_CR_STRT_MASK)

#define FLASH_CR_OPTER_SHIFT                            (5)
#define FLASH_CR_OPTER_MASK                             (0x01U << FLASH_CR_OPTER_SHIFT)
#define FLASH_CR_OPTER(x)                               (((uint32_t)(((uint32_t)(x)) << FLASH_CR_OPTER_SHIFT)) & FLASH_CR_OPTER_MASK)

#define FLASH_CR_OPTPG_SHIFT                            (4)
#define FLASH_CR_OPTPG_MASK                             (0x01U << FLASH_CR_OPTPG_SHIFT)
#define FLASH_CR_OPTPG(x)                               (((uint32_t)(((uint32_t)(x)) << FLASH_CR_OPTPG_SHIFT)) & FLASH_CR_OPTPG_MASK)

#define FLASH_CR_MER_SHIFT                              (2)
#define FLASH_CR_MER_MASK                               (0x01U << FLASH_CR_MER_SHIFT)
#define FLASH_CR_MER(x)                                 (((uint32_t)(((uint32_t)(x)) << FLASH_CR_MER_SHIFT)) & FLASH_CR_MER_MASK)

#define FLASH_CR_PER_SHIFT                              (1)
#define FLASH_CR_PER_MASK                               (0x01U << FLASH_CR_PER_SHIFT)
#define FLASH_CR_PER(x)                                 (((uint32_t)(((uint32_t)(x)) << FLASH_CR_PER_SHIFT)) & FLASH_CR_PER_MASK)

#define FLASH_CR_PG_SHIFT                               (0)
#define FLASH_CR_PG_MASK                                (0x01U << FLASH_CR_PG_SHIFT)
#define FLASH_CR_PG(x)                                  (((uint32_t)(((uint32_t)(x)) << FLASH_CR_PG_SHIFT)) & FLASH_CR_PG_MASK)

/*!
 * @brief FLASH_AR Register Bit Definition
 */

#define FLASH_AR_FAR_SHIFT                              (0)
#define FLASH_AR_FAR_MASK                               (0xFFFFFFFFU << FLASH_AR_FAR_SHIFT)
#define FLASH_AR_FAR(x)                                 (((uint32_t)(((uint32_t)(x)) << FLASH_AR_FAR_SHIFT)) & FLASH_AR_FAR_MASK)

/*!
 * @brief FLASH_OBR Register Bit Definition
 */

#define FLASH_OBR_DATA1_SHIFT                           (18)
#define FLASH_OBR_DATA1_MASK                            (0xFFU << FLASH_OBR_DATA1_SHIFT)
#define FLASH_OBR_DATA1(x)                              (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_DATA1_SHIFT)) & FLASH_OBR_DATA1_MASK)

