UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define FLASH_OBR_DATA0_SHIFT                           (10)
#define FLASH_OBR_DATA0_MASK                            (0xFFU << FLASH_OBR_DATA0_SHIFT)
#define FLASH_OBR_DATA0(x)                              (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_DATA0_SHIFT)) & FLASH_OBR_DATA0_MASK)

#define FLASH_OBR_NBOOT1_SHIFT                          (6)
#define FLASH_OBR_NBOOT1_MASK                           (0x01U << FLASH_OBR_NBOOT1_SHIFT)
#define FLASH_OBR_NBOOT1(x)                             (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_NBOOT1_SHIFT)) & FLASH_OBR_NBOOT1_MASK)

#define FLASH_OBR_NRSTSTDBY_SHIFT                       (4)
#define FLASH_OBR_NRSTSTDBY_MASK                        (0x01U << FLASH_OBR_NRSTSTDBY_SHIFT)
#define FLASH_OBR_NRSTSTDBY(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_NRSTSTDBY_SHIFT)) & FLASH_OBR_NRSTSTDBY_MASK)

#define FLASH_OBR_NRSTSTOP_SHIFT                        (3)
#define FLASH_OBR_NRSTSTOP_MASK                         (0x01U << FLASH_OBR_NRSTSTOP_SHIFT)
#define FLASH_OBR_NRSTSTOP(x)                           (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_NRSTSTOP_SHIFT)) & FLASH_OBR_NRSTSTOP_MASK)

#define FLASH_OBR_WDGSW_SHIFT                           (2)
#define FLASH_OBR_WDGSW_MASK                            (0x01U << FLASH_OBR_WDGSW_SHIFT)
#define FLASH_OBR_WDGSW(x)                              (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_WDGSW_SHIFT)) & FLASH_OBR_WDGSW_MASK)

#define FLASH_OBR_RDPRT_SHIFT                           (1)
#define FLASH_OBR_RDPRT_MASK                            (0x01U << FLASH_OBR_RDPRT_SHIFT)
#define FLASH_OBR_RDPRT(x)                              (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_RDPRT_SHIFT)) & FLASH_OBR_RDPRT_MASK)

#define FLASH_OBR_OPTERR_SHIFT                          (0)
#define FLASH_OBR_OPTERR_MASK                           (0x01U << FLASH_OBR_OPTERR_SHIFT)
#define FLASH_OBR_OPTERR(x)                             (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_OPTERR_SHIFT)) & FLASH_OBR_OPTERR_MASK)

/*!
 * @brief FLASH_WRPR Register Bit Definition
 */

#define FLASH_WRPR_WRP_SHIFT                            (0)
#define FLASH_WRPR_WRP_MASK                             (0x0FU << FLASH_WRPR_WRP_SHIFT)
#define FLASH_WRPR_WRP(x)                               (((uint32_t)(((uint32_t)(x)) << FLASH_WRPR_WRP_SHIFT)) & FLASH_WRPR_WRP_MASK)

/*!
 * @}
 */ /* end of group FLASH_Register_Masks */
/******************************************************************************
 * FLASH Instance
 ******************************************************************************/

#define FLASH                ((FLASH_Type*)FLASH_BASE)

/*!
 * @}
 */ /* end of group FLASH_Peripheral_Access_Layer */

/*!
 * @addtogroup GPIO_Peripheral_Access_Layer GPIO Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * GPIO Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CRL;                                                            ///< configuration low register                   offset: 0x00
    __IO uint32_t CRH;                                                            ///< configuration high register                  offset: 0x04
    __IO uint32_t IDR;                                                            ///< input data register                          offset: 0x08
    __IO uint32_t ODR;                                                            ///< output data register                         offset: 0x0C
    __IO uint32_t BSRR;                                                           ///< bit set/reset register                       offset: 0x10
    __IO uint32_t BRR;                                                            ///< bit reset register                           offset: 0x14
    __IO uint32_t LCKR;                                                           ///< Port configuration lock register             offset: 0x18
    __IO uint32_t DCR;                                                            ///< Port output open drain control register      offset: 0x1C
    __IO uint32_t AFRL;                                                           ///< Port Multiplexing Function Low Register      offset: 0x20
    __IO uint32_t AFRH;                                                           ///< Port Multiplexing Function High Register     offset: 0x24
} GPIO_Type;

/*!
 * @addtogroup GPIO_Register_Masks Register Masks
 * @{ */

/*!
 * @brief GPIO_CRL Register Bit Definition
 */

#define GPIO_CRL_CNF7_SHIFT                             (30)
#define GPIO_CRL_CNF7_MASK                              (0x03U << GPIO_CRL_CNF7_SHIFT)
#define GPIO_CRL_CNF7(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_CNF7_SHIFT)) & GPIO_CRL_CNF7_MASK)

#define GPIO_CRL_MODE7_SHIFT                            (28)
#define GPIO_CRL_MODE7_MASK                             (0x03U << GPIO_CRL_MODE7_SHIFT)
#define GPIO_CRL_MODE7(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_MODE7_SHIFT)) & GPIO_CRL_MODE7_MASK)

#define GPIO_CRL_CNF6_SHIFT                             (26)
#define GPIO_CRL_CNF6_MASK                              (0x03U << GPIO_CRL_CNF6_SHIFT)
#define GPIO_CRL_CNF6(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_CNF6_SHIFT)) & GPIO_CRL_CNF6_MASK)

#define GPIO_CRL_MODE6_SHIFT                            (24)
#define GPIO_CRL_MODE6_MASK                             (0x03U << GPIO_CRL_MODE6_SHIFT)
#define GPIO_CRL_MODE6(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_MODE6_SHIFT)) & GPIO_CRL_MODE6_MASK)

#define GPIO_CRL_CNF5_SHIFT                             (22)
#define GPIO_CRL_CNF5_MASK                              (0x03U << GPIO_CRL_CNF5_SHIFT)
#define GPIO_CRL_CNF5(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_CNF5_SHIFT)) & GPIO_CRL_CNF5_MASK)

#define GPIO_CRL_MODE5_SHIFT                            (20)
#define GPIO_CRL_MODE5_MASK                             (0x03U << GPIO_CRL_MODE5_SHIFT)
#define GPIO_CRL_MODE5(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_MODE5_SHIFT)) & GPIO_CRL_MODE5_MASK)

