UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define GPIO_CRL_CNF4_SHIFT                             (18)
#define GPIO_CRL_CNF4_MASK                              (0x03U << GPIO_CRL_CNF4_SHIFT)
#define GPIO_CRL_CNF4(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_CNF4_SHIFT)) & GPIO_CRL_CNF4_MASK)

#define GPIO_CRL_MODE4_SHIFT                            (16)
#define GPIO_CRL_MODE4_MASK                             (0x03U << GPIO_CRL_MODE4_SHIFT)
#define GPIO_CRL_MODE4(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_MODE4_SHIFT)) & GPIO_CRL_MODE4_MASK)

#define GPIO_CRL_CNF3_SHIFT                             (14)
#define GPIO_CRL_CNF3_MASK                              (0x03U << GPIO_CRL_CNF3_SHIFT)
#define GPIO_CRL_CNF3(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_CNF3_SHIFT)) & GPIO_CRL_CNF3_MASK)

#define GPIO_CRL_MODE3_SHIFT                            (12)
#define GPIO_CRL_MODE3_MASK                             (0x03U << GPIO_CRL_MODE3_SHIFT)
#define GPIO_CRL_MODE3(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_MODE3_SHIFT)) & GPIO_CRL_MODE3_MASK)

#define GPIO_CRL_CNF2_SHIFT                             (10)
#define GPIO_CRL_CNF2_MASK                              (0x03U << GPIO_CRL_CNF2_SHIFT)
#define GPIO_CRL_CNF2(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_CNF2_SHIFT)) & GPIO_CRL_CNF2_MASK)

#define GPIO_CRL_MODE2_SHIFT                            (8)
#define GPIO_CRL_MODE2_MASK                             (0x03U << GPIO_CRL_MODE2_SHIFT)
#define GPIO_CRL_MODE2(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_MODE2_SHIFT)) & GPIO_CRL_MODE2_MASK)

#define GPIO_CRL_CNF1_SHIFT                             (6)
#define GPIO_CRL_CNF1_MASK                              (0x03U << GPIO_CRL_CNF1_SHIFT)
#define GPIO_CRL_CNF1(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_CNF1_SHIFT)) & GPIO_CRL_CNF1_MASK)

#define GPIO_CRL_MODE1_SHIFT                            (4)
#define GPIO_CRL_MODE1_MASK                             (0x03U << GPIO_CRL_MODE1_SHIFT)
#define GPIO_CRL_MODE1(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_MODE1_SHIFT)) & GPIO_CRL_MODE1_MASK)

#define GPIO_CRL_CNF0_SHIFT                             (2)
#define GPIO_CRL_CNF0_MASK                              (0x03U << GPIO_CRL_CNF0_SHIFT)
#define GPIO_CRL_CNF0(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_CNF0_SHIFT)) & GPIO_CRL_CNF0_MASK)

#define GPIO_CRL_MODE0_SHIFT                            (0)
#define GPIO_CRL_MODE0_MASK                             (0x03U << GPIO_CRL_MODE0_SHIFT)
#define GPIO_CRL_MODE0(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRL_MODE0_SHIFT)) & GPIO_CRL_MODE0_MASK)

/*!
 * @brief GPIO_CRH Register Bit Definition
 */

#define GPIO_CRH_CNF15_SHIFT                            (30)
#define GPIO_CRH_CNF15_MASK                             (0x03U << GPIO_CRH_CNF15_SHIFT)
#define GPIO_CRH_CNF15(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_CNF15_SHIFT)) & GPIO_CRH_CNF15_MASK)

#define GPIO_CRH_MODE15_SHIFT                           (28)
#define GPIO_CRH_MODE15_MASK                            (0x03U << GPIO_CRH_MODE15_SHIFT)
#define GPIO_CRH_MODE15(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_MODE15_SHIFT)) & GPIO_CRH_MODE15_MASK)

#define GPIO_CRH_CNF14_SHIFT                            (26)
#define GPIO_CRH_CNF14_MASK                             (0x03U << GPIO_CRH_CNF14_SHIFT)
#define GPIO_CRH_CNF14(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_CNF14_SHIFT)) & GPIO_CRH_CNF14_MASK)

#define GPIO_CRH_MODE14_SHIFT                           (24)
#define GPIO_CRH_MODE14_MASK                            (0x03U << GPIO_CRH_MODE14_SHIFT)
#define GPIO_CRH_MODE14(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_MODE14_SHIFT)) & GPIO_CRH_MODE14_MASK)

#define GPIO_CRH_CNF13_SHIFT                            (22)
#define GPIO_CRH_CNF13_MASK                             (0x03U << GPIO_CRH_CNF13_SHIFT)
#define GPIO_CRH_CNF13(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_CNF13_SHIFT)) & GPIO_CRH_CNF13_MASK)

#define GPIO_CRH_MODE13_SHIFT                           (20)
#define GPIO_CRH_MODE13_MASK                            (0x03U << GPIO_CRH_MODE13_SHIFT)
#define GPIO_CRH_MODE13(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_MODE13_SHIFT)) & GPIO_CRH_MODE13_MASK)

#define GPIO_CRH_CNF12_SHIFT                            (18)
#define GPIO_CRH_CNF12_MASK                             (0x03U << GPIO_CRH_CNF12_SHIFT)
#define GPIO_CRH_CNF12(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_CNF12_SHIFT)) & GPIO_CRH_CNF12_MASK)

#define GPIO_CRH_MODE12_SHIFT                           (16)
#define GPIO_CRH_MODE12_MASK                            (0x03U << GPIO_CRH_MODE12_SHIFT)
#define GPIO_CRH_MODE12(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_MODE12_SHIFT)) & GPIO_CRH_MODE12_MASK)

#define GPIO_CRH_CNF11_SHIFT                            (14)
#define GPIO_CRH_CNF11_MASK                             (0x03U << GPIO_CRH_CNF11_SHIFT)
#define GPIO_CRH_CNF11(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_CNF11_SHIFT)) & GPIO_CRH_CNF11_MASK)

#define GPIO_CRH_MODE11_SHIFT                           (12)
#define GPIO_CRH_MODE11_MASK                            (0x03U << GPIO_CRH_MODE11_SHIFT)
#define GPIO_CRH_MODE11(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_MODE11_SHIFT)) & GPIO_CRH_MODE11_MASK)

#define GPIO_CRH_CNF10_SHIFT                            (10)
#define GPIO_CRH_CNF10_MASK                             (0x03U << GPIO_CRH_CNF10_SHIFT)
#define GPIO_CRH_CNF10(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_CNF10_SHIFT)) & GPIO_CRH_CNF10_MASK)

