UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define GPIO_CRH_MODE10_SHIFT                           (8)
#define GPIO_CRH_MODE10_MASK                            (0x03U << GPIO_CRH_MODE10_SHIFT)
#define GPIO_CRH_MODE10(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_MODE10_SHIFT)) & GPIO_CRH_MODE10_MASK)

#define GPIO_CRH_CNF9_SHIFT                             (6)
#define GPIO_CRH_CNF9_MASK                              (0x03U << GPIO_CRH_CNF9_SHIFT)
#define GPIO_CRH_CNF9(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_CNF9_SHIFT)) & GPIO_CRH_CNF9_MASK)

#define GPIO_CRH_MODE9_SHIFT                            (4)
#define GPIO_CRH_MODE9_MASK                             (0x03U << GPIO_CRH_MODE9_SHIFT)
#define GPIO_CRH_MODE9(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_MODE9_SHIFT)) & GPIO_CRH_MODE9_MASK)

#define GPIO_CRH_CNF8_SHIFT                             (2)
#define GPIO_CRH_CNF8_MASK                              (0x03U << GPIO_CRH_CNF8_SHIFT)
#define GPIO_CRH_CNF8(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_CNF8_SHIFT)) & GPIO_CRH_CNF8_MASK)

#define GPIO_CRH_MODE8_SHIFT                            (0)
#define GPIO_CRH_MODE8_MASK                             (0x03U << GPIO_CRH_MODE8_SHIFT)
#define GPIO_CRH_MODE8(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_CRH_MODE8_SHIFT)) & GPIO_CRH_MODE8_MASK)

/*!
 * @brief GPIO_IDR Register Bit Definition
 */

#define GPIO_IDR_IDR_SHIFT                              (0)
#define GPIO_IDR_IDR_MASK                               (0xFFFFU << GPIO_IDR_IDR_SHIFT)
#define GPIO_IDR_IDR(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_IDR_IDR_SHIFT)) & GPIO_IDR_IDR_MASK)

/*!
 * @brief GPIO_ODR Register Bit Definition
 */

#define GPIO_ODR_ODR_SHIFT                              (0)
#define GPIO_ODR_ODR_MASK                               (0xFFFFU << GPIO_ODR_ODR_SHIFT)
#define GPIO_ODR_ODR(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_ODR_ODR_SHIFT)) & GPIO_ODR_ODR_MASK)

/*!
 * @brief GPIO_BSRR Register Bit Definition
 */

#define GPIO_BSRR_BR15_SHIFT                            (31)
#define GPIO_BSRR_BR15_MASK                             (0x01U << GPIO_BSRR_BR15_SHIFT)
#define GPIO_BSRR_BR15(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR15_SHIFT)) & GPIO_BSRR_BR15_MASK)

#define GPIO_BSRR_BR14_SHIFT                            (30)
#define GPIO_BSRR_BR14_MASK                             (0x01U << GPIO_BSRR_BR14_SHIFT)
#define GPIO_BSRR_BR14(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR14_SHIFT)) & GPIO_BSRR_BR14_MASK)

#define GPIO_BSRR_BR13_SHIFT                            (29)
#define GPIO_BSRR_BR13_MASK                             (0x01U << GPIO_BSRR_BR13_SHIFT)
#define GPIO_BSRR_BR13(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR13_SHIFT)) & GPIO_BSRR_BR13_MASK)

#define GPIO_BSRR_BR12_SHIFT                            (28)
#define GPIO_BSRR_BR12_MASK                             (0x01U << GPIO_BSRR_BR12_SHIFT)
#define GPIO_BSRR_BR12(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR12_SHIFT)) & GPIO_BSRR_BR12_MASK)

#define GPIO_BSRR_BR11_SHIFT                            (27)
#define GPIO_BSRR_BR11_MASK                             (0x01U << GPIO_BSRR_BR11_SHIFT)
#define GPIO_BSRR_BR11(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR11_SHIFT)) & GPIO_BSRR_BR11_MASK)

#define GPIO_BSRR_BR10_SHIFT                            (26)
#define GPIO_BSRR_BR10_MASK                             (0x01U << GPIO_BSRR_BR10_SHIFT)
#define GPIO_BSRR_BR10(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR10_SHIFT)) & GPIO_BSRR_BR10_MASK)

#define GPIO_BSRR_BR9_SHIFT                             (25)
#define GPIO_BSRR_BR9_MASK                              (0x01U << GPIO_BSRR_BR9_SHIFT)
#define GPIO_BSRR_BR9(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR9_SHIFT)) & GPIO_BSRR_BR9_MASK)

#define GPIO_BSRR_BR8_SHIFT                             (24)
#define GPIO_BSRR_BR8_MASK                              (0x01U << GPIO_BSRR_BR8_SHIFT)
#define GPIO_BSRR_BR8(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR8_SHIFT)) & GPIO_BSRR_BR8_MASK)

#define GPIO_BSRR_BR7_SHIFT                             (23)
#define GPIO_BSRR_BR7_MASK                              (0x01U << GPIO_BSRR_BR7_SHIFT)
#define GPIO_BSRR_BR7(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR7_SHIFT)) & GPIO_BSRR_BR7_MASK)

#define GPIO_BSRR_BR6_SHIFT                             (22)
#define GPIO_BSRR_BR6_MASK                              (0x01U << GPIO_BSRR_BR6_SHIFT)
#define GPIO_BSRR_BR6(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR6_SHIFT)) & GPIO_BSRR_BR6_MASK)

#define GPIO_BSRR_BR5_SHIFT                             (21)
#define GPIO_BSRR_BR5_MASK                              (0x01U << GPIO_BSRR_BR5_SHIFT)
#define GPIO_BSRR_BR5(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR5_SHIFT)) & GPIO_BSRR_BR5_MASK)

#define GPIO_BSRR_BR4_SHIFT                             (20)
#define GPIO_BSRR_BR4_MASK                              (0x01U << GPIO_BSRR_BR4_SHIFT)
#define GPIO_BSRR_BR4(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR4_SHIFT)) & GPIO_BSRR_BR4_MASK)

#define GPIO_BSRR_BR3_SHIFT                             (19)
#define GPIO_BSRR_BR3_MASK                              (0x01U << GPIO_BSRR_BR3_SHIFT)
#define GPIO_BSRR_BR3(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR3_SHIFT)) & GPIO_BSRR_BR3_MASK)

#define GPIO_BSRR_BR2_SHIFT                             (18)
#define GPIO_BSRR_BR2_MASK                              (0x01U << GPIO_BSRR_BR2_SHIFT)
#define GPIO_BSRR_BR2(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR2_SHIFT)) & GPIO_BSRR_BR2_MASK)

#define GPIO_BSRR_BR1_SHIFT                             (17)
#define GPIO_BSRR_BR1_MASK                              (0x01U << GPIO_BSRR_BR1_SHIFT)
#define GPIO_BSRR_BR1(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR1_SHIFT)) & GPIO_BSRR_BR1_MASK)

#define GPIO_BSRR_BR0_SHIFT                             (16)
#define GPIO_BSRR_BR0_MASK                              (0x01U << GPIO_BSRR_BR0_SHIFT)
#define GPIO_BSRR_BR0(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BR0_SHIFT)) & GPIO_BSRR_BR0_MASK)

#define GPIO_BSRR_BS15_SHIFT                            (15)
#define GPIO_BSRR_BS15_MASK                             (0x01U << GPIO_BSRR_BS15_SHIFT)
#define GPIO_BSRR_BS15(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS15_SHIFT)) & GPIO_BSRR_BS15_MASK)

#define GPIO_BSRR_BS14_SHIFT                            (14)
#define GPIO_BSRR_BS14_MASK                             (0x01U << GPIO_BSRR_BS14_SHIFT)
#define GPIO_BSRR_BS14(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS14_SHIFT)) & GPIO_BSRR_BS14_MASK)

#define GPIO_BSRR_BS13_SHIFT                            (13)
#define GPIO_BSRR_BS13_MASK                             (0x01U << GPIO_BSRR_BS13_SHIFT)
#define GPIO_BSRR_BS13(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS13_SHIFT)) & GPIO_BSRR_BS13_MASK)

#define GPIO_BSRR_BS12_SHIFT                            (12)
#define GPIO_BSRR_BS12_MASK                             (0x01U << GPIO_BSRR_BS12_SHIFT)
#define GPIO_BSRR_BS12(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS12_SHIFT)) & GPIO_BSRR_BS12_MASK)

#define GPIO_BSRR_BS11_SHIFT                            (11)
#define GPIO_BSRR_BS11_MASK                             (0x01U << GPIO_BSRR_BS11_SHIFT)
#define GPIO_BSRR_BS11(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS11_SHIFT)) & GPIO_BSRR_BS11_MASK)

#define GPIO_BSRR_BS10_SHIFT                            (10)
#define GPIO_BSRR_BS10_MASK                             (0x01U << GPIO_BSRR_BS10_SHIFT)
#define GPIO_BSRR_BS10(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS10_SHIFT)) & GPIO_BSRR_BS10_MASK)

#define GPIO_BSRR_BS9_SHIFT                             (9)
#define GPIO_BSRR_BS9_MASK                              (0x01U << GPIO_BSRR_BS9_SHIFT)
#define GPIO_BSRR_BS9(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS9_SHIFT)) & GPIO_BSRR_BS9_MASK)

#define GPIO_BSRR_BS8_SHIFT                             (8)
#define GPIO_BSRR_BS8_MASK                              (0x01U << GPIO_BSRR_BS8_SHIFT)
#define GPIO_BSRR_BS8(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS8_SHIFT)) & GPIO_BSRR_BS8_MASK)

