UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define GPIO_BSRR_BS7_SHIFT                             (7)
#define GPIO_BSRR_BS7_MASK                              (0x01U << GPIO_BSRR_BS7_SHIFT)
#define GPIO_BSRR_BS7(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS7_SHIFT)) & GPIO_BSRR_BS7_MASK)

#define GPIO_BSRR_BS6_SHIFT                             (6)
#define GPIO_BSRR_BS6_MASK                              (0x01U << GPIO_BSRR_BS6_SHIFT)
#define GPIO_BSRR_BS6(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS6_SHIFT)) & GPIO_BSRR_BS6_MASK)

#define GPIO_BSRR_BS5_SHIFT                             (5)
#define GPIO_BSRR_BS5_MASK                              (0x01U << GPIO_BSRR_BS5_SHIFT)
#define GPIO_BSRR_BS5(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS5_SHIFT)) & GPIO_BSRR_BS5_MASK)

#define GPIO_BSRR_BS4_SHIFT                             (4)
#define GPIO_BSRR_BS4_MASK                              (0x01U << GPIO_BSRR_BS4_SHIFT)
#define GPIO_BSRR_BS4(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS4_SHIFT)) & GPIO_BSRR_BS4_MASK)

#define GPIO_BSRR_BS3_SHIFT                             (3)
#define GPIO_BSRR_BS3_MASK                              (0x01U << GPIO_BSRR_BS3_SHIFT)
#define GPIO_BSRR_BS3(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS3_SHIFT)) & GPIO_BSRR_BS3_MASK)

#define GPIO_BSRR_BS2_SHIFT                             (2)
#define GPIO_BSRR_BS2_MASK                              (0x01U << GPIO_BSRR_BS2_SHIFT)
#define GPIO_BSRR_BS2(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS2_SHIFT)) & GPIO_BSRR_BS2_MASK)

#define GPIO_BSRR_BS1_SHIFT                             (1)
#define GPIO_BSRR_BS1_MASK                              (0x01U << GPIO_BSRR_BS1_SHIFT)
#define GPIO_BSRR_BS1(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS1_SHIFT)) & GPIO_BSRR_BS1_MASK)

#define GPIO_BSRR_BS0_SHIFT                             (0)
#define GPIO_BSRR_BS0_MASK                              (0x01U << GPIO_BSRR_BS0_SHIFT)
#define GPIO_BSRR_BS0(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BSRR_BS0_SHIFT)) & GPIO_BSRR_BS0_MASK)

/*!
 * @brief GPIO_BRR Register Bit Definition
 */

#define GPIO_BRR_BR15_SHIFT                             (15)
#define GPIO_BRR_BR15_MASK                              (0x01U << GPIO_BRR_BR15_SHIFT)
#define GPIO_BRR_BR15(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR15_SHIFT)) & GPIO_BRR_BR15_MASK)

#define GPIO_BRR_BR14_SHIFT                             (14)
#define GPIO_BRR_BR14_MASK                              (0x01U << GPIO_BRR_BR14_SHIFT)
#define GPIO_BRR_BR14(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR14_SHIFT)) & GPIO_BRR_BR14_MASK)

#define GPIO_BRR_BR13_SHIFT                             (13)
#define GPIO_BRR_BR13_MASK                              (0x01U << GPIO_BRR_BR13_SHIFT)
#define GPIO_BRR_BR13(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR13_SHIFT)) & GPIO_BRR_BR13_MASK)

#define GPIO_BRR_BR12_SHIFT                             (12)
#define GPIO_BRR_BR12_MASK                              (0x01U << GPIO_BRR_BR12_SHIFT)
#define GPIO_BRR_BR12(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR12_SHIFT)) & GPIO_BRR_BR12_MASK)

#define GPIO_BRR_BR11_SHIFT                             (11)
#define GPIO_BRR_BR11_MASK                              (0x01U << GPIO_BRR_BR11_SHIFT)
#define GPIO_BRR_BR11(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR11_SHIFT)) & GPIO_BRR_BR11_MASK)

#define GPIO_BRR_BR10_SHIFT                             (10)
#define GPIO_BRR_BR10_MASK                              (0x01U << GPIO_BRR_BR10_SHIFT)
#define GPIO_BRR_BR10(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR10_SHIFT)) & GPIO_BRR_BR10_MASK)

#define GPIO_BRR_BR9_SHIFT                              (9)
#define GPIO_BRR_BR9_MASK                               (0x01U << GPIO_BRR_BR9_SHIFT)
#define GPIO_BRR_BR9(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR9_SHIFT)) & GPIO_BRR_BR9_MASK)

#define GPIO_BRR_BR8_SHIFT                              (8)
#define GPIO_BRR_BR8_MASK                               (0x01U << GPIO_BRR_BR8_SHIFT)
#define GPIO_BRR_BR8(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR8_SHIFT)) & GPIO_BRR_BR8_MASK)

#define GPIO_BRR_BR7_SHIFT                              (7)
#define GPIO_BRR_BR7_MASK                               (0x01U << GPIO_BRR_BR7_SHIFT)
#define GPIO_BRR_BR7(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR7_SHIFT)) & GPIO_BRR_BR7_MASK)

#define GPIO_BRR_BR6_SHIFT                              (6)
#define GPIO_BRR_BR6_MASK                               (0x01U << GPIO_BRR_BR6_SHIFT)
#define GPIO_BRR_BR6(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR6_SHIFT)) & GPIO_BRR_BR6_MASK)

#define GPIO_BRR_BR5_SHIFT                              (5)
#define GPIO_BRR_BR5_MASK                               (0x01U << GPIO_BRR_BR5_SHIFT)
#define GPIO_BRR_BR5(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR5_SHIFT)) & GPIO_BRR_BR5_MASK)

#define GPIO_BRR_BR4_SHIFT                              (4)
#define GPIO_BRR_BR4_MASK                               (0x01U << GPIO_BRR_BR4_SHIFT)
#define GPIO_BRR_BR4(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR4_SHIFT)) & GPIO_BRR_BR4_MASK)

#define GPIO_BRR_BR3_SHIFT                              (3)
#define GPIO_BRR_BR3_MASK                               (0x01U << GPIO_BRR_BR3_SHIFT)
#define GPIO_BRR_BR3(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR3_SHIFT)) & GPIO_BRR_BR3_MASK)

#define GPIO_BRR_BR2_SHIFT                              (2)
#define GPIO_BRR_BR2_MASK                               (0x01U << GPIO_BRR_BR2_SHIFT)
#define GPIO_BRR_BR2(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR2_SHIFT)) & GPIO_BRR_BR2_MASK)

#define GPIO_BRR_BR1_SHIFT                              (1)
#define GPIO_BRR_BR1_MASK                               (0x01U << GPIO_BRR_BR1_SHIFT)
#define GPIO_BRR_BR1(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR1_SHIFT)) & GPIO_BRR_BR1_MASK)

#define GPIO_BRR_BR0_SHIFT                              (0)
#define GPIO_BRR_BR0_MASK                               (0x01U << GPIO_BRR_BR0_SHIFT)
#define GPIO_BRR_BR0(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_BRR_BR0_SHIFT)) & GPIO_BRR_BR0_MASK)

/*!
 * @brief GPIO_LCKR Register Bit Definition
 */

#define GPIO_LCKR_LCKK_SHIFT                            (16)
#define GPIO_LCKR_LCKK_MASK                             (0x01U << GPIO_LCKR_LCKK_SHIFT)
#define GPIO_LCKR_LCKK(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_LCKR_LCKK_SHIFT)) & GPIO_LCKR_LCKK_MASK)

#define GPIO_LCKR_LCK_SHIFT                             (0)
#define GPIO_LCKR_LCK_MASK                              (0xFFFFU << GPIO_LCKR_LCK_SHIFT)
#define GPIO_LCKR_LCK(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_LCKR_LCK_SHIFT)) & GPIO_LCKR_LCK_MASK)

/*!
 * @brief GPIO_DCR Register Bit Definition
 */

#define GPIO_DCR_PX15_SHIFT                             (30)
#define GPIO_DCR_PX15_MASK                              (0x03U << GPIO_DCR_PX15_SHIFT)
#define GPIO_DCR_PX15(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX15_SHIFT)) & GPIO_DCR_PX15_MASK)

#define GPIO_DCR_PX14_SHIFT                             (28)
#define GPIO_DCR_PX14_MASK                              (0x03U << GPIO_DCR_PX14_SHIFT)
#define GPIO_DCR_PX14(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX14_SHIFT)) & GPIO_DCR_PX14_MASK)

