UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define GPIO_DCR_PX13_SHIFT                             (26)
#define GPIO_DCR_PX13_MASK                              (0x03U << GPIO_DCR_PX13_SHIFT)
#define GPIO_DCR_PX13(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX13_SHIFT)) & GPIO_DCR_PX13_MASK)

#define GPIO_DCR_PX12_SHIFT                             (24)
#define GPIO_DCR_PX12_MASK                              (0x03U << GPIO_DCR_PX12_SHIFT)
#define GPIO_DCR_PX12(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX12_SHIFT)) & GPIO_DCR_PX12_MASK)

#define GPIO_DCR_PX11_SHIFT                             (22)
#define GPIO_DCR_PX11_MASK                              (0x03U << GPIO_DCR_PX11_SHIFT)
#define GPIO_DCR_PX11(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX11_SHIFT)) & GPIO_DCR_PX11_MASK)

#define GPIO_DCR_PX10_SHIFT                             (20)
#define GPIO_DCR_PX10_MASK                              (0x03U << GPIO_DCR_PX10_SHIFT)
#define GPIO_DCR_PX10(x)                                (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX10_SHIFT)) & GPIO_DCR_PX10_MASK)

#define GPIO_DCR_PX9_SHIFT                              (18)
#define GPIO_DCR_PX9_MASK                               (0x03U << GPIO_DCR_PX9_SHIFT)
#define GPIO_DCR_PX9(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX9_SHIFT)) & GPIO_DCR_PX9_MASK)

#define GPIO_DCR_PX8_SHIFT                              (16)
#define GPIO_DCR_PX8_MASK                               (0x03U << GPIO_DCR_PX8_SHIFT)
#define GPIO_DCR_PX8(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX8_SHIFT)) & GPIO_DCR_PX8_MASK)

#define GPIO_DCR_PX7_SHIFT                              (14)
#define GPIO_DCR_PX7_MASK                               (0x03U << GPIO_DCR_PX7_SHIFT)
#define GPIO_DCR_PX7(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX7_SHIFT)) & GPIO_DCR_PX7_MASK)

#define GPIO_DCR_PX6_SHIFT                              (12)
#define GPIO_DCR_PX6_MASK                               (0x03U << GPIO_DCR_PX6_SHIFT)
#define GPIO_DCR_PX6(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX6_SHIFT)) & GPIO_DCR_PX6_MASK)

#define GPIO_DCR_PX5_SHIFT                              (10)
#define GPIO_DCR_PX5_MASK                               (0x03U << GPIO_DCR_PX5_SHIFT)
#define GPIO_DCR_PX5(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX5_SHIFT)) & GPIO_DCR_PX5_MASK)

#define GPIO_DCR_PX4_SHIFT                              (8)
#define GPIO_DCR_PX4_MASK                               (0x03U << GPIO_DCR_PX4_SHIFT)
#define GPIO_DCR_PX4(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX4_SHIFT)) & GPIO_DCR_PX4_MASK)

#define GPIO_DCR_PX3_SHIFT                              (6)
#define GPIO_DCR_PX3_MASK                               (0x03U << GPIO_DCR_PX3_SHIFT)
#define GPIO_DCR_PX3(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX3_SHIFT)) & GPIO_DCR_PX3_MASK)

#define GPIO_DCR_PX2_SHIFT                              (4)
#define GPIO_DCR_PX2_MASK                               (0x03U << GPIO_DCR_PX2_SHIFT)
#define GPIO_DCR_PX2(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX2_SHIFT)) & GPIO_DCR_PX2_MASK)

#define GPIO_DCR_PX1_SHIFT                              (2)
#define GPIO_DCR_PX1_MASK                               (0x03U << GPIO_DCR_PX1_SHIFT)
#define GPIO_DCR_PX1(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX1_SHIFT)) & GPIO_DCR_PX1_MASK)

#define GPIO_DCR_PX0_SHIFT                              (0)
#define GPIO_DCR_PX0_MASK                               (0x03U << GPIO_DCR_PX0_SHIFT)
#define GPIO_DCR_PX0(x)                                 (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX0_SHIFT)) & GPIO_DCR_PX0_MASK)

/*!
 * @brief GPIO_AFRL Register Bit Definition
 */

#define GPIO_AFRL_AFR7_SHIFT                            (28)
#define GPIO_AFRL_AFR7_MASK                             (0x0FU << GPIO_AFRL_AFR7_SHIFT)
#define GPIO_AFRL_AFR7(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR7_SHIFT)) & GPIO_AFRL_AFR7_MASK)

#define GPIO_AFRL_AFR6_SHIFT                            (24)
#define GPIO_AFRL_AFR6_MASK                             (0x0FU << GPIO_AFRL_AFR6_SHIFT)
#define GPIO_AFRL_AFR6(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR6_SHIFT)) & GPIO_AFRL_AFR6_MASK)

#define GPIO_AFRL_AFR5_SHIFT                            (20)
#define GPIO_AFRL_AFR5_MASK                             (0x0FU << GPIO_AFRL_AFR5_SHIFT)
#define GPIO_AFRL_AFR5(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR5_SHIFT)) & GPIO_AFRL_AFR5_MASK)

#define GPIO_AFRL_AFR4_SHIFT                            (16)
#define GPIO_AFRL_AFR4_MASK                             (0x0FU << GPIO_AFRL_AFR4_SHIFT)
#define GPIO_AFRL_AFR4(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR4_SHIFT)) & GPIO_AFRL_AFR4_MASK)

#define GPIO_AFRL_AFR3_SHIFT                            (12)
#define GPIO_AFRL_AFR3_MASK                             (0x0FU << GPIO_AFRL_AFR3_SHIFT)
#define GPIO_AFRL_AFR3(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR3_SHIFT)) & GPIO_AFRL_AFR3_MASK)

#define GPIO_AFRL_AFR2_SHIFT                            (8)
#define GPIO_AFRL_AFR2_MASK                             (0x0FU << GPIO_AFRL_AFR2_SHIFT)
#define GPIO_AFRL_AFR2(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR2_SHIFT)) & GPIO_AFRL_AFR2_MASK)

#define GPIO_AFRL_AFR1_SHIFT                            (4)
#define GPIO_AFRL_AFR1_MASK                             (0x0FU << GPIO_AFRL_AFR1_SHIFT)
#define GPIO_AFRL_AFR1(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR1_SHIFT)) & GPIO_AFRL_AFR1_MASK)

#define GPIO_AFRL_AFR0_SHIFT                            (0)
#define GPIO_AFRL_AFR0_MASK                             (0x0FU << GPIO_AFRL_AFR0_SHIFT)
#define GPIO_AFRL_AFR0(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFR0_SHIFT)) & GPIO_AFRL_AFR0_MASK)

/*!
 * @brief GPIO_AFRH Register Bit Definition
 */

#define GPIO_AFRH_AFR15_SHIFT                           (28)
#define GPIO_AFRH_AFR15_MASK                            (0x0FU << GPIO_AFRH_AFR15_SHIFT)
#define GPIO_AFRH_AFR15(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR15_SHIFT)) & GPIO_AFRH_AFR15_MASK)

#define GPIO_AFRH_AFR14_SHIFT                           (24)
#define GPIO_AFRH_AFR14_MASK                            (0x0FU << GPIO_AFRH_AFR14_SHIFT)
#define GPIO_AFRH_AFR14(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR14_SHIFT)) & GPIO_AFRH_AFR14_MASK)

#define GPIO_AFRH_AFR13_SHIFT                           (20)
#define GPIO_AFRH_AFR13_MASK                            (0x0FU << GPIO_AFRH_AFR13_SHIFT)
#define GPIO_AFRH_AFR13(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR13_SHIFT)) & GPIO_AFRH_AFR13_MASK)

