UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define GPIO_AFRH_AFR12_SHIFT                           (16)
#define GPIO_AFRH_AFR12_MASK                            (0x0FU << GPIO_AFRH_AFR12_SHIFT)
#define GPIO_AFRH_AFR12(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR12_SHIFT)) & GPIO_AFRH_AFR12_MASK)

#define GPIO_AFRH_AFR11_SHIFT                           (12)
#define GPIO_AFRH_AFR11_MASK                            (0x0FU << GPIO_AFRH_AFR11_SHIFT)
#define GPIO_AFRH_AFR11(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR11_SHIFT)) & GPIO_AFRH_AFR11_MASK)

#define GPIO_AFRH_AFR10_SHIFT                           (8)
#define GPIO_AFRH_AFR10_MASK                            (0x0FU << GPIO_AFRH_AFR10_SHIFT)
#define GPIO_AFRH_AFR10(x)                              (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR10_SHIFT)) & GPIO_AFRH_AFR10_MASK)

#define GPIO_AFRH_AFR9_SHIFT                            (4)
#define GPIO_AFRH_AFR9_MASK                             (0x0FU << GPIO_AFRH_AFR9_SHIFT)
#define GPIO_AFRH_AFR9(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR9_SHIFT)) & GPIO_AFRH_AFR9_MASK)

#define GPIO_AFRH_AFR8_SHIFT                            (0)
#define GPIO_AFRH_AFR8_MASK                             (0x0FU << GPIO_AFRH_AFR8_SHIFT)
#define GPIO_AFRH_AFR8(x)                               (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFR8_SHIFT)) & GPIO_AFRH_AFR8_MASK)

/*!
 * @}
 */ /* end of group GPIO_Register_Masks */
/******************************************************************************
 * GPIO Instance
 ******************************************************************************/

#define GPIOA                ((GPIO_Type*)GPIOA_BASE)
#define GPIOB                ((GPIO_Type*)GPIOB_BASE)

/*!
 * @}
 */ /* end of group GPIO_Peripheral_Access_Layer */

/*!
 * @addtogroup I2C_Peripheral_Access_Layer I2C Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * I2C Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                             ///< Control Register                             offset: 0x00
    __IO uint32_t TAR;                                                            ///< Target Register                              offset: 0x04
    __IO uint32_t SAR;                                                            ///< Slave Address Register                       offset: 0x08
    __IO uint32_t Reserved0[1];                                                   ///< Reserved
    __IO uint32_t DR;                                                             ///< Data Command Register                        offset: 0x10
    __IO uint32_t SSHR;                                                           ///< SCL High Period Count for Std. Speed Registeroffset: 0x14
    __IO uint32_t SSLR;                                                           ///< SCL Low Period Count for Std. Speed Register offset: 0x18
    __IO uint32_t FSHR;                                                           ///< SCL High Period Count for Fast Speed Registeroffset: 0x1C
    __IO uint32_t FSLR;                                                           ///< SCL Low Period Count for Fast Speed Register offset: 0x20
    __IO uint32_t Reserved1[2];                                                   ///< Reserved
    __IO uint32_t ISR;                                                            ///< Interrupt Status Register                    offset: 0x2C
    __IO uint32_t IMR;                                                            ///< Interrupt Mask Register                      offset: 0x30
    __IO uint32_t RAWISR;                                                         ///< RAW Interrupt Status Register                offset: 0x34
    __IO uint32_t RXTLR;                                                          ///< Receive FIFO Threshold Level Register        offset: 0x38
    __IO uint32_t TXTLR;                                                          ///< Transmit FIFO Threshold Level Register       offset: 0x3C
    __IO uint32_t ICR;                                                            ///< Clear All Interrupt Register                 offset: 0x40
    __IO uint32_t RXUNDER;                                                        ///< Clear RXUNDER Interrupt Register            offset: 0x44
    __IO uint32_t RXOVER;                                                         ///< Clear RXOVER Interrupt Register             offset: 0x48
    __IO uint32_t TXOVER;                                                        ///< Clear TXOVER Interrupt Register             offset: 0x4C
    __IO uint32_t RDREQ;                                                         ///< Clear RDREQ Interrupt Register              offset: 0x50
    __IO uint32_t TXABRT;                                                        ///< Clear TXABRT Interrupt Register             offset: 0x54
    __IO uint32_t RXDONE;                                                        ///< Clear RXDONE Interrupt Register             offset: 0x58
    __IO uint32_t ACTIV;                                                          ///< Clear ACTIVITY Interrupt Register            offset: 0x5C
    __IO uint32_t STOP;                                                           ///< Clear STOP_DET Interrupt Register            offset: 0x60
    __IO uint32_t START;                                                          ///< Clear START_DET Interrupt Register           offset: 0x64
    __IO uint32_t GC;                                                             ///< Clear GEN_CALL Interrupt Register            offset: 0x68
    __IO uint32_t ENR;                                                            ///< Enable Register                              offset: 0x6C
    __IO uint32_t SR;                                                             ///< Status Register                              offset: 0x70
    __IO uint32_t TXFLR;                                                          ///< Transmit FIFO Level Register                 offset: 0x74
    __IO uint32_t RXFLR;                                                          ///< Receive FIFO Level Register                  offset: 0x78
    __IO uint32_t HOLD;                                                           ///< SDA Hold Time Register                       offset: 0x7C
    __IO uint32_t Reserved2[5];                                                   ///< Reserved
    __IO uint32_t SETUP;                                                          ///< SDA Setup Time Register                      offset: 0x94
    __IO uint32_t GCR;                                                            ///< ACK General Call Register                    offset: 0x98
    __IO uint32_t Reserved3[5];                                                   ///< Reserved
    __IO uint32_t SLVMASK;                                                        ///< Slave mask Register                          offset: 0xB0
    __IO uint32_t SLVRCVADDR;                                                     ///< Slave received address Register              offset: 0xB4
} I2C_Type;

/*!
 * @addtogroup I2C_Register_Masks Register Masks
 * @{ */

/*!
 * @brief I2C_CR Register Bit Definition
 */

