UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define I2C_CR_EMPINT_SHIFT                             (8)
#define I2C_CR_EMPINT_MASK                              (0x01U << I2C_CR_EMPINT_SHIFT)
#define I2C_CR_EMPINT(x)                                (((uint32_t)(((uint32_t)(x)) << I2C_CR_EMPINT_SHIFT)) & I2C_CR_EMPINT_MASK)

#define I2C_CR_STOPINT_SHIFT                            (7)
#define I2C_CR_STOPINT_MASK                             (0x01U << I2C_CR_STOPINT_SHIFT)
#define I2C_CR_STOPINT(x)                               (((uint32_t)(((uint32_t)(x)) << I2C_CR_STOPINT_SHIFT)) & I2C_CR_STOPINT_MASK)

#define I2C_CR_DISSLAVE_SHIFT                           (6)
#define I2C_CR_DISSLAVE_MASK                            (0x01U << I2C_CR_DISSLAVE_SHIFT)
#define I2C_CR_DISSLAVE(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_CR_DISSLAVE_SHIFT)) & I2C_CR_DISSLAVE_MASK)

#define I2C_CR_REPEN_SHIFT                              (5)
#define I2C_CR_REPEN_MASK                               (0x01U << I2C_CR_REPEN_SHIFT)
#define I2C_CR_REPEN(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_CR_REPEN_SHIFT)) & I2C_CR_REPEN_MASK)

#define I2C_CR_MASTER10_SHIFT                           (4)
#define I2C_CR_MASTER10_MASK                            (0x01U << I2C_CR_MASTER10_SHIFT)
#define I2C_CR_MASTER10(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_CR_MASTER10_SHIFT)) & I2C_CR_MASTER10_MASK)

#define I2C_CR_SLAVE10_SHIFT                            (3)
#define I2C_CR_SLAVE10_MASK                             (0x01U << I2C_CR_SLAVE10_SHIFT)
#define I2C_CR_SLAVE10(x)                               (((uint32_t)(((uint32_t)(x)) << I2C_CR_SLAVE10_SHIFT)) & I2C_CR_SLAVE10_MASK)

#define I2C_CR_SPEED_SHIFT                              (1)
#define I2C_CR_SPEED_MASK                               (0x03U << I2C_CR_SPEED_SHIFT)
#define I2C_CR_SPEED(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_CR_SPEED_SHIFT)) & I2C_CR_SPEED_MASK)

#define I2C_CR_MASTER_SHIFT                             (0)
#define I2C_CR_MASTER_MASK                              (0x01U << I2C_CR_MASTER_SHIFT)
#define I2C_CR_MASTER(x)                                (((uint32_t)(((uint32_t)(x)) << I2C_CR_MASTER_SHIFT)) & I2C_CR_MASTER_MASK)

/*!
 * @brief I2C_TAR Register Bit Definition
 */

#define I2C_TAR_SPECIAL_SHIFT                           (11)
#define I2C_TAR_SPECIAL_MASK                            (0x01U << I2C_TAR_SPECIAL_SHIFT)
#define I2C_TAR_SPECIAL(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_TAR_SPECIAL_SHIFT)) & I2C_TAR_SPECIAL_MASK)

#define I2C_TAR_GC_SHIFT                                (10)
#define I2C_TAR_GC_MASK                                 (0x01U << I2C_TAR_GC_SHIFT)
#define I2C_TAR_GC(x)                                   (((uint32_t)(((uint32_t)(x)) << I2C_TAR_GC_SHIFT)) & I2C_TAR_GC_MASK)

#define I2C_TAR_ADDR_SHIFT                              (0)
#define I2C_TAR_ADDR_MASK                               (0x3FFU << I2C_TAR_ADDR_SHIFT)
#define I2C_TAR_ADDR(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_TAR_ADDR_SHIFT)) & I2C_TAR_ADDR_MASK)

/*!
 * @brief I2C_SAR Register Bit Definition
 */

#define I2C_SAR_ADDR_SHIFT                              (0)
#define I2C_SAR_ADDR_MASK                               (0x3FFU << I2C_SAR_ADDR_SHIFT)
#define I2C_SAR_ADDR(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_SAR_ADDR_SHIFT)) & I2C_SAR_ADDR_MASK)

/*!
 * @brief I2C_DR Register Bit Definition
 */

#define I2C_DR_RESTART_SHIFT                            (10)
#define I2C_DR_RESTART_MASK                             (0x01U << I2C_DR_RESTART_SHIFT)
#define I2C_DR_RESTART(x)                               (((uint32_t)(((uint32_t)(x)) << I2C_DR_RESTART_SHIFT)) & I2C_DR_RESTART_MASK)

#define I2C_DR_STOP_SHIFT                               (9)
#define I2C_DR_STOP_MASK                                (0x01U << I2C_DR_STOP_SHIFT)
#define I2C_DR_STOP(x)                                  (((uint32_t)(((uint32_t)(x)) << I2C_DR_STOP_SHIFT)) & I2C_DR_STOP_MASK)

#define I2C_DR_CMD_SHIFT                                (8)
#define I2C_DR_CMD_MASK                                 (0x01U << I2C_DR_CMD_SHIFT)
#define I2C_DR_CMD(x)                                   (((uint32_t)(((uint32_t)(x)) << I2C_DR_CMD_SHIFT)) & I2C_DR_CMD_MASK)

#define I2C_DR_DAT_SHIFT                                (0)
#define I2C_DR_DAT_MASK                                 (0xFFU << I2C_DR_DAT_SHIFT)
#define I2C_DR_DAT(x)                                   (((uint32_t)(((uint32_t)(x)) << I2C_DR_DAT_SHIFT)) & I2C_DR_DAT_MASK)

/*!
 * @brief I2C_SSHR Register Bit Definition
 */

#define I2C_SSHR_CNT_SHIFT                              (0)
#define I2C_SSHR_CNT_MASK                               (0xFFFFU << I2C_SSHR_CNT_SHIFT)
#define I2C_SSHR_CNT(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_SSHR_CNT_SHIFT)) & I2C_SSHR_CNT_MASK)

/*!
 * @brief I2C_SSLR Register Bit Definition
 */

#define I2C_SSLR_CNT_SHIFT                              (0)
#define I2C_SSLR_CNT_MASK                               (0xFFFFU << I2C_SSLR_CNT_SHIFT)
#define I2C_SSLR_CNT(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_SSLR_CNT_SHIFT)) & I2C_SSLR_CNT_MASK)

/*!
 * @brief I2C_FSHR Register Bit Definition
 */

#define I2C_FSHR_CNT_SHIFT                              (0)
#define I2C_FSHR_CNT_MASK                               (0xFFFFU << I2C_FSHR_CNT_SHIFT)
#define I2C_FSHR_CNT(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_FSHR_CNT_SHIFT)) & I2C_FSHR_CNT_MASK)

/*!
 * @brief I2C_FSLR Register Bit Definition
 */

#define I2C_FSLR_CNT_SHIFT                              (0)
#define I2C_FSLR_CNT_MASK                               (0xFFFFU << I2C_FSLR_CNT_SHIFT)
#define I2C_FSLR_CNT(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_FSLR_CNT_SHIFT)) & I2C_FSLR_CNT_MASK)

/*!
 * @brief I2C_ISR Register Bit Definition
 */

#define I2C_ISR_ISR_SHIFT                               (0)
#define I2C_ISR_ISR_MASK                                (0x7FFU << I2C_ISR_ISR_SHIFT)
#define I2C_ISR_ISR(x)                                  (((uint32_t)(((uint32_t)(x)) << I2C_ISR_ISR_SHIFT)) & I2C_ISR_ISR_MASK)

/*!
 * @brief I2C_IMR Register Bit Definition
 */

