UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define I2C_IMR_IMR_SHIFT                               (0)
#define I2C_IMR_IMR_MASK                                (0x7FFU << I2C_IMR_IMR_SHIFT)
#define I2C_IMR_IMR(x)                                  (((uint32_t)(((uint32_t)(x)) << I2C_IMR_IMR_SHIFT)) & I2C_IMR_IMR_MASK)

/*!
 * @brief I2C_RAWISR Register Bit Definition
 */

#define I2C_RAWISR_HOLD_SHIFT                           (13)
#define I2C_RAWISR_HOLD_MASK                            (0x01U << I2C_RAWISR_HOLD_SHIFT)
#define I2C_RAWISR_HOLD(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_HOLD_SHIFT)) & I2C_RAWISR_HOLD_MASK)

#define I2C_RAWISR_RESTART_SHIFT                        (12)
#define I2C_RAWISR_RESTART_MASK                         (0x01U << I2C_RAWISR_RESTART_SHIFT)
#define I2C_RAWISR_RESTART(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_RESTART_SHIFT)) & I2C_RAWISR_RESTART_MASK)

#define I2C_RAWISR_GC_SHIFT                             (11)
#define I2C_RAWISR_GC_MASK                              (0x01U << I2C_RAWISR_GC_SHIFT)
#define I2C_RAWISR_GC(x)                                (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_GC_SHIFT)) & I2C_RAWISR_GC_MASK)

#define I2C_RAWISR_START_SHIFT                          (10)
#define I2C_RAWISR_START_MASK                           (0x01U << I2C_RAWISR_START_SHIFT)
#define I2C_RAWISR_START(x)                             (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_START_SHIFT)) & I2C_RAWISR_START_MASK)

#define I2C_RAWISR_STOP_SHIFT                           (9)
#define I2C_RAWISR_STOP_MASK                            (0x01U << I2C_RAWISR_STOP_SHIFT)
#define I2C_RAWISR_STOP(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_STOP_SHIFT)) & I2C_RAWISR_STOP_MASK)

#define I2C_RAWISR_ACTIV_SHIFT                          (8)
#define I2C_RAWISR_ACTIV_MASK                           (0x01U << I2C_RAWISR_ACTIV_SHIFT)
#define I2C_RAWISR_ACTIV(x)                             (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_ACTIV_SHIFT)) & I2C_RAWISR_ACTIV_MASK)

#define I2C_RAWISR_RXDONE_SHIFT                         (7)
#define I2C_RAWISR_RXDONE_MASK                          (0x01U << I2C_RAWISR_RXDONE_SHIFT)
#define I2C_RAWISR_RXDONE(x)                            (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_RXDONE_SHIFT)) & I2C_RAWISR_RXDONE_MASK)

#define I2C_RAWISR_TXABRT_SHIFT                         (6)
#define I2C_RAWISR_TXABRT_MASK                          (0x01U << I2C_RAWISR_TXABRT_SHIFT)
#define I2C_RAWISR_TXABRT(x)                            (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_TXABRT_SHIFT)) & I2C_RAWISR_TXABRT_MASK)

#define I2C_RAWISR_RDREQ_SHIFT                          (5)
#define I2C_RAWISR_RDREQ_MASK                           (0x01U << I2C_RAWISR_RDREQ_SHIFT)
#define I2C_RAWISR_RDREQ(x)                             (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_RDREQ_SHIFT)) & I2C_RAWISR_RDREQ_MASK)

#define I2C_RAWISR_TXEMPTY_SHIFT                        (4)
#define I2C_RAWISR_TXEMPTY_MASK                         (0x01U << I2C_RAWISR_TXEMPTY_SHIFT)
#define I2C_RAWISR_TXEMPTY(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_TXEMPTY_SHIFT)) & I2C_RAWISR_TXEMPTY_MASK)

#define I2C_RAWISR_TXOVER_SHIFT                         (3)
#define I2C_RAWISR_TXOVER_MASK                          (0x01U << I2C_RAWISR_TXOVER_SHIFT)
#define I2C_RAWISR_TXOVER(x)                            (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_TXOVER_SHIFT)) & I2C_RAWISR_TXOVER_MASK)

#define I2C_RAWISR_RXFULL_SHIFT                         (2)
#define I2C_RAWISR_RXFULL_MASK                          (0x01U << I2C_RAWISR_RXFULL_SHIFT)
#define I2C_RAWISR_RXFULL(x)                            (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_RXFULL_SHIFT)) & I2C_RAWISR_RXFULL_MASK)

#define I2C_RAWISR_RXOVER_SHIFT                         (1)
#define I2C_RAWISR_RXOVER_MASK                          (0x01U << I2C_RAWISR_RXOVER_SHIFT)
#define I2C_RAWISR_RXOVER(x)                            (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_RXOVER_SHIFT)) & I2C_RAWISR_RXOVER_MASK)

#define I2C_RAWISR_RXUNDER_SHIFT                        (0)
#define I2C_RAWISR_RXUNDER_MASK                         (0x01U << I2C_RAWISR_RXUNDER_SHIFT)
#define I2C_RAWISR_RXUNDER(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_RAWISR_RXUNDER_SHIFT)) & I2C_RAWISR_RXUNDER_MASK)

/*!
 * @brief I2C_RXTLR Register Bit Definition
 */

#define I2C_RXTLR_TL_SHIFT                              (0)
#define I2C_RXTLR_TL_MASK                               (0xFFU << I2C_RXTLR_TL_SHIFT)
#define I2C_RXTLR_TL(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_RXTLR_TL_SHIFT)) & I2C_RXTLR_TL_MASK)

/*!
 * @brief I2C_TXTLR Register Bit Definition
 */

#define I2C_TXTLR_TL_SHIFT                              (0)
#define I2C_TXTLR_TL_MASK                               (0xFFU << I2C_TXTLR_TL_SHIFT)
#define I2C_TXTLR_TL(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_TXTLR_TL_SHIFT)) & I2C_TXTLR_TL_MASK)

/*!
 * @brief I2C_ICR Register Bit Definition
 */

#define I2C_ICR_ICR_SHIFT                               (0)
#define I2C_ICR_ICR_MASK                                (0x01U << I2C_ICR_ICR_SHIFT)
#define I2C_ICR_ICR(x)                                  (((uint32_t)(((uint32_t)(x)) << I2C_ICR_ICR_SHIFT)) & I2C_ICR_ICR_MASK)

/*!
 * @brief I2C_RXUNDER Register Bit Definition
 */

#define I2C_RXUNDER_RXUNDER_SHIFT                      (0)
#define I2C_RXUNDER_RXUNDER_MASK                       (0x01U << I2C_RXUNDER_RXUNDER_SHIFT)
#define I2C_RXUNDER_RXUNDER(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_RXUNDER_RXUNDER_SHIFT)) & I2C_RXUNDER_RXUNDER_MASK)

/*!
 * @brief I2C_RXOVER Register Bit Definition
 */

#define I2C_RXOVER_RXOVER_SHIFT                        (0)
#define I2C_RXOVER_RXOVER_MASK                         (0x01U << I2C_RXOVER_RXOVER_SHIFT)
#define I2C_RXOVER_RXOVER(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_RXOVER_RXOVER_SHIFT)) & I2C_RXOVER_RXOVER_MASK)

/*!
 * @brief I2C_TXOVER Register Bit Definition
 */

#define I2C_TXOVER_TXOVER_SHIFT                        (0)
#define I2C_TXOVER_TXOVER_MASK                         (0x01U << I2C_TXOVER_TXOVER_SHIFT)
#define I2C_TXOVER_TXOVER(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_TXOVER_TXOVER_SHIFT)) & I2C_TXOVER_TXOVER_MASK)

/*!
 * @brief I2C_RDREQ Register Bit Definition
 */

#define I2C_RDREQ_RDREQ_SHIFT                          (0)
#define I2C_RDREQ_RDREQ_MASK                           (0x01U << I2C_RDREQ_RDREQ_SHIFT)
#define I2C_RDREQ_RDREQ(x)                             (((uint32_t)(((uint32_t)(x)) << I2C_RDREQ_RDREQ_SHIFT)) & I2C_RDREQ_RDREQ_MASK)

/*!
 * @brief I2C_TXABRT Register Bit Definition
 */

#define I2C_TXABRT_TXABRT_SHIFT                        (0)
#define I2C_TXABRT_TXABRT_MASK                         (0x01U << I2C_TXABRT_TXABRT_SHIFT)
#define I2C_TXABRT_TXABRT(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_TXABRT_TXABRT_SHIFT)) & I2C_TXABRT_TXABRT_MASK)

/*!
 * @brief I2C_RXDONE Register Bit Definition
 */

#define I2C_RXDONE_RXDONE_SHIFT                        (0)
#define I2C_RXDONE_RXDONE_MASK                         (0x01U << I2C_RXDONE_RXDONE_SHIFT)
#define I2C_RXDONE_RXDONE(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_RXDONE_RXDONE_SHIFT)) & I2C_RXDONE_RXDONE_MASK)

/*!
 * @brief I2C_ACTIV Register Bit Definition
 */

