UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define I2C_ACTIV_ACTIV_SHIFT                           (0)
#define I2C_ACTIV_ACTIV_MASK                            (0x01U << I2C_ACTIV_ACTIV_SHIFT)
#define I2C_ACTIV_ACTIV(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_ACTIV_ACTIV_SHIFT)) & I2C_ACTIV_ACTIV_MASK)

/*!
 * @brief I2C_STOP Register Bit Definition
 */

#define I2C_STOP_STOP_SHIFT                             (0)
#define I2C_STOP_STOP_MASK                              (0x01U << I2C_STOP_STOP_SHIFT)
#define I2C_STOP_STOP(x)                                (((uint32_t)(((uint32_t)(x)) << I2C_STOP_STOP_SHIFT)) & I2C_STOP_STOP_MASK)

/*!
 * @brief I2C_START Register Bit Definition
 */

#define I2C_START_START_SHIFT                           (0)
#define I2C_START_START_MASK                            (0x01U << I2C_START_START_SHIFT)
#define I2C_START_START(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_START_START_SHIFT)) & I2C_START_START_MASK)

/*!
 * @brief I2C_GC Register Bit Definition
 */

#define I2C_GC_GC_SHIFT                                 (0)
#define I2C_GC_GC_MASK                                  (0x01U << I2C_GC_GC_SHIFT)
#define I2C_GC_GC(x)                                    (((uint32_t)(((uint32_t)(x)) << I2C_GC_GC_SHIFT)) & I2C_GC_GC_MASK)

/*!
 * @brief I2C_ENR Register Bit Definition
 */

#define I2C_ENR_ABORT_SHIFT                             (1)
#define I2C_ENR_ABORT_MASK                              (0x01U << I2C_ENR_ABORT_SHIFT)
#define I2C_ENR_ABORT(x)                                (((uint32_t)(((uint32_t)(x)) << I2C_ENR_ABORT_SHIFT)) & I2C_ENR_ABORT_MASK)

#define I2C_ENR_ENABLE_SHIFT                            (0)
#define I2C_ENR_ENABLE_MASK                             (0x01U << I2C_ENR_ENABLE_SHIFT)
#define I2C_ENR_ENABLE(x)                               (((uint32_t)(((uint32_t)(x)) << I2C_ENR_ENABLE_SHIFT)) & I2C_ENR_ENABLE_MASK)

/*!
 * @brief I2C_SR Register Bit Definition
 */

#define I2C_SR_SLVACTIV_SHIFT                           (6)
#define I2C_SR_SLVACTIV_MASK                            (0x01U << I2C_SR_SLVACTIV_SHIFT)
#define I2C_SR_SLVACTIV(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_SR_SLVACTIV_SHIFT)) & I2C_SR_SLVACTIV_MASK)

#define I2C_SR_MSTACTIV_SHIFT                           (5)
#define I2C_SR_MSTACTIV_MASK                            (0x01U << I2C_SR_MSTACTIV_SHIFT)
#define I2C_SR_MSTACTIV(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_SR_MSTACTIV_SHIFT)) & I2C_SR_MSTACTIV_MASK)

#define I2C_SR_RFF_SHIFT                                (4)
#define I2C_SR_RFF_MASK                                 (0x01U << I2C_SR_RFF_SHIFT)
#define I2C_SR_RFF(x)                                   (((uint32_t)(((uint32_t)(x)) << I2C_SR_RFF_SHIFT)) & I2C_SR_RFF_MASK)

#define I2C_SR_RFNE_SHIFT                               (3)
#define I2C_SR_RFNE_MASK                                (0x01U << I2C_SR_RFNE_SHIFT)
#define I2C_SR_RFNE(x)                                  (((uint32_t)(((uint32_t)(x)) << I2C_SR_RFNE_SHIFT)) & I2C_SR_RFNE_MASK)

#define I2C_SR_TFE_SHIFT                                (2)
#define I2C_SR_TFE_MASK                                 (0x01U << I2C_SR_TFE_SHIFT)
#define I2C_SR_TFE(x)                                   (((uint32_t)(((uint32_t)(x)) << I2C_SR_TFE_SHIFT)) & I2C_SR_TFE_MASK)

#define I2C_SR_TFNF_SHIFT                               (1)
#define I2C_SR_TFNF_MASK                                (0x01U << I2C_SR_TFNF_SHIFT)
#define I2C_SR_TFNF(x)                                  (((uint32_t)(((uint32_t)(x)) << I2C_SR_TFNF_SHIFT)) & I2C_SR_TFNF_MASK)

#define I2C_SR_ACTIV_SHIFT                              (0)
#define I2C_SR_ACTIV_MASK                               (0x01U << I2C_SR_ACTIV_SHIFT)
#define I2C_SR_ACTIV(x)                                 (((uint32_t)(((uint32_t)(x)) << I2C_SR_ACTIV_SHIFT)) & I2C_SR_ACTIV_MASK)

/*!
 * @brief I2C_TXFLR Register Bit Definition
 */

#define I2C_TXFLR_CNT_SHIFT                             (0)
#define I2C_TXFLR_CNT_MASK                              (0x03U << I2C_TXFLR_CNT_SHIFT)
#define I2C_TXFLR_CNT(x)                                (((uint32_t)(((uint32_t)(x)) << I2C_TXFLR_CNT_SHIFT)) & I2C_TXFLR_CNT_MASK)

/*!
 * @brief I2C_RXFLR Register Bit Definition
 */

#define I2C_RXFLR_CNT_SHIFT                             (0)
#define I2C_RXFLR_CNT_MASK                              (0x03U << I2C_RXFLR_CNT_SHIFT)
#define I2C_RXFLR_CNT(x)                                (((uint32_t)(((uint32_t)(x)) << I2C_RXFLR_CNT_SHIFT)) & I2C_RXFLR_CNT_MASK)

/*!
 * @brief I2C_HOLD Register Bit Definition
 */

#define I2C_HOLD_RXHOLD_SHIFT                           (16)
#define I2C_HOLD_RXHOLD_MASK                            (0xFFU << I2C_HOLD_RXHOLD_SHIFT)
#define I2C_HOLD_RXHOLD(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_HOLD_RXHOLD_SHIFT)) & I2C_HOLD_RXHOLD_MASK)

#define I2C_HOLD_TXHOLD_SHIFT                           (0)
#define I2C_HOLD_TXHOLD_MASK                            (0xFFFFU << I2C_HOLD_TXHOLD_SHIFT)
#define I2C_HOLD_TXHOLD(x)                              (((uint32_t)(((uint32_t)(x)) << I2C_HOLD_TXHOLD_SHIFT)) & I2C_HOLD_TXHOLD_MASK)

/*!
 * @brief I2C_SETUP Register Bit Definition
 */

#define I2C_SETUP_CNT_SHIFT                             (0)
#define I2C_SETUP_CNT_MASK                              (0xFFU << I2C_SETUP_CNT_SHIFT)
#define I2C_SETUP_CNT(x)                                (((uint32_t)(((uint32_t)(x)) << I2C_SETUP_CNT_SHIFT)) & I2C_SETUP_CNT_MASK)

/*!
 * @brief I2C_GCR Register Bit Definition
 */

#define I2C_GCR_GC_SHIFT                                (0)
#define I2C_GCR_GC_MASK                                 (0x01U << I2C_GCR_GC_SHIFT)
#define I2C_GCR_GC(x)                                   (((uint32_t)(((uint32_t)(x)) << I2C_GCR_GC_SHIFT)) & I2C_GCR_GC_MASK)

/*!
 * @brief I2C_SLVMASK Register Bit Definition
 */

#define I2C_SLVMASK_MASK_SHIFT                          (0)
#define I2C_SLVMASK_MASK_MASK                           (0x3FFU << I2C_SLVMASK_MASK_SHIFT)
#define I2C_SLVMASK_MASK(x)                             (((uint32_t)(((uint32_t)(x)) << I2C_SLVMASK_MASK_SHIFT)) & I2C_SLVMASK_MASK_MASK)

/*!
 * @brief I2C_SLVRCVADDR Register Bit Definition
 */

#define I2C_SLVRCVADDR_ADDR_SHIFT                       (0)
#define I2C_SLVRCVADDR_ADDR_MASK                        (0x3FFU << I2C_SLVRCVADDR_ADDR_SHIFT)
#define I2C_SLVRCVADDR_ADDR(x)                          (((uint32_t)(((uint32_t)(x)) << I2C_SLVRCVADDR_ADDR_SHIFT)) & I2C_SLVRCVADDR_ADDR_MASK)

/*!
 * @}
 */ /* end of group I2C_Register_Masks */
/******************************************************************************
 * I2C Instance
 ******************************************************************************/

#define I2C1                ((I2C_Type*)I2C1_BASE)

/*!
 * @}
 */ /* end of group I2C_Peripheral_Access_Layer */

/*!
 * @addtogroup IWDG_Peripheral_Access_Layer IWDG Peripheral Access Layer
 *  @{
 */

