UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
/*******************************************************************************
 * IWDG Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t KR;                                                             ///< Key register                                 offset: 0x00
    __IO uint32_t PR;                                                             ///< Prescaler register                           offset: 0x04
    __IO uint32_t RLR;                                                            ///< Reload register                              offset: 0x08
    __IO uint32_t SR;                                                             ///< Status register                              offset: 0x0c
    __IO uint32_t CR;                                                             ///< Control register                             offset: 0x10
    __IO uint32_t IGEN;                                                           ///< Interruput generate value register           offset: 0x14
    __IO uint32_t CNT;                                                            ///< Counter                                      offset: 0x18
} IWDG_Type;

/*!
 * @addtogroup IWDG_Register_Masks Register Masks
 * @{ */

/*!
 * @brief IWDG_KR Register Bit Definition
 */

#define IWDG_KR_KEY_SHIFT                               (0)
#define IWDG_KR_KEY_MASK                                (0xFFFFU << IWDG_KR_KEY_SHIFT)
#define IWDG_KR_KEY(x)                                  (((uint32_t)(((uint32_t)(x)) << IWDG_KR_KEY_SHIFT)) & IWDG_KR_KEY_MASK)

/*!
 * @brief IWDG_PR Register Bit Definition
 */

#define IWDG_PR_PR_SHIFT                                (0)
#define IWDG_PR_PR_MASK                                 (0x07U << IWDG_PR_PR_SHIFT)
#define IWDG_PR_PR(x)                                   (((uint32_t)(((uint32_t)(x)) << IWDG_PR_PR_SHIFT)) & IWDG_PR_PR_MASK)

/*!
 * @brief IWDG_RLR Register Bit Definition
 */

#define IWDG_RLR_RL_SHIFT                               (0)
#define IWDG_RLR_RL_MASK                                (0xFFFU << IWDG_RLR_RL_SHIFT)
#define IWDG_RLR_RL(x)                                  (((uint32_t)(((uint32_t)(x)) << IWDG_RLR_RL_SHIFT)) & IWDG_RLR_RL_MASK)

/*!
 * @brief IWDG_SR Register Bit Definition
 */

#define IWDG_SR_UPDATE_SHIFT                            (3)
#define IWDG_SR_UPDATE_MASK                             (0x01U << IWDG_SR_UPDATE_SHIFT)
#define IWDG_SR_UPDATE(x)                               (((uint32_t)(((uint32_t)(x)) << IWDG_SR_UPDATE_SHIFT)) & IWDG_SR_UPDATE_MASK)

#define IWDG_SR_IVU_SHIFT                               (2)
#define IWDG_SR_IVU_MASK                                (0x01U << IWDG_SR_IVU_SHIFT)
#define IWDG_SR_IVU(x)                                  (((uint32_t)(((uint32_t)(x)) << IWDG_SR_IVU_SHIFT)) & IWDG_SR_IVU_MASK)

#define IWDG_SR_RVU_SHIFT                               (1)
#define IWDG_SR_RVU_MASK                                (0x01U << IWDG_SR_RVU_SHIFT)
#define IWDG_SR_RVU(x)                                  (((uint32_t)(((uint32_t)(x)) << IWDG_SR_RVU_SHIFT)) & IWDG_SR_RVU_MASK)

#define IWDG_SR_PVU_SHIFT                               (0)
#define IWDG_SR_PVU_MASK                                (0x01U << IWDG_SR_PVU_SHIFT)
#define IWDG_SR_PVU(x)                                  (((uint32_t)(((uint32_t)(x)) << IWDG_SR_PVU_SHIFT)) & IWDG_SR_PVU_MASK)

/*!
 * @brief IWDG_CR Register Bit Definition
 */

#define IWDG_CR_IRQCLR_SHIFT                            (1)
#define IWDG_CR_IRQCLR_MASK                             (0x01U << IWDG_CR_IRQCLR_SHIFT)
#define IWDG_CR_IRQCLR(x)                               (((uint32_t)(((uint32_t)(x)) << IWDG_CR_IRQCLR_SHIFT)) & IWDG_CR_IRQCLR_MASK)

#define IWDG_CR_IRQSEL_SHIFT                            (0)
#define IWDG_CR_IRQSEL_MASK                             (0x01U << IWDG_CR_IRQSEL_SHIFT)
#define IWDG_CR_IRQSEL(x)                               (((uint32_t)(((uint32_t)(x)) << IWDG_CR_IRQSEL_SHIFT)) & IWDG_CR_IRQSEL_MASK)

/*!
 * @brief IWDG_IGEN Register Bit Definition
 */

#define IWDG_IGEN_IGEN_SHIFT                            (0)
#define IWDG_IGEN_IGEN_MASK                             (0xFFFU << IWDG_IGEN_IGEN_SHIFT)
#define IWDG_IGEN_IGEN(x)                               (((uint32_t)(((uint32_t)(x)) << IWDG_IGEN_IGEN_SHIFT)) & IWDG_IGEN_IGEN_MASK)

/*!
 * @brief IWDG_CNT Register Bit Definition
 */

#define IWDG_CNT_CNT_SHIFT                              (8)
#define IWDG_CNT_CNT_MASK                               (0x7FFU << IWDG_CNT_CNT_SHIFT)
#define IWDG_CNT_CNT(x)                                 (((uint32_t)(((uint32_t)(x)) << IWDG_CNT_CNT_SHIFT)) & IWDG_CNT_CNT_MASK)

#define IWDG_CNT_PS_SHIFT                               (0)
#define IWDG_CNT_PS_MASK                                (0xFFU << IWDG_CNT_PS_SHIFT)
#define IWDG_CNT_PS(x)                                  (((uint32_t)(((uint32_t)(x)) << IWDG_CNT_PS_SHIFT)) & IWDG_CNT_PS_MASK)

/*!
 * @}
 */ /* end of group IWDG_Register_Masks */
/******************************************************************************
 * IWDG Instance
 ******************************************************************************/

#define IWDG                ((IWDG_Type*)IWDG_BASE)

/*!
 * @}
 */ /* end of group IWDG_Peripheral_Access_Layer */

/*!
 * @addtogroup PWR_Peripheral_Access_Layer PWR Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * PWR Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                             ///< CR                                           offset: 0x00
    __IO uint32_t CSR;                                                            ///< CSR                                          offset: 0x04
} PWR_Type;

/*!
 * @addtogroup PWR_Register_Masks Register Masks
 * @{ */

/*!
 * @brief PWR_CR Register Bit Definition
 */

#define PWR_CR_PLS_SHIFT                                (9)
#define PWR_CR_PLS_MASK                                 (0x0FU << PWR_CR_PLS_SHIFT)
#define PWR_CR_PLS(x)                                   (((uint32_t)(((uint32_t)(x)) << PWR_CR_PLS_SHIFT)) & PWR_CR_PLS_MASK)

#define PWR_CR_PVDE_SHIFT                               (4)
#define PWR_CR_PVDE_MASK                                (0x01U << PWR_CR_PVDE_SHIFT)
#define PWR_CR_PVDE(x)                                  (((uint32_t)(((uint32_t)(x)) << PWR_CR_PVDE_SHIFT)) & PWR_CR_PVDE_MASK)

#define PWR_CR_LPDS_SHIFT                               (1)
#define PWR_CR_LPDS_MASK                                (0x01U << PWR_CR_LPDS_SHIFT)
#define PWR_CR_LPDS(x)                                  (((uint32_t)(((uint32_t)(x)) << PWR_CR_LPDS_SHIFT)) & PWR_CR_LPDS_MASK)

/*!
 * @brief PWR_CSR Register Bit Definition
 */

#define PWR_CSR_PVDO_SHIFT                              (2)
#define PWR_CSR_PVDO_MASK                               (0x01U << PWR_CSR_PVDO_SHIFT)
#define PWR_CSR_PVDO(x)                                 (((uint32_t)(((uint32_t)(x)) << PWR_CSR_PVDO_SHIFT)) & PWR_CSR_PVDO_MASK)

/*!
 * @}
 */ /* end of group PWR_Register_Masks */
/******************************************************************************
 * PWR Instance
 ******************************************************************************/

#define PWR                ((PWR_Type*)PWR_BASE)

/*!
 * @}
 */ /* end of group PWR_Peripheral_Access_Layer */

/*!
 * @addtogroup RCC_Peripheral_Access_Layer RCC Peripheral Access Layer
 *  @{
 */

