UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
/*******************************************************************************
 * RCC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                             ///< Control Register                             offset: 0x00
    __IO uint32_t CFGR;                                                           ///< Configuration Register                       offset: 0x04
    __IO uint32_t CIR;                                                            ///< Clock Interrupt Register                     offset: 0x08
    __IO uint32_t Reserved0[1];                                                   ///< Reserved
    __IO uint32_t APB1RSTR;                                                       ///< Advanced Peripheral Bus 1 Reset Register     offset: 0x10
    __IO uint32_t AHBENR;                                                         ///< Advanced High Performance Bus Enable Registeroffset: 0x14
    __IO uint32_t Reserved1[1];                                                   ///< Reserved
    __IO uint32_t APB1ENR;                                                        ///< Advanced Peripheral Bus 1 Enable Register    offset: 0x1C
    __IO uint32_t Reserved2[1];                                                   ///< Reserved
    __IO uint32_t CSR;                                                            ///< Control Status Register                      offset: 0x24
    __IO uint32_t AHBRSTR;                                                        ///< Advanced High Performance Bus Reset Register offset: 0x28
    __IO uint32_t Reserved3[5];                                                   ///< Reserved
    __IO uint32_t SYSCFGR;                                                         ///< System Configuration Register                offset: 0x40
} RCC_Type;

/*!
 * @addtogroup RCC_Register_Masks Register Masks
 * @{ */

/*!
 * @brief RCC_CR Register Bit Definition
 */

#define RCC_CR_HSERDY_SHIFT                             (17)
#define RCC_CR_HSERDY_MASK                              (0x01U << RCC_CR_HSERDY_SHIFT)
#define RCC_CR_HSERDY(x)                                (((uint32_t)(((uint32_t)(x)) << RCC_CR_HSERDY_SHIFT)) & RCC_CR_HSERDY_MASK)

#define RCC_CR_HSEON_SHIFT                              (16)
#define RCC_CR_HSEON_MASK                               (0x01U << RCC_CR_HSEON_SHIFT)
#define RCC_CR_HSEON(x)                                 (((uint32_t)(((uint32_t)(x)) << RCC_CR_HSEON_SHIFT)) & RCC_CR_HSEON_MASK)

#define RCC_CR_HSIRDY_SHIFT                             (1)
#define RCC_CR_HSIRDY_MASK                              (0x01U << RCC_CR_HSIRDY_SHIFT)
#define RCC_CR_HSIRDY(x)                                (((uint32_t)(((uint32_t)(x)) << RCC_CR_HSIRDY_SHIFT)) & RCC_CR_HSIRDY_MASK)

#define RCC_CR_HSION_SHIFT                              (0)
#define RCC_CR_HSION_MASK                               (0x01U << RCC_CR_HSION_SHIFT)
#define RCC_CR_HSION(x)                                 (((uint32_t)(((uint32_t)(x)) << RCC_CR_HSION_SHIFT)) & RCC_CR_HSION_MASK)

/*!
 * @brief RCC_CFGR Register Bit Definition
 */

#define RCC_CFGR_MCO_SHIFT                              (24)
#define RCC_CFGR_MCO_MASK                               (0x07U << RCC_CFGR_MCO_SHIFT)
#define RCC_CFGR_MCO(x)                                 (((uint32_t)(((uint32_t)(x)) << RCC_CFGR_MCO_SHIFT)) & RCC_CFGR_MCO_MASK)

#define RCC_CFGR_PPRE1_SHIFT                            (8)
#define RCC_CFGR_PPRE1_MASK                             (0x07U << RCC_CFGR_PPRE1_SHIFT)
#define RCC_CFGR_PPRE1(x)                               (((uint32_t)(((uint32_t)(x)) << RCC_CFGR_PPRE1_SHIFT)) & RCC_CFGR_PPRE1_MASK)

#define RCC_CFGR_HPRE_SHIFT                             (4)
#define RCC_CFGR_HPRE_MASK                              (0x0FU << RCC_CFGR_HPRE_SHIFT)
#define RCC_CFGR_HPRE(x)                                (((uint32_t)(((uint32_t)(x)) << RCC_CFGR_HPRE_SHIFT)) & RCC_CFGR_HPRE_MASK)

#define RCC_CFGR_SWS_SHIFT                              (2)
#define RCC_CFGR_SWS_MASK                               (0x03U << RCC_CFGR_SWS_SHIFT)
#define RCC_CFGR_SWS(x)                                 (((uint32_t)(((uint32_t)(x)) << RCC_CFGR_SWS_SHIFT)) & RCC_CFGR_SWS_MASK)

#define RCC_CFGR_SW_SHIFT                               (0)
#define RCC_CFGR_SW_MASK                                (0x03U << RCC_CFGR_SW_SHIFT)
#define RCC_CFGR_SW(x)                                  (((uint32_t)(((uint32_t)(x)) << RCC_CFGR_SW_SHIFT)) & RCC_CFGR_SW_MASK)

/*!
 * @brief RCC_CIR Register Bit Definition
 */

#define RCC_CIR_HSERDYC_SHIFT                           (19)
#define RCC_CIR_HSERDYC_MASK                            (0x01U << RCC_CIR_HSERDYC_SHIFT)
#define RCC_CIR_HSERDYC(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CIR_HSERDYC_SHIFT)) & RCC_CIR_HSERDYC_MASK)

#define RCC_CIR_HSIRDYC_SHIFT                           (18)
#define RCC_CIR_HSIRDYC_MASK                            (0x01U << RCC_CIR_HSIRDYC_SHIFT)
#define RCC_CIR_HSIRDYC(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CIR_HSIRDYC_SHIFT)) & RCC_CIR_HSIRDYC_MASK)

#define RCC_CIR_LSIRDYC_SHIFT                           (16)
#define RCC_CIR_LSIRDYC_MASK                            (0x01U << RCC_CIR_LSIRDYC_SHIFT)
#define RCC_CIR_LSIRDYC(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CIR_LSIRDYC_SHIFT)) & RCC_CIR_LSIRDYC_MASK)

#define RCC_CIR_HSERDYIE_SHIFT                          (11)
#define RCC_CIR_HSERDYIE_MASK                           (0x01U << RCC_CIR_HSERDYIE_SHIFT)
#define RCC_CIR_HSERDYIE(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_CIR_HSERDYIE_SHIFT)) & RCC_CIR_HSERDYIE_MASK)

#define RCC_CIR_HSIRDYIE_SHIFT                          (10)
#define RCC_CIR_HSIRDYIE_MASK                           (0x01U << RCC_CIR_HSIRDYIE_SHIFT)
#define RCC_CIR_HSIRDYIE(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_CIR_HSIRDYIE_SHIFT)) & RCC_CIR_HSIRDYIE_MASK)

#define RCC_CIR_LSIRDYIE_SHIFT                          (8)
#define RCC_CIR_LSIRDYIE_MASK                           (0x01U << RCC_CIR_LSIRDYIE_SHIFT)
#define RCC_CIR_LSIRDYIE(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_CIR_LSIRDYIE_SHIFT)) & RCC_CIR_LSIRDYIE_MASK)

#define RCC_CIR_HSERDYF_SHIFT                           (3)
#define RCC_CIR_HSERDYF_MASK                            (0x01U << RCC_CIR_HSERDYF_SHIFT)
#define RCC_CIR_HSERDYF(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CIR_HSERDYF_SHIFT)) & RCC_CIR_HSERDYF_MASK)

