UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define RCC_CIR_HSIRDYF_SHIFT                           (2)
#define RCC_CIR_HSIRDYF_MASK                            (0x01U << RCC_CIR_HSIRDYF_SHIFT)
#define RCC_CIR_HSIRDYF(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CIR_HSIRDYF_SHIFT)) & RCC_CIR_HSIRDYF_MASK)

#define RCC_CIR_LSIRDYF_SHIFT                           (0)
#define RCC_CIR_LSIRDYF_MASK                            (0x01U << RCC_CIR_LSIRDYF_SHIFT)
#define RCC_CIR_LSIRDYF(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CIR_LSIRDYF_SHIFT)) & RCC_CIR_LSIRDYF_MASK)

/*!
 * @brief RCC_APB1RSTR Register Bit Definition
 */

#define RCC_APB1RSTR_SYSCFG_SHIFT                       (30)
#define RCC_APB1RSTR_SYSCFG_MASK                        (0x01U << RCC_APB1RSTR_SYSCFG_SHIFT)
#define RCC_APB1RSTR_SYSCFG(x)                          (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_SYSCFG_SHIFT)) & RCC_APB1RSTR_SYSCFG_MASK)

#define RCC_APB1RSTR_DBGMCU_SHIFT                       (29)
#define RCC_APB1RSTR_DBGMCU_MASK                        (0x01U << RCC_APB1RSTR_DBGMCU_SHIFT)
#define RCC_APB1RSTR_DBGMCU(x)                          (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_DBGMCU_SHIFT)) & RCC_APB1RSTR_DBGMCU_MASK)

#define RCC_APB1RSTR_PWR_SHIFT                          (28)
#define RCC_APB1RSTR_PWR_MASK                           (0x01U << RCC_APB1RSTR_PWR_SHIFT)
#define RCC_APB1RSTR_PWR(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_PWR_SHIFT)) & RCC_APB1RSTR_PWR_MASK)

#define RCC_APB1RSTR_I2C1_SHIFT                         (21)
#define RCC_APB1RSTR_I2C1_MASK                          (0x01U << RCC_APB1RSTR_I2C1_SHIFT)
#define RCC_APB1RSTR_I2C1(x)                            (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_I2C1_SHIFT)) & RCC_APB1RSTR_I2C1_MASK)

#define RCC_APB1RSTR_USART2_SHIFT                       (17)
#define RCC_APB1RSTR_USART2_MASK                        (0x01U << RCC_APB1RSTR_USART2_SHIFT)
#define RCC_APB1RSTR_USART2(x)                          (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_USART2_SHIFT)) & RCC_APB1RSTR_USART2_MASK)

#define RCC_APB1RSTR_USART1_SHIFT                       (16)
#define RCC_APB1RSTR_USART1_MASK                        (0x01U << RCC_APB1RSTR_USART1_SHIFT)
#define RCC_APB1RSTR_USART1(x)                          (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_USART1_SHIFT)) & RCC_APB1RSTR_USART1_MASK)

#define RCC_APB1RSTR_SPI1_SHIFT                         (12)
#define RCC_APB1RSTR_SPI1_MASK                          (0x01U << RCC_APB1RSTR_SPI1_SHIFT)
#define RCC_APB1RSTR_SPI1(x)                            (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_SPI1_SHIFT)) & RCC_APB1RSTR_SPI1_MASK)

#define RCC_APB1RSTR_ADC1_SHIFT                         (9)
#define RCC_APB1RSTR_ADC1_MASK                          (0x01U << RCC_APB1RSTR_ADC1_SHIFT)
#define RCC_APB1RSTR_ADC1(x)                            (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_ADC1_SHIFT)) & RCC_APB1RSTR_ADC1_MASK)

#define RCC_APB1RSTR_TIM14_SHIFT                        (3)
#define RCC_APB1RSTR_TIM14_MASK                         (0x01U << RCC_APB1RSTR_TIM14_SHIFT)
#define RCC_APB1RSTR_TIM14(x)                           (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM14_SHIFT)) & RCC_APB1RSTR_TIM14_MASK)

#define RCC_APB1RSTR_TIM1_SHIFT                         (2)
#define RCC_APB1RSTR_TIM1_MASK                          (0x01U << RCC_APB1RSTR_TIM1_SHIFT)
#define RCC_APB1RSTR_TIM1(x)                            (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM1_SHIFT)) & RCC_APB1RSTR_TIM1_MASK)

#define RCC_APB1RSTR_TIM3_SHIFT                         (1)
#define RCC_APB1RSTR_TIM3_MASK                          (0x01U << RCC_APB1RSTR_TIM3_SHIFT)
#define RCC_APB1RSTR_TIM3(x)                            (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM3_SHIFT)) & RCC_APB1RSTR_TIM3_MASK)

/*!
 * @brief RCC_AHBENR Register Bit Definition
 */

#define RCC_AHBENR_GPIOB_SHIFT                          (18)
#define RCC_AHBENR_GPIOB_MASK                           (0x01U << RCC_AHBENR_GPIOB_SHIFT)
#define RCC_AHBENR_GPIOB(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOB_SHIFT)) & RCC_AHBENR_GPIOB_MASK)

#define RCC_AHBENR_GPIOA_SHIFT                          (17)
#define RCC_AHBENR_GPIOA_MASK                           (0x01U << RCC_AHBENR_GPIOA_SHIFT)
#define RCC_AHBENR_GPIOA(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOA_SHIFT)) & RCC_AHBENR_GPIOA_MASK)

#define RCC_AHBENR_CRC_SHIFT                            (6)
#define RCC_AHBENR_CRC_MASK                             (0x01U << RCC_AHBENR_CRC_SHIFT)
#define RCC_AHBENR_CRC(x)                               (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_CRC_SHIFT)) & RCC_AHBENR_CRC_MASK)

#define RCC_AHBENR_FLASH_SHIFT                          (4)
#define RCC_AHBENR_FLASH_MASK                           (0x01U << RCC_AHBENR_FLASH_SHIFT)
#define RCC_AHBENR_FLASH(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_FLASH_SHIFT)) & RCC_AHBENR_FLASH_MASK)

#define RCC_AHBENR_SRAM_SHIFT                           (2)
#define RCC_AHBENR_SRAM_MASK                            (0x01U << RCC_AHBENR_SRAM_SHIFT)
#define RCC_AHBENR_SRAM(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_SRAM_SHIFT)) & RCC_AHBENR_SRAM_MASK)

/*!
 * @brief RCC_APB1ENR Register Bit Definition
 */

#define RCC_APB1ENR_SYSCFG_SHIFT                        (30)
#define RCC_APB1ENR_SYSCFG_MASK                         (0x01U << RCC_APB1ENR_SYSCFG_SHIFT)
#define RCC_APB1ENR_SYSCFG(x)                           (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_SYSCFG_SHIFT)) & RCC_APB1ENR_SYSCFG_MASK)

#define RCC_APB1ENR_DBGMCU_SHIFT                        (29)
#define RCC_APB1ENR_DBGMCU_MASK                         (0x01U << RCC_APB1ENR_DBGMCU_SHIFT)
#define RCC_APB1ENR_DBGMCU(x)                           (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_DBGMCU_SHIFT)) & RCC_APB1ENR_DBGMCU_MASK)

