UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define RCC_APB1ENR_PWR_SHIFT                           (28)
#define RCC_APB1ENR_PWR_MASK                            (0x01U << RCC_APB1ENR_PWR_SHIFT)
#define RCC_APB1ENR_PWR(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_PWR_SHIFT)) & RCC_APB1ENR_PWR_MASK)

#define RCC_APB1ENR_I2C1_SHIFT                          (21)
#define RCC_APB1ENR_I2C1_MASK                           (0x01U << RCC_APB1ENR_I2C1_SHIFT)
#define RCC_APB1ENR_I2C1(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_I2C1_SHIFT)) & RCC_APB1ENR_I2C1_MASK)

#define RCC_APB1ENR_USART2_SHIFT                        (17)
#define RCC_APB1ENR_USART2_MASK                         (0x01U << RCC_APB1ENR_USART2_SHIFT)
#define RCC_APB1ENR_USART2(x)                           (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_USART2_SHIFT)) & RCC_APB1ENR_USART2_MASK)

#define RCC_APB1ENR_USART1_SHIFT                        (16)
#define RCC_APB1ENR_USART1_MASK                         (0x01U << RCC_APB1ENR_USART1_SHIFT)
#define RCC_APB1ENR_USART1(x)                           (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_USART1_SHIFT)) & RCC_APB1ENR_USART1_MASK)

#define RCC_APB1ENR_SPI1_SHIFT                          (12)
#define RCC_APB1ENR_SPI1_MASK                           (0x01U << RCC_APB1ENR_SPI1_SHIFT)
#define RCC_APB1ENR_SPI1(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_SPI1_SHIFT)) & RCC_APB1ENR_SPI1_MASK)

#define RCC_APB1ENR_ADC1_SHIFT                          (9)
#define RCC_APB1ENR_ADC1_MASK                           (0x01U << RCC_APB1ENR_ADC1_SHIFT)
#define RCC_APB1ENR_ADC1(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_ADC1_SHIFT)) & RCC_APB1ENR_ADC1_MASK)

#define RCC_APB1ENR_TIM14_SHIFT                         (3)
#define RCC_APB1ENR_TIM14_MASK                          (0x01U << RCC_APB1ENR_TIM14_SHIFT)
#define RCC_APB1ENR_TIM14(x)                            (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_TIM14_SHIFT)) & RCC_APB1ENR_TIM14_MASK)

#define RCC_APB1ENR_TIM1_SHIFT                          (2)
#define RCC_APB1ENR_TIM1_MASK                           (0x01U << RCC_APB1ENR_TIM1_SHIFT)
#define RCC_APB1ENR_TIM1(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_TIM1_SHIFT)) & RCC_APB1ENR_TIM1_MASK)

#define RCC_APB1ENR_TIM3_SHIFT                          (1)
#define RCC_APB1ENR_TIM3_MASK                           (0x01U << RCC_APB1ENR_TIM3_SHIFT)
#define RCC_APB1ENR_TIM3(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_TIM3_SHIFT)) & RCC_APB1ENR_TIM3_MASK)

/*!
 * @brief RCC_CSR Register Bit Definition
 */

#define RCC_CSR_IWDGRSTF_SHIFT                          (29)
#define RCC_CSR_IWDGRSTF_MASK                           (0x01U << RCC_CSR_IWDGRSTF_SHIFT)
#define RCC_CSR_IWDGRSTF(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_CSR_IWDGRSTF_SHIFT)) & RCC_CSR_IWDGRSTF_MASK)

#define RCC_CSR_SFTRSTF_SHIFT                           (28)
#define RCC_CSR_SFTRSTF_MASK                            (0x01U << RCC_CSR_SFTRSTF_SHIFT)
#define RCC_CSR_SFTRSTF(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CSR_SFTRSTF_SHIFT)) & RCC_CSR_SFTRSTF_MASK)

#define RCC_CSR_PORRSTF_SHIFT                           (27)
#define RCC_CSR_PORRSTF_MASK                            (0x01U << RCC_CSR_PORRSTF_SHIFT)
#define RCC_CSR_PORRSTF(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CSR_PORRSTF_SHIFT)) & RCC_CSR_PORRSTF_MASK)

#define RCC_CSR_PINRSTF_SHIFT                           (26)
#define RCC_CSR_PINRSTF_MASK                            (0x01U << RCC_CSR_PINRSTF_SHIFT)
#define RCC_CSR_PINRSTF(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CSR_PINRSTF_SHIFT)) & RCC_CSR_PINRSTF_MASK)

#define RCC_CSR_RMVF_SHIFT                              (24)
#define RCC_CSR_RMVF_MASK                               (0x01U << RCC_CSR_RMVF_SHIFT)
#define RCC_CSR_RMVF(x)                                 (((uint32_t)(((uint32_t)(x)) << RCC_CSR_RMVF_SHIFT)) & RCC_CSR_RMVF_MASK)

#define RCC_CSR_LOCKUPF_SHIFT                           (23)
#define RCC_CSR_LOCKUPF_MASK                            (0x01U << RCC_CSR_LOCKUPF_SHIFT)
#define RCC_CSR_LOCKUPF(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LOCKUPF_SHIFT)) & RCC_CSR_LOCKUPF_MASK)

#define RCC_CSR_PVDRSTF_SHIFT                           (22)
#define RCC_CSR_PVDRSTF_MASK                            (0x01U << RCC_CSR_PVDRSTF_SHIFT)
#define RCC_CSR_PVDRSTF(x)                              (((uint32_t)(((uint32_t)(x)) << RCC_CSR_PVDRSTF_SHIFT)) & RCC_CSR_PVDRSTF_MASK)

#define RCC_CSR_LOCKUPEN_SHIFT                          (7)
#define RCC_CSR_LOCKUPEN_MASK                           (0x01U << RCC_CSR_LOCKUPEN_SHIFT)
#define RCC_CSR_LOCKUPEN(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LOCKUPEN_SHIFT)) & RCC_CSR_LOCKUPEN_MASK)

#define RCC_CSR_PVDRSTEN_SHIFT                          (6)
#define RCC_CSR_PVDRSTEN_MASK                           (0x01U << RCC_CSR_PVDRSTEN_SHIFT)
#define RCC_CSR_PVDRSTEN(x)                             (((uint32_t)(((uint32_t)(x)) << RCC_CSR_PVDRSTEN_SHIFT)) & RCC_CSR_PVDRSTEN_MASK)

#define RCC_CSR_LSIRDY_SHIFT                            (1)
#define RCC_CSR_LSIRDY_MASK                             (0x01U << RCC_CSR_LSIRDY_SHIFT)
#define RCC_CSR_LSIRDY(x)                               (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LSIRDY_SHIFT)) & RCC_CSR_LSIRDY_MASK)

#define RCC_CSR_LSION_SHIFT                             (0)
#define RCC_CSR_LSION_MASK                              (0x01U << RCC_CSR_LSION_SHIFT)
#define RCC_CSR_LSION(x)                                (((uint32_t)(((uint32_t)(x)) << RCC_CSR_LSION_SHIFT)) & RCC_CSR_LSION_MASK)

/*!
 * @brief RCC_AHBRSTR Register Bit Definition
 */

#define RCC_AHBRSTR_GPIOB_SHIFT                         (18)
#define RCC_AHBRSTR_GPIOB_MASK                          (0x01U << RCC_AHBRSTR_GPIOB_SHIFT)
#define RCC_AHBRSTR_GPIOB(x)                            (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOB_SHIFT)) & RCC_AHBRSTR_GPIOB_MASK)

#define RCC_AHBRSTR_GPIOA_SHIFT                         (17)
#define RCC_AHBRSTR_GPIOA_MASK                          (0x01U << RCC_AHBRSTR_GPIOA_SHIFT)
#define RCC_AHBRSTR_GPIOA(x)                            (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOA_SHIFT)) & RCC_AHBRSTR_GPIOA_MASK)

/*!
 * @brief RCC_SYSCFGR Register Bit Definition
 */

#define RCC_SYSCFGR_SFTNRSTRMP_SHIFT                     (2)
#define RCC_SYSCFGR_SFTNRSTRMP_MASK                      (0x01U << RCC_SYSCFGR_SFTNRSTRMP_SHIFT)
#define RCC_SYSCFGR_SFTNRSTRMP(x)                        (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFGR_SFTNRSTRMP_SHIFT)) & RCC_SYSCFGR_SFTNRSTRMP_MASK)

#define RCC_SYSCFGR_SECTOR1KCFG_SHIFT                    (1)
#define RCC_SYSCFGR_SECTOR1KCFG_MASK                     (0x01U << RCC_SYSCFGR_SECTOR1KCFG_SHIFT)
#define RCC_SYSCFGR_SECTOR1KCFG(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFGR_SECTOR1KCFG_SHIFT)) & RCC_SYSCFGR_SECTOR1KCFG_MASK)

