UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define RCC_SYSCFGR_PROGCHECKEN_SHIFT                    (0)
#define RCC_SYSCFGR_PROGCHECKEN_MASK                     (0x01U << RCC_SYSCFGR_PROGCHECKEN_SHIFT)
#define RCC_SYSCFGR_PROGCHECKEN(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_SYSCFGR_PROGCHECKEN_SHIFT)) & RCC_SYSCFGR_PROGCHECKEN_MASK)

/*!
 * @}
 */ /* end of group RCC_Register_Masks */
/******************************************************************************
 * RCC Instance
 ******************************************************************************/

#define RCC                ((RCC_Type*)RCC_BASE)

/*!
 * @}
 */ /* end of group RCC_Peripheral_Access_Layer */

/*!
 * @addtogroup SPI_Peripheral_Access_Layer SPI Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * SPI Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t TXREG;                                                          ///< TXREG                                        offset: 0x00
    __IO uint32_t RXREG;                                                          ///< RXREG                                        offset: 0x04
    __IO uint32_t CSTAT;                                                          ///< CSTAT                                        offset: 0x08
    __IO uint32_t INTSTAT;                                                        ///< INTSTAT                                      offset: 0x0C
    __IO uint32_t INTEN;                                                          ///< INTEN                                        offset: 0x10
    __IO uint32_t INTCLR;                                                         ///< INTCLR                                       offset: 0x14
    __IO uint32_t GCTL;                                                           ///< GCTL                                         offset: 0x18
    __IO uint32_t CCTL;                                                           ///< CCTL                                         offset: 0x1C
    __IO uint32_t SPBRG;                                                          ///< SPBRG                                        offset: 0x20
    __IO uint32_t RXDNR;                                                          ///< RXDNR                                        offset: 0x24
    __IO uint32_t NSSR;                                                           ///< NSSR                                         offset: 0x28
    __IO uint32_t EXTCTL;                                                         ///< EXTCTL                                       offset: 0x2C
} SPI_Type;

/*!
 * @addtogroup SPI_Register_Masks Register Masks
 * @{ */

/*!
 * @brief SPI_TXREG Register Bit Definition
 */

#define SPI_TXREG_TXREG_SHIFT                           (0)
#define SPI_TXREG_TXREG_MASK                            (0xFFFFFFFFU << SPI_TXREG_TXREG_SHIFT)
#define SPI_TXREG_TXREG(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_TXREG_TXREG_SHIFT)) & SPI_TXREG_TXREG_MASK)

/*!
 * @brief SPI_RXREG Register Bit Definition
 */

#define SPI_RXREG_RXREG_SHIFT                           (0)
#define SPI_RXREG_RXREG_MASK                            (0xFFFFFFFFU << SPI_RXREG_RXREG_SHIFT)
#define SPI_RXREG_RXREG(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_RXREG_RXREG_SHIFT)) & SPI_RXREG_RXREG_MASK)

/*!
 * @brief SPI_CSTAT Register Bit Definition
 */

#define SPI_CSTAT_RXFADDR_SHIFT                         (8)
#define SPI_CSTAT_RXFADDR_MASK                          (0x07U << SPI_CSTAT_RXFADDR_SHIFT)
#define SPI_CSTAT_RXFADDR(x)                            (((uint32_t)(((uint32_t)(x)) << SPI_CSTAT_RXFADDR_SHIFT)) & SPI_CSTAT_RXFADDR_MASK)

#define SPI_CSTAT_TXFADDR_SHIFT                         (4)
#define SPI_CSTAT_TXFADDR_MASK                          (0x07U << SPI_CSTAT_TXFADDR_SHIFT)
#define SPI_CSTAT_TXFADDR(x)                            (((uint32_t)(((uint32_t)(x)) << SPI_CSTAT_TXFADDR_SHIFT)) & SPI_CSTAT_TXFADDR_MASK)

#define SPI_CSTAT_RXAVL4BYTE_SHIFT                      (3)
#define SPI_CSTAT_RXAVL4BYTE_MASK                       (0x01U << SPI_CSTAT_RXAVL4BYTE_SHIFT)
#define SPI_CSTAT_RXAVL4BYTE(x)                         (((uint32_t)(((uint32_t)(x)) << SPI_CSTAT_RXAVL4BYTE_SHIFT)) & SPI_CSTAT_RXAVL4BYTE_MASK)

#define SPI_CSTAT_TXFULL_SHIFT                          (2)
#define SPI_CSTAT_TXFULL_MASK                           (0x01U << SPI_CSTAT_TXFULL_SHIFT)
#define SPI_CSTAT_TXFULL(x)                             (((uint32_t)(((uint32_t)(x)) << SPI_CSTAT_TXFULL_SHIFT)) & SPI_CSTAT_TXFULL_MASK)

#define SPI_CSTAT_RXAVL_SHIFT                           (1)
#define SPI_CSTAT_RXAVL_MASK                            (0x01U << SPI_CSTAT_RXAVL_SHIFT)
#define SPI_CSTAT_RXAVL(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_CSTAT_RXAVL_SHIFT)) & SPI_CSTAT_RXAVL_MASK)

#define SPI_CSTAT_TXEPT_SHIFT                           (0)
#define SPI_CSTAT_TXEPT_MASK                            (0x01U << SPI_CSTAT_TXEPT_SHIFT)
#define SPI_CSTAT_TXEPT(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_CSTAT_TXEPT_SHIFT)) & SPI_CSTAT_TXEPT_MASK)

/*!
 * @brief SPI_INTSTAT Register Bit Definition
 */

#define SPI_INTSTAT_TXEPTINTF_SHIFT                     (6)
#define SPI_INTSTAT_TXEPTINTF_MASK                      (0x01U << SPI_INTSTAT_TXEPTINTF_SHIFT)
#define SPI_INTSTAT_TXEPTINTF(x)                        (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_TXEPTINTF_SHIFT)) & SPI_INTSTAT_TXEPTINTF_MASK)

#define SPI_INTSTAT_RXFULLINTF_SHIFT                    (5)
#define SPI_INTSTAT_RXFULLINTF_MASK                     (0x01U << SPI_INTSTAT_RXFULLINTF_SHIFT)
#define SPI_INTSTAT_RXFULLINTF(x)                       (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_RXFULLINTF_SHIFT)) & SPI_INTSTAT_RXFULLINTF_MASK)

#define SPI_INTSTAT_RXMATCHINTF_SHIFT                   (4)
#define SPI_INTSTAT_RXMATCHINTF_MASK                    (0x01U << SPI_INTSTAT_RXMATCHINTF_SHIFT)
#define SPI_INTSTAT_RXMATCHINTF(x)                      (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_RXMATCHINTF_SHIFT)) & SPI_INTSTAT_RXMATCHINTF_MASK)

#define SPI_INTSTAT_RXOERRINTF_SHIFT                    (3)
#define SPI_INTSTAT_RXOERRINTF_MASK                     (0x01U << SPI_INTSTAT_RXOERRINTF_SHIFT)
#define SPI_INTSTAT_RXOERRINTF(x)                       (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_RXOERRINTF_SHIFT)) & SPI_INTSTAT_RXOERRINTF_MASK)

