UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define SPI_INTSTAT_UNDERRUNINTF_SHIFT                  (2)
#define SPI_INTSTAT_UNDERRUNINTF_MASK                   (0x01U << SPI_INTSTAT_UNDERRUNINTF_SHIFT)
#define SPI_INTSTAT_UNDERRUNINTF(x)                     (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_UNDERRUNINTF_SHIFT)) & SPI_INTSTAT_UNDERRUNINTF_MASK)

#define SPI_INTSTAT_RXINTF_SHIFT                        (1)
#define SPI_INTSTAT_RXINTF_MASK                         (0x01U << SPI_INTSTAT_RXINTF_SHIFT)
#define SPI_INTSTAT_RXINTF(x)                           (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_RXINTF_SHIFT)) & SPI_INTSTAT_RXINTF_MASK)

#define SPI_INTSTAT_TXINTF_SHIFT                        (0)
#define SPI_INTSTAT_TXINTF_MASK                         (0x01U << SPI_INTSTAT_TXINTF_SHIFT)
#define SPI_INTSTAT_TXINTF(x)                           (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_TXINTF_SHIFT)) & SPI_INTSTAT_TXINTF_MASK)

/*!
 * @brief SPI_INTEN Register Bit Definition
 */

#define SPI_INTEN_TXEPTIEN_SHIFT                        (6)
#define SPI_INTEN_TXEPTIEN_MASK                         (0x01U << SPI_INTEN_TXEPTIEN_SHIFT)
#define SPI_INTEN_TXEPTIEN(x)                           (((uint32_t)(((uint32_t)(x)) << SPI_INTEN_TXEPTIEN_SHIFT)) & SPI_INTEN_TXEPTIEN_MASK)

#define SPI_INTEN_RXFULLIEN_SHIFT                       (5)
#define SPI_INTEN_RXFULLIEN_MASK                        (0x01U << SPI_INTEN_RXFULLIEN_SHIFT)
#define SPI_INTEN_RXFULLIEN(x)                          (((uint32_t)(((uint32_t)(x)) << SPI_INTEN_RXFULLIEN_SHIFT)) & SPI_INTEN_RXFULLIEN_MASK)

#define SPI_INTEN_RXMATCHIEN_SHIFT                      (4)
#define SPI_INTEN_RXMATCHIEN_MASK                       (0x01U << SPI_INTEN_RXMATCHIEN_SHIFT)
#define SPI_INTEN_RXMATCHIEN(x)                         (((uint32_t)(((uint32_t)(x)) << SPI_INTEN_RXMATCHIEN_SHIFT)) & SPI_INTEN_RXMATCHIEN_MASK)

#define SPI_INTEN_RXOERRIEN_SHIFT                       (3)
#define SPI_INTEN_RXOERRIEN_MASK                        (0x01U << SPI_INTEN_RXOERRIEN_SHIFT)
#define SPI_INTEN_RXOERRIEN(x)                          (((uint32_t)(((uint32_t)(x)) << SPI_INTEN_RXOERRIEN_SHIFT)) & SPI_INTEN_RXOERRIEN_MASK)

#define SPI_INTEN_UNDERRUNIEN_SHIFT                     (2)
#define SPI_INTEN_UNDERRUNIEN_MASK                      (0x01U << SPI_INTEN_UNDERRUNIEN_SHIFT)
#define SPI_INTEN_UNDERRUNIEN(x)                        (((uint32_t)(((uint32_t)(x)) << SPI_INTEN_UNDERRUNIEN_SHIFT)) & SPI_INTEN_UNDERRUNIEN_MASK)

#define SPI_INTEN_RXIEN_SHIFT                           (1)
#define SPI_INTEN_RXIEN_MASK                            (0x01U << SPI_INTEN_RXIEN_SHIFT)
#define SPI_INTEN_RXIEN(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_INTEN_RXIEN_SHIFT)) & SPI_INTEN_RXIEN_MASK)

#define SPI_INTEN_TXIEN_SHIFT                           (0)
#define SPI_INTEN_TXIEN_MASK                            (0x01U << SPI_INTEN_TXIEN_SHIFT)
#define SPI_INTEN_TXIEN(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_INTEN_TXIEN_SHIFT)) & SPI_INTEN_TXIEN_MASK)

/*!
 * @brief SPI_INTCLR Register Bit Definition
 */

#define SPI_INTCLR_TXEPTICLR_SHIFT                      (6)
#define SPI_INTCLR_TXEPTICLR_MASK                       (0x01U << SPI_INTCLR_TXEPTICLR_SHIFT)
#define SPI_INTCLR_TXEPTICLR(x)                         (((uint32_t)(((uint32_t)(x)) << SPI_INTCLR_TXEPTICLR_SHIFT)) & SPI_INTCLR_TXEPTICLR_MASK)

#define SPI_INTCLR_RXFULLICLR_SHIFT                     (5)
#define SPI_INTCLR_RXFULLICLR_MASK                      (0x01U << SPI_INTCLR_RXFULLICLR_SHIFT)
#define SPI_INTCLR_RXFULLICLR(x)                        (((uint32_t)(((uint32_t)(x)) << SPI_INTCLR_RXFULLICLR_SHIFT)) & SPI_INTCLR_RXFULLICLR_MASK)

#define SPI_INTCLR_RXMATCHICLR_SHIFT                    (4)
#define SPI_INTCLR_RXMATCHICLR_MASK                     (0x01U << SPI_INTCLR_RXMATCHICLR_SHIFT)
#define SPI_INTCLR_RXMATCHICLR(x)                       (((uint32_t)(((uint32_t)(x)) << SPI_INTCLR_RXMATCHICLR_SHIFT)) & SPI_INTCLR_RXMATCHICLR_MASK)

#define SPI_INTCLR_RXOERRICLR_SHIFT                     (3)
#define SPI_INTCLR_RXOERRICLR_MASK                      (0x01U << SPI_INTCLR_RXOERRICLR_SHIFT)
#define SPI_INTCLR_RXOERRICLR(x)                        (((uint32_t)(((uint32_t)(x)) << SPI_INTCLR_RXOERRICLR_SHIFT)) & SPI_INTCLR_RXOERRICLR_MASK)

#define SPI_INTCLR_UNDERRUNICLR_SHIFT                   (2)
#define SPI_INTCLR_UNDERRUNICLR_MASK                    (0x01U << SPI_INTCLR_UNDERRUNICLR_SHIFT)
#define SPI_INTCLR_UNDERRUNICLR(x)                      (((uint32_t)(((uint32_t)(x)) << SPI_INTCLR_UNDERRUNICLR_SHIFT)) & SPI_INTCLR_UNDERRUNICLR_MASK)

#define SPI_INTCLR_RXICLR_SHIFT                         (1)
#define SPI_INTCLR_RXICLR_MASK                          (0x01U << SPI_INTCLR_RXICLR_SHIFT)
#define SPI_INTCLR_RXICLR(x)                            (((uint32_t)(((uint32_t)(x)) << SPI_INTCLR_RXICLR_SHIFT)) & SPI_INTCLR_RXICLR_MASK)

#define SPI_INTCLR_TXICLR_SHIFT                         (0)
#define SPI_INTCLR_TXICLR_MASK                          (0x01U << SPI_INTCLR_TXICLR_SHIFT)
#define SPI_INTCLR_TXICLR(x)                            (((uint32_t)(((uint32_t)(x)) << SPI_INTCLR_TXICLR_SHIFT)) & SPI_INTCLR_TXICLR_MASK)

/*!
 * @brief SPI_GCTL Register Bit Definition
 */

#define SPI_GCTL_NSSTOG_SHIFT                           (12)
#define SPI_GCTL_NSSTOG_MASK                            (0x01U << SPI_GCTL_NSSTOG_SHIFT)
#define SPI_GCTL_NSSTOG(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_NSSTOG_SHIFT)) & SPI_GCTL_NSSTOG_MASK)

#define SPI_GCTL_DW832_SHIFT                            (11)
#define SPI_GCTL_DW832_MASK                             (0x01U << SPI_GCTL_DW832_SHIFT)
#define SPI_GCTL_DW832(x)                               (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_DW832_SHIFT)) & SPI_GCTL_DW832_MASK)

#define SPI_GCTL_NSS_SHIFT                              (10)
#define SPI_GCTL_NSS_MASK                               (0x01U << SPI_GCTL_NSS_SHIFT)
#define SPI_GCTL_NSS(x)                                 (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_NSS_SHIFT)) & SPI_GCTL_NSS_MASK)

#define SPI_GCTL_DMAEN_SHIFT                            (9)
#define SPI_GCTL_DMAEN_MASK                             (0x01U << SPI_GCTL_DMAEN_SHIFT)
#define SPI_GCTL_DMAEN(x)                               (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_DMAEN_SHIFT)) & SPI_GCTL_DMAEN_MASK)

#define SPI_GCTL_TXTLF_SHIFT                            (7)
#define SPI_GCTL_TXTLF_MASK                             (0x03U << SPI_GCTL_TXTLF_SHIFT)
#define SPI_GCTL_TXTLF(x)                               (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_TXTLF_SHIFT)) & SPI_GCTL_TXTLF_MASK)

#define SPI_GCTL_RXTLF_SHIFT                            (5)
#define SPI_GCTL_RXTLF_MASK                             (0x03U << SPI_GCTL_RXTLF_SHIFT)
#define SPI_GCTL_RXTLF(x)                               (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_RXTLF_SHIFT)) & SPI_GCTL_RXTLF_MASK)

#define SPI_GCTL_RXEN_SHIFT                             (4)
#define SPI_GCTL_RXEN_MASK                              (0x01U << SPI_GCTL_RXEN_SHIFT)
#define SPI_GCTL_RXEN(x)                                (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_RXEN_SHIFT)) & SPI_GCTL_RXEN_MASK)

#define SPI_GCTL_TXEN_SHIFT                             (3)
#define SPI_GCTL_TXEN_MASK                              (0x01U << SPI_GCTL_TXEN_SHIFT)
#define SPI_GCTL_TXEN(x)                                (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_TXEN_SHIFT)) & SPI_GCTL_TXEN_MASK)

#define SPI_GCTL_MODE_SHIFT                             (2)
#define SPI_GCTL_MODE_MASK                              (0x01U << SPI_GCTL_MODE_SHIFT)
#define SPI_GCTL_MODE(x)                                (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_MODE_SHIFT)) & SPI_GCTL_MODE_MASK)

#define SPI_GCTL_INTEN_SHIFT                            (1)
#define SPI_GCTL_INTEN_MASK                             (0x01U << SPI_GCTL_INTEN_SHIFT)
#define SPI_GCTL_INTEN(x)                               (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_INTEN_SHIFT)) & SPI_GCTL_INTEN_MASK)

