UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define SPI_GCTL_SPIEN_SHIFT                            (0)
#define SPI_GCTL_SPIEN_MASK                             (0x01U << SPI_GCTL_SPIEN_SHIFT)
#define SPI_GCTL_SPIEN(x)                               (((uint32_t)(((uint32_t)(x)) << SPI_GCTL_SPIEN_SHIFT)) & SPI_GCTL_SPIEN_MASK)

/*!
 * @brief SPI_CCTL Register Bit Definition
 */

#define SPI_CCTL_HISPD_SHIFT                            (7)
#define SPI_CCTL_HISPD_MASK                             (0x01U << SPI_CCTL_HISPD_SHIFT)
#define SPI_CCTL_HISPD(x)                               (((uint32_t)(((uint32_t)(x)) << SPI_CCTL_HISPD_SHIFT)) & SPI_CCTL_HISPD_MASK)

#define SPI_CCTL_CPHASEL_SHIFT                          (6)
#define SPI_CCTL_CPHASEL_MASK                           (0x01U << SPI_CCTL_CPHASEL_SHIFT)
#define SPI_CCTL_CPHASEL(x)                             (((uint32_t)(((uint32_t)(x)) << SPI_CCTL_CPHASEL_SHIFT)) & SPI_CCTL_CPHASEL_MASK)

#define SPI_CCTL_TXEDGE_SHIFT                           (5)
#define SPI_CCTL_TXEDGE_MASK                            (0x01U << SPI_CCTL_TXEDGE_SHIFT)
#define SPI_CCTL_TXEDGE(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_CCTL_TXEDGE_SHIFT)) & SPI_CCTL_TXEDGE_MASK)

#define SPI_CCTL_RXEDGE_SHIFT                           (4)
#define SPI_CCTL_RXEDGE_MASK                            (0x01U << SPI_CCTL_RXEDGE_SHIFT)
#define SPI_CCTL_RXEDGE(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_CCTL_RXEDGE_SHIFT)) & SPI_CCTL_RXEDGE_MASK)

#define SPI_CCTL_SPILEN_SHIFT                           (3)
#define SPI_CCTL_SPILEN_MASK                            (0x01U << SPI_CCTL_SPILEN_SHIFT)
#define SPI_CCTL_SPILEN(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_CCTL_SPILEN_SHIFT)) & SPI_CCTL_SPILEN_MASK)

#define SPI_CCTL_LSBFE_SHIFT                            (2)
#define SPI_CCTL_LSBFE_MASK                             (0x01U << SPI_CCTL_LSBFE_SHIFT)
#define SPI_CCTL_LSBFE(x)                               (((uint32_t)(((uint32_t)(x)) << SPI_CCTL_LSBFE_SHIFT)) & SPI_CCTL_LSBFE_MASK)

#define SPI_CCTL_CPOL_SHIFT                             (1)
#define SPI_CCTL_CPOL_MASK                              (0x01U << SPI_CCTL_CPOL_SHIFT)
#define SPI_CCTL_CPOL(x)                                (((uint32_t)(((uint32_t)(x)) << SPI_CCTL_CPOL_SHIFT)) & SPI_CCTL_CPOL_MASK)

#define SPI_CCTL_CPHA_SHIFT                             (0)
#define SPI_CCTL_CPHA_MASK                              (0x01U << SPI_CCTL_CPHA_SHIFT)
#define SPI_CCTL_CPHA(x)                                (((uint32_t)(((uint32_t)(x)) << SPI_CCTL_CPHA_SHIFT)) & SPI_CCTL_CPHA_MASK)

/*!
 * @brief SPI_SPBRG Register Bit Definition
 */

#define SPI_SPBRG_SPBRG_SHIFT                           (0)
#define SPI_SPBRG_SPBRG_MASK                            (0xFFFFU << SPI_SPBRG_SPBRG_SHIFT)
#define SPI_SPBRG_SPBRG(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_SPBRG_SPBRG_SHIFT)) & SPI_SPBRG_SPBRG_MASK)

/*!
 * @brief SPI_RXDNR Register Bit Definition
 */

#define SPI_RXDNR_RXDNR_SHIFT                           (0)
#define SPI_RXDNR_RXDNR_MASK                            (0xFFFFU << SPI_RXDNR_RXDNR_SHIFT)
#define SPI_RXDNR_RXDNR(x)                              (((uint32_t)(((uint32_t)(x)) << SPI_RXDNR_RXDNR_SHIFT)) & SPI_RXDNR_RXDNR_MASK)

/*!
 * @brief SPI_NSSR Register Bit Definition
 */

#define SPI_NSSR_NSS_SHIFT                              (0)
#define SPI_NSSR_NSS_MASK                               (0x01U << SPI_NSSR_NSS_SHIFT)
#define SPI_NSSR_NSS(x)                                 (((uint32_t)(((uint32_t)(x)) << SPI_NSSR_NSS_SHIFT)) & SPI_NSSR_NSS_MASK)

/*!
 * @brief SPI_EXTCTL Register Bit Definition
 */

#define SPI_EXTCTL_EXTLEN_SHIFT                         (0)
#define SPI_EXTCTL_EXTLEN_MASK                          (0x1FU << SPI_EXTCTL_EXTLEN_SHIFT)
#define SPI_EXTCTL_EXTLEN(x)                            (((uint32_t)(((uint32_t)(x)) << SPI_EXTCTL_EXTLEN_SHIFT)) & SPI_EXTCTL_EXTLEN_MASK)

/*!
 * @}
 */ /* end of group SPI_Register_Masks */
/******************************************************************************
 * SPI Instance
 ******************************************************************************/

#define SPI1                ((SPI_Type*)SPI1_BASE)

/*!
 * @}
 */ /* end of group SPI_Peripheral_Access_Layer */

/*!
 * @addtogroup TIM1_Peripheral_Access_Layer TIM1 Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * TIM1 Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                            ///< control register 1                           offset: 0x00
    __IO uint32_t CR2;                                                            ///< control register 2                           offset: 0x04
    __IO uint32_t SMCR;                                                           ///< slave mode control register 1                offset: 0x08
    __IO uint32_t DIER;                                                           ///< DMA/Interrupt enable register                offset: 0x0C
    __IO uint32_t SR;                                                             ///< status register                              offset: 0x10
    __IO uint32_t EGR;                                                            ///< event generation register                    offset: 0x14
    __IO uint32_t CCMR1_OUTPUT;                                                   ///< compare mode register 1 (output mode)        offset: 0x18
    __IO uint32_t CCMR2_OUTPUT;                                                   ///< compare mode register 2(output mode)         offset: 0x1c
    __IO uint32_t CCER;                                                           ///< compare enable register                      offset: 0x20
    __IO uint32_t CNT;                                                            ///< counter                                      offset: 0x24
    __IO uint32_t PSC;                                                            ///< prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                            ///< auto-reload register                         offset: 0x2c
    __IO uint32_t RCR;                                                            ///< repetition counter register                  offset: 0x30
    __IO uint32_t CCR1;                                                           ///< compare register 1                           offset: 0x34
    __IO uint32_t CCR2;                                                           ///< compare register 2                           offset: 0x38
    __IO uint32_t CCR3;                                                           ///< compare register 3                           offset: 0x3c
    __IO uint32_t CCR4;                                                           ///< compare register 4                           offset: 0x40
    __IO uint32_t BDTR;                                                           ///< break and dead-time register                 offset: 0x44
    __IO uint32_t Reserved0[3];                                                   ///< Reserved
    __IO uint32_t CCMR3_OUTPUT;                                                   ///< compare mode register 3 (output mode)        offset: 0x54
    __IO uint32_t CCR5;                                                           ///< compare register 5                           offset: 0x58
    __IO uint32_t PDER;                                                           ///< PWM/DMA repeat enable register               offset: 0x5C
    __IO uint32_t CCR1FALL;                                                       ///< pwm shift count CCR1 register                offset: 0x60
    __IO uint32_t CCR2FALL;                                                       ///< pwm shift count CCR2 register                offset: 0x64
    __IO uint32_t CCR3FALL;                                                       ///< pwm shift count CCR3 register                offset: 0x68
    __IO uint32_t CCR4FALL;                                                       ///< pwm shift count CCR4 register                offset: 0x6C
    __IO uint32_t CCR5FALL;                                                       ///< pwm shift count CCR5 register                offset: 0x70
} TIM1_Type;

/*!
 * @addtogroup TIM1_Register_Masks Register Masks
 * @{ */

/*!
 * @brief TIM1_CR1 Register Bit Definition
 */

