UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define TIM1_CR1_CKD_SHIFT                              (8)
#define TIM1_CR1_CKD_MASK                               (0x03U << TIM1_CR1_CKD_SHIFT)
#define TIM1_CR1_CKD(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_CKD_SHIFT)) & TIM1_CR1_CKD_MASK)

#define TIM1_CR1_ARPE_SHIFT                             (7)
#define TIM1_CR1_ARPE_MASK                              (0x01U << TIM1_CR1_ARPE_SHIFT)
#define TIM1_CR1_ARPE(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_ARPE_SHIFT)) & TIM1_CR1_ARPE_MASK)

#define TIM1_CR1_CMS_SHIFT                              (5)
#define TIM1_CR1_CMS_MASK                               (0x03U << TIM1_CR1_CMS_SHIFT)
#define TIM1_CR1_CMS(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_CMS_SHIFT)) & TIM1_CR1_CMS_MASK)

#define TIM1_CR1_DIR_SHIFT                              (4)
#define TIM1_CR1_DIR_MASK                               (0x01U << TIM1_CR1_DIR_SHIFT)
#define TIM1_CR1_DIR(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_DIR_SHIFT)) & TIM1_CR1_DIR_MASK)

#define TIM1_CR1_OPM_SHIFT                              (3)
#define TIM1_CR1_OPM_MASK                               (0x01U << TIM1_CR1_OPM_SHIFT)
#define TIM1_CR1_OPM(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_OPM_SHIFT)) & TIM1_CR1_OPM_MASK)

#define TIM1_CR1_URS_SHIFT                              (2)
#define TIM1_CR1_URS_MASK                               (0x01U << TIM1_CR1_URS_SHIFT)
#define TIM1_CR1_URS(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_URS_SHIFT)) & TIM1_CR1_URS_MASK)

#define TIM1_CR1_UDIS_SHIFT                             (1)
#define TIM1_CR1_UDIS_MASK                              (0x01U << TIM1_CR1_UDIS_SHIFT)
#define TIM1_CR1_UDIS(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_UDIS_SHIFT)) & TIM1_CR1_UDIS_MASK)

#define TIM1_CR1_CEN_SHIFT                              (0)
#define TIM1_CR1_CEN_MASK                               (0x01U << TIM1_CR1_CEN_SHIFT)
#define TIM1_CR1_CEN(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_CEN_SHIFT)) & TIM1_CR1_CEN_MASK)

/*!
 * @brief TIM1_CR2 Register Bit Definition
 */

#define TIM1_CR2_OIS4_SHIFT                             (14)
#define TIM1_CR2_OIS4_MASK                              (0x01U << TIM1_CR2_OIS4_SHIFT)
#define TIM1_CR2_OIS4(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_CR2_OIS4_SHIFT)) & TIM1_CR2_OIS4_MASK)

#define TIM1_CR2_OIS3N_SHIFT                            (13)
#define TIM1_CR2_OIS3N_MASK                             (0x01U << TIM1_CR2_OIS3N_SHIFT)
#define TIM1_CR2_OIS3N(x)                               (((uint32_t)(((uint32_t)(x)) << TIM1_CR2_OIS3N_SHIFT)) & TIM1_CR2_OIS3N_MASK)

#define TIM1_CR2_OIS3_SHIFT                             (12)
#define TIM1_CR2_OIS3_MASK                              (0x01U << TIM1_CR2_OIS3_SHIFT)
#define TIM1_CR2_OIS3(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_CR2_OIS3_SHIFT)) & TIM1_CR2_OIS3_MASK)

#define TIM1_CR2_OIS2N_SHIFT                            (11)
#define TIM1_CR2_OIS2N_MASK                             (0x01U << TIM1_CR2_OIS2N_SHIFT)
#define TIM1_CR2_OIS2N(x)                               (((uint32_t)(((uint32_t)(x)) << TIM1_CR2_OIS2N_SHIFT)) & TIM1_CR2_OIS2N_MASK)

#define TIM1_CR2_OIS2_SHIFT                             (10)
#define TIM1_CR2_OIS2_MASK                              (0x01U << TIM1_CR2_OIS2_SHIFT)
#define TIM1_CR2_OIS2(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_CR2_OIS2_SHIFT)) & TIM1_CR2_OIS2_MASK)

#define TIM1_CR2_OIS1N_SHIFT                            (9)
#define TIM1_CR2_OIS1N_MASK                             (0x01U << TIM1_CR2_OIS1N_SHIFT)
#define TIM1_CR2_OIS1N(x)                               (((uint32_t)(((uint32_t)(x)) << TIM1_CR2_OIS1N_SHIFT)) & TIM1_CR2_OIS1N_MASK)

#define TIM1_CR2_OIS1_SHIFT                             (8)
#define TIM1_CR2_OIS1_MASK                              (0x01U << TIM1_CR2_OIS1_SHIFT)
#define TIM1_CR2_OIS1(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_CR2_OIS1_SHIFT)) & TIM1_CR2_OIS1_MASK)

#define TIM1_CR2_MMS_SHIFT                              (4)
#define TIM1_CR2_MMS_MASK                               (0x07U << TIM1_CR2_MMS_SHIFT)
#define TIM1_CR2_MMS(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM1_CR2_MMS_SHIFT)) & TIM1_CR2_MMS_MASK)

#define TIM1_CR2_CCUS_SHIFT                             (2)
#define TIM1_CR2_CCUS_MASK                              (0x01U << TIM1_CR2_CCUS_SHIFT)
#define TIM1_CR2_CCUS(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_CR2_CCUS_SHIFT)) & TIM1_CR2_CCUS_MASK)

#define TIM1_CR2_CCPC_SHIFT                             (0)
#define TIM1_CR2_CCPC_MASK                              (0x01U << TIM1_CR2_CCPC_SHIFT)
#define TIM1_CR2_CCPC(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_CR2_CCPC_SHIFT)) & TIM1_CR2_CCPC_MASK)

/*!
 * @brief TIM1_SMCR Register Bit Definition
 */

#define TIM1_SMCR_MSM_SHIFT                             (7)
#define TIM1_SMCR_MSM_MASK                              (0x01U << TIM1_SMCR_MSM_SHIFT)
#define TIM1_SMCR_MSM(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_SMCR_MSM_SHIFT)) & TIM1_SMCR_MSM_MASK)

#define TIM1_SMCR_TS_SHIFT                              (4)
#define TIM1_SMCR_TS_MASK                               (0x07U << TIM1_SMCR_TS_SHIFT)
#define TIM1_SMCR_TS(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM1_SMCR_TS_SHIFT)) & TIM1_SMCR_TS_MASK)

#define TIM1_SMCR_SMS_SHIFT                             (0)
#define TIM1_SMCR_SMS_MASK                              (0x07U << TIM1_SMCR_SMS_SHIFT)
#define TIM1_SMCR_SMS(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_SMCR_SMS_SHIFT)) & TIM1_SMCR_SMS_MASK)

/*!
 * @brief TIM1_DIER Register Bit Definition
 */

#define TIM1_DIER_CC5IE_SHIFT                           (16)
#define TIM1_DIER_CC5IE_MASK                            (0x01U << TIM1_DIER_CC5IE_SHIFT)
#define TIM1_DIER_CC5IE(x)                              (((uint32_t)(((uint32_t)(x)) << TIM1_DIER_CC5IE_SHIFT)) & TIM1_DIER_CC5IE_MASK)

