UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define TIM1_EGR_CC2G_SHIFT                             (2)
#define TIM1_EGR_CC2G_MASK                              (0x01U << TIM1_EGR_CC2G_SHIFT)
#define TIM1_EGR_CC2G(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_EGR_CC2G_SHIFT)) & TIM1_EGR_CC2G_MASK)

#define TIM1_EGR_CC1G_SHIFT                             (1)
#define TIM1_EGR_CC1G_MASK                              (0x01U << TIM1_EGR_CC1G_SHIFT)
#define TIM1_EGR_CC1G(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_EGR_CC1G_SHIFT)) & TIM1_EGR_CC1G_MASK)

#define TIM1_EGR_UG_SHIFT                               (0)
#define TIM1_EGR_UG_MASK                                (0x01U << TIM1_EGR_UG_SHIFT)
#define TIM1_EGR_UG(x)                                  (((uint32_t)(((uint32_t)(x)) << TIM1_EGR_UG_SHIFT)) & TIM1_EGR_UG_MASK)

/*!
 * @brief TIM1_CCMR1_OUTPUT Register Bit Definition
 */

#define TIM1_CCMR1_OUTPUT_OC2M_SHIFT                    (12)
#define TIM1_CCMR1_OUTPUT_OC2M_MASK                     (0x07U << TIM1_CCMR1_OUTPUT_OC2M_SHIFT)
#define TIM1_CCMR1_OUTPUT_OC2M(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR1_OUTPUT_OC2M_SHIFT)) & TIM1_CCMR1_OUTPUT_OC2M_MASK)

#define TIM1_CCMR1_OUTPUT_OC2PE_SHIFT                   (11)
#define TIM1_CCMR1_OUTPUT_OC2PE_MASK                    (0x01U << TIM1_CCMR1_OUTPUT_OC2PE_SHIFT)
#define TIM1_CCMR1_OUTPUT_OC2PE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR1_OUTPUT_OC2PE_SHIFT)) & TIM1_CCMR1_OUTPUT_OC2PE_MASK)

#define TIM1_CCMR1_OUTPUT_OC2FE_SHIFT                   (10)
#define TIM1_CCMR1_OUTPUT_OC2FE_MASK                    (0x01U << TIM1_CCMR1_OUTPUT_OC2FE_SHIFT)
#define TIM1_CCMR1_OUTPUT_OC2FE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR1_OUTPUT_OC2FE_SHIFT)) & TIM1_CCMR1_OUTPUT_OC2FE_MASK)

#define TIM1_CCMR1_OUTPUT_OC1M_SHIFT                    (4)
#define TIM1_CCMR1_OUTPUT_OC1M_MASK                     (0x07U << TIM1_CCMR1_OUTPUT_OC1M_SHIFT)
#define TIM1_CCMR1_OUTPUT_OC1M(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR1_OUTPUT_OC1M_SHIFT)) & TIM1_CCMR1_OUTPUT_OC1M_MASK)

#define TIM1_CCMR1_OUTPUT_OC1PE_SHIFT                   (3)
#define TIM1_CCMR1_OUTPUT_OC1PE_MASK                    (0x01U << TIM1_CCMR1_OUTPUT_OC1PE_SHIFT)
#define TIM1_CCMR1_OUTPUT_OC1PE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR1_OUTPUT_OC1PE_SHIFT)) & TIM1_CCMR1_OUTPUT_OC1PE_MASK)

#define TIM1_CCMR1_OUTPUT_OC1FE_SHIFT                   (2)
#define TIM1_CCMR1_OUTPUT_OC1FE_MASK                    (0x01U << TIM1_CCMR1_OUTPUT_OC1FE_SHIFT)
#define TIM1_CCMR1_OUTPUT_OC1FE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR1_OUTPUT_OC1FE_SHIFT)) & TIM1_CCMR1_OUTPUT_OC1FE_MASK)

/*!
 * @brief TIM1_CCMR2_OUTPUT Register Bit Definition
 */

#define TIM1_CCMR2_OUTPUT_OC4CE_SHIFT                   (15)
#define TIM1_CCMR2_OUTPUT_OC4CE_MASK                    (0x01U << TIM1_CCMR2_OUTPUT_OC4CE_SHIFT)
#define TIM1_CCMR2_OUTPUT_OC4CE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR2_OUTPUT_OC4CE_SHIFT)) & TIM1_CCMR2_OUTPUT_OC4CE_MASK)

#define TIM1_CCMR2_OUTPUT_OC4M_SHIFT                    (12)
#define TIM1_CCMR2_OUTPUT_OC4M_MASK                     (0x07U << TIM1_CCMR2_OUTPUT_OC4M_SHIFT)
#define TIM1_CCMR2_OUTPUT_OC4M(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR2_OUTPUT_OC4M_SHIFT)) & TIM1_CCMR2_OUTPUT_OC4M_MASK)

#define TIM1_CCMR2_OUTPUT_OC4PE_SHIFT                   (11)
#define TIM1_CCMR2_OUTPUT_OC4PE_MASK                    (0x01U << TIM1_CCMR2_OUTPUT_OC4PE_SHIFT)
#define TIM1_CCMR2_OUTPUT_OC4PE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR2_OUTPUT_OC4PE_SHIFT)) & TIM1_CCMR2_OUTPUT_OC4PE_MASK)

#define TIM1_CCMR2_OUTPUT_OC4FE_SHIFT                   (10)
#define TIM1_CCMR2_OUTPUT_OC4FE_MASK                    (0x01U << TIM1_CCMR2_OUTPUT_OC4FE_SHIFT)
#define TIM1_CCMR2_OUTPUT_OC4FE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR2_OUTPUT_OC4FE_SHIFT)) & TIM1_CCMR2_OUTPUT_OC4FE_MASK)

#define TIM1_CCMR2_OUTPUT_OC3CE_SHIFT                   (7)
#define TIM1_CCMR2_OUTPUT_OC3CE_MASK                    (0x01U << TIM1_CCMR2_OUTPUT_OC3CE_SHIFT)
#define TIM1_CCMR2_OUTPUT_OC3CE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR2_OUTPUT_OC3CE_SHIFT)) & TIM1_CCMR2_OUTPUT_OC3CE_MASK)

#define TIM1_CCMR2_OUTPUT_OC3M_SHIFT                    (4)
#define TIM1_CCMR2_OUTPUT_OC3M_MASK                     (0x07U << TIM1_CCMR2_OUTPUT_OC3M_SHIFT)
#define TIM1_CCMR2_OUTPUT_OC3M(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR2_OUTPUT_OC3M_SHIFT)) & TIM1_CCMR2_OUTPUT_OC3M_MASK)

#define TIM1_CCMR2_OUTPUT_OC3PE_SHIFT                   (3)
#define TIM1_CCMR2_OUTPUT_OC3PE_MASK                    (0x01U << TIM1_CCMR2_OUTPUT_OC3PE_SHIFT)
#define TIM1_CCMR2_OUTPUT_OC3PE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR2_OUTPUT_OC3PE_SHIFT)) & TIM1_CCMR2_OUTPUT_OC3PE_MASK)

#define TIM1_CCMR2_OUTPUT_OC3FE_SHIFT                   (2)
#define TIM1_CCMR2_OUTPUT_OC3FE_MASK                    (0x01U << TIM1_CCMR2_OUTPUT_OC3FE_SHIFT)
#define TIM1_CCMR2_OUTPUT_OC3FE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR2_OUTPUT_OC3FE_SHIFT)) & TIM1_CCMR2_OUTPUT_OC3FE_MASK)

/*!
 * @brief TIM1_CCER Register Bit Definition
 */

#define TIM1_CCER_CC4NP_SHIFT                           (15)
#define TIM1_CCER_CC4NP_MASK                            (0x01U << TIM1_CCER_CC4NP_SHIFT)
#define TIM1_CCER_CC4NP(x)                              (((uint32_t)(((uint32_t)(x)) << TIM1_CCER_CC4NP_SHIFT)) & TIM1_CCER_CC4NP_MASK)

#define TIM1_CCER_CC4P_SHIFT                            (13)
#define TIM1_CCER_CC4P_MASK                             (0x01U << TIM1_CCER_CC4P_SHIFT)
#define TIM1_CCER_CC4P(x)                               (((uint32_t)(((uint32_t)(x)) << TIM1_CCER_CC4P_SHIFT)) & TIM1_CCER_CC4P_MASK)

#define TIM1_CCER_CC4E_SHIFT                            (12)
#define TIM1_CCER_CC4E_MASK                             (0x01U << TIM1_CCER_CC4E_SHIFT)
#define TIM1_CCER_CC4E(x)                               (((uint32_t)(((uint32_t)(x)) << TIM1_CCER_CC4E_SHIFT)) & TIM1_CCER_CC4E_MASK)

#define TIM1_CCER_CC3NP_SHIFT                           (11)
#define TIM1_CCER_CC3NP_MASK                            (0x01U << TIM1_CCER_CC3NP_SHIFT)
#define TIM1_CCER_CC3NP(x)                              (((uint32_t)(((uint32_t)(x)) << TIM1_CCER_CC3NP_SHIFT)) & TIM1_CCER_CC3NP_MASK)

#define TIM1_CCER_CC3NE_SHIFT                           (10)
#define TIM1_CCER_CC3NE_MASK                            (0x01U << TIM1_CCER_CC3NE_SHIFT)
#define TIM1_CCER_CC3NE(x)                              (((uint32_t)(((uint32_t)(x)) << TIM1_CCER_CC3NE_SHIFT)) & TIM1_CCER_CC3NE_MASK)

#define TIM1_CCER_CC3P_SHIFT                            (9)
#define TIM1_CCER_CC3P_MASK                             (0x01U << TIM1_CCER_CC3P_SHIFT)
#define TIM1_CCER_CC3P(x)                               (((uint32_t)(((uint32_t)(x)) << TIM1_CCER_CC3P_SHIFT)) & TIM1_CCER_CC3P_MASK)

