UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define TIM1_BDTR_BKE_SHIFT                             (12)
#define TIM1_BDTR_BKE_MASK                              (0x01U << TIM1_BDTR_BKE_SHIFT)
#define TIM1_BDTR_BKE(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_BDTR_BKE_SHIFT)) & TIM1_BDTR_BKE_MASK)

#define TIM1_BDTR_OSSR_SHIFT                            (11)
#define TIM1_BDTR_OSSR_MASK                             (0x01U << TIM1_BDTR_OSSR_SHIFT)
#define TIM1_BDTR_OSSR(x)                               (((uint32_t)(((uint32_t)(x)) << TIM1_BDTR_OSSR_SHIFT)) & TIM1_BDTR_OSSR_MASK)

#define TIM1_BDTR_OSSI_SHIFT                            (10)
#define TIM1_BDTR_OSSI_MASK                             (0x01U << TIM1_BDTR_OSSI_SHIFT)
#define TIM1_BDTR_OSSI(x)                               (((uint32_t)(((uint32_t)(x)) << TIM1_BDTR_OSSI_SHIFT)) & TIM1_BDTR_OSSI_MASK)

#define TIM1_BDTR_LOCK_SHIFT                            (8)
#define TIM1_BDTR_LOCK_MASK                             (0x03U << TIM1_BDTR_LOCK_SHIFT)
#define TIM1_BDTR_LOCK(x)                               (((uint32_t)(((uint32_t)(x)) << TIM1_BDTR_LOCK_SHIFT)) & TIM1_BDTR_LOCK_MASK)

#define TIM1_BDTR_DTG_SHIFT                             (0)
#define TIM1_BDTR_DTG_MASK                              (0xFFU << TIM1_BDTR_DTG_SHIFT)
#define TIM1_BDTR_DTG(x)                                (((uint32_t)(((uint32_t)(x)) << TIM1_BDTR_DTG_SHIFT)) & TIM1_BDTR_DTG_MASK)

/*!
 * @brief TIM1_CCMR3_OUTPUT Register Bit Definition
 */

#define TIM1_CCMR3_OUTPUT_OC5M_SHIFT                    (4)
#define TIM1_CCMR3_OUTPUT_OC5M_MASK                     (0x07U << TIM1_CCMR3_OUTPUT_OC5M_SHIFT)
#define TIM1_CCMR3_OUTPUT_OC5M(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR3_OUTPUT_OC5M_SHIFT)) & TIM1_CCMR3_OUTPUT_OC5M_MASK)

#define TIM1_CCMR3_OUTPUT_OC5PE_SHIFT                   (3)
#define TIM1_CCMR3_OUTPUT_OC5PE_MASK                    (0x01U << TIM1_CCMR3_OUTPUT_OC5PE_SHIFT)
#define TIM1_CCMR3_OUTPUT_OC5PE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR3_OUTPUT_OC5PE_SHIFT)) & TIM1_CCMR3_OUTPUT_OC5PE_MASK)

#define TIM1_CCMR3_OUTPUT_OC5FE_SHIFT                   (2)
#define TIM1_CCMR3_OUTPUT_OC5FE_MASK                    (0x01U << TIM1_CCMR3_OUTPUT_OC5FE_SHIFT)
#define TIM1_CCMR3_OUTPUT_OC5FE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR3_OUTPUT_OC5FE_SHIFT)) & TIM1_CCMR3_OUTPUT_OC5FE_MASK)

/*!
 * @brief TIM1_CCR5 Register Bit Definition
 */

#define TIM1_CCR5_CCR5_SHIFT                            (0)
#define TIM1_CCR5_CCR5_MASK                             (0xFFFFU << TIM1_CCR5_CCR5_SHIFT)
#define TIM1_CCR5_CCR5(x)                               (((uint32_t)(((uint32_t)(x)) << TIM1_CCR5_CCR5_SHIFT)) & TIM1_CCR5_CCR5_MASK)

/*!
 * @brief TIM1_PDER Register Bit Definition
 */

#define TIM1_PDER_CCR5SHIFTEN_SHIFT                     (5)
#define TIM1_PDER_CCR5SHIFTEN_MASK                      (0x01U << TIM1_PDER_CCR5SHIFTEN_SHIFT)
#define TIM1_PDER_CCR5SHIFTEN(x)                        (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR5SHIFTEN_SHIFT)) & TIM1_PDER_CCR5SHIFTEN_MASK)

#define TIM1_PDER_CCR4SHIFTEN_SHIFT                     (4)
#define TIM1_PDER_CCR4SHIFTEN_MASK                      (0x01U << TIM1_PDER_CCR4SHIFTEN_SHIFT)
#define TIM1_PDER_CCR4SHIFTEN(x)                        (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR4SHIFTEN_SHIFT)) & TIM1_PDER_CCR4SHIFTEN_MASK)

#define TIM1_PDER_CCR3SHIFTEN_SHIFT                     (3)
#define TIM1_PDER_CCR3SHIFTEN_MASK                      (0x01U << TIM1_PDER_CCR3SHIFTEN_SHIFT)
#define TIM1_PDER_CCR3SHIFTEN(x)                        (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR3SHIFTEN_SHIFT)) & TIM1_PDER_CCR3SHIFTEN_MASK)

#define TIM1_PDER_CCR2SHIFTEN_SHIFT                     (2)
#define TIM1_PDER_CCR2SHIFTEN_MASK                      (0x01U << TIM1_PDER_CCR2SHIFTEN_SHIFT)
#define TIM1_PDER_CCR2SHIFTEN(x)                        (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR2SHIFTEN_SHIFT)) & TIM1_PDER_CCR2SHIFTEN_MASK)

#define TIM1_PDER_CCR1SHIFTEN_SHIFT                     (1)
#define TIM1_PDER_CCR1SHIFTEN_MASK                      (0x01U << TIM1_PDER_CCR1SHIFTEN_SHIFT)
#define TIM1_PDER_CCR1SHIFTEN(x)                        (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR1SHIFTEN_SHIFT)) & TIM1_PDER_CCR1SHIFTEN_MASK)

/*!
 * @brief TIM1_CCR1FALL Register Bit Definition
 */

#define TIM1_CCR1FALL_CCR1FALL_SHIFT                    (0)
#define TIM1_CCR1FALL_CCR1FALL_MASK                     (0xFFFFU << TIM1_CCR1FALL_CCR1FALL_SHIFT)
#define TIM1_CCR1FALL_CCR1FALL(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCR1FALL_CCR1FALL_SHIFT)) & TIM1_CCR1FALL_CCR1FALL_MASK)

/*!
 * @brief TIM1_CCR2FALL Register Bit Definition
 */

#define TIM1_CCR2FALL_CCR2FALL_SHIFT                    (0)
#define TIM1_CCR2FALL_CCR2FALL_MASK                     (0xFFFFU << TIM1_CCR2FALL_CCR2FALL_SHIFT)
#define TIM1_CCR2FALL_CCR2FALL(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCR2FALL_CCR2FALL_SHIFT)) & TIM1_CCR2FALL_CCR2FALL_MASK)

/*!
 * @brief TIM1_CCR3FALL Register Bit Definition
 */

#define TIM1_CCR3FALL_CCR3FALL_SHIFT                    (0)
#define TIM1_CCR3FALL_CCR3FALL_MASK                     (0xFFFFU << TIM1_CCR3FALL_CCR3FALL_SHIFT)
#define TIM1_CCR3FALL_CCR3FALL(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCR3FALL_CCR3FALL_SHIFT)) & TIM1_CCR3FALL_CCR3FALL_MASK)

/*!
 * @brief TIM1_CCR4FALL Register Bit Definition
 */

#define TIM1_CCR4FALL_CCR4FALL_SHIFT                    (0)
#define TIM1_CCR4FALL_CCR4FALL_MASK                     (0xFFFFU << TIM1_CCR4FALL_CCR4FALL_SHIFT)
#define TIM1_CCR4FALL_CCR4FALL(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCR4FALL_CCR4FALL_SHIFT)) & TIM1_CCR4FALL_CCR4FALL_MASK)

/*!
 * @brief TIM1_CCR5FALL Register Bit Definition
 */

#define TIM1_CCR5FALL_CCR5FALL_SHIFT                    (0)
#define TIM1_CCR5FALL_CCR5FALL_MASK                     (0xFFFFU << TIM1_CCR5FALL_CCR5FALL_SHIFT)
#define TIM1_CCR5FALL_CCR5FALL(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCR5FALL_CCR5FALL_SHIFT)) & TIM1_CCR5FALL_CCR5FALL_MASK)

/*!
 * @}
 */ /* end of group TIM1_Register_Masks */
/******************************************************************************
 * TIM1 Instance
 ******************************************************************************/

#define TIM1                ((TIM1_Type*)TIM1_BASE)

/*!
 * @}
 */ /* end of group TIM1_Peripheral_Access_Layer */

/*!
 * @addtogroup TIM3_Peripheral_Access_Layer TIM3 Peripheral Access Layer
 *  @{
 */

