UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
/*******************************************************************************
 * TIM3 Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                            ///< control register 1                           offset: 0x00
    __IO uint32_t CR2;                                                            ///< control register 2                           offset: 0x04
    __IO uint32_t SMCR;                                                           ///< slave mode control register 1                offset: 0x08
    __IO uint32_t DIER;                                                           ///< DMA/Interrupt enable register                offset: 0x0C
    __IO uint32_t SR;                                                             ///< status register                              offset: 0x10
    __IO uint32_t EGR;                                                            ///< event generation register                    offset: 0x14
    __IO uint32_t CCMR1;                                                          ///< compare mode register 1 (output/input mode)  offset: 0x18
    __IO uint32_t CCMR2;                                                          ///< compare mode register 2 (output/input mode)  offset: 0x1c
    __IO uint32_t CCER;                                                           ///< compare enable register                      offset: 0x20
    __IO uint32_t CNT;                                                            ///< counter                                      offset: 0x24
    __IO uint32_t PSC;                                                            ///< prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                            ///< auto-reload register                         offset: 0x2C
    __IO uint32_t Reserved0[1];                                                   ///< Reserved
    __IO uint32_t CCR1;                                                           ///< compare register 1                           offset: 0x34
    __IO uint32_t CCR2;                                                           ///< compare register 2                           offset: 0x38
    __IO uint32_t CCR3;                                                           ///< compare register 3                           offset: 0x3C
    __IO uint32_t CCR4;                                                           ///< compare register 4                           offset: 0x40
    __IO uint32_t Reserved1[3];                                                   ///< Reserved
    __IO uint32_t OR;                                                             ///< option register                              offset: 0x50
} TIM3_Type;

/*!
 * @addtogroup TIM3_Register_Masks Register Masks
 * @{ */

/*!
 * @brief TIM3_CR1 Register Bit Definition
 */

#define TIM3_CR1_CKD_SHIFT                              (8)
#define TIM3_CR1_CKD_MASK                               (0x03U << TIM3_CR1_CKD_SHIFT)
#define TIM3_CR1_CKD(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_CR1_CKD_SHIFT)) & TIM3_CR1_CKD_MASK)

#define TIM3_CR1_ARPE_SHIFT                             (7)
#define TIM3_CR1_ARPE_MASK                              (0x01U << TIM3_CR1_ARPE_SHIFT)
#define TIM3_CR1_ARPE(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_CR1_ARPE_SHIFT)) & TIM3_CR1_ARPE_MASK)

#define TIM3_CR1_CMS_SHIFT                              (5)
#define TIM3_CR1_CMS_MASK                               (0x03U << TIM3_CR1_CMS_SHIFT)
#define TIM3_CR1_CMS(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_CR1_CMS_SHIFT)) & TIM3_CR1_CMS_MASK)

#define TIM3_CR1_DIR_SHIFT                              (4)
#define TIM3_CR1_DIR_MASK                               (0x01U << TIM3_CR1_DIR_SHIFT)
#define TIM3_CR1_DIR(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_CR1_DIR_SHIFT)) & TIM3_CR1_DIR_MASK)

#define TIM3_CR1_OPM_SHIFT                              (3)
#define TIM3_CR1_OPM_MASK                               (0x01U << TIM3_CR1_OPM_SHIFT)
#define TIM3_CR1_OPM(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_CR1_OPM_SHIFT)) & TIM3_CR1_OPM_MASK)

#define TIM3_CR1_URS_SHIFT                              (2)
#define TIM3_CR1_URS_MASK                               (0x01U << TIM3_CR1_URS_SHIFT)
#define TIM3_CR1_URS(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_CR1_URS_SHIFT)) & TIM3_CR1_URS_MASK)

#define TIM3_CR1_UDIS_SHIFT                             (1)
#define TIM3_CR1_UDIS_MASK                              (0x01U << TIM3_CR1_UDIS_SHIFT)
#define TIM3_CR1_UDIS(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_CR1_UDIS_SHIFT)) & TIM3_CR1_UDIS_MASK)

#define TIM3_CR1_CEN_SHIFT                              (0)
#define TIM3_CR1_CEN_MASK                               (0x01U << TIM3_CR1_CEN_SHIFT)
#define TIM3_CR1_CEN(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_CR1_CEN_SHIFT)) & TIM3_CR1_CEN_MASK)

/*!
 * @brief TIM3_CR2 Register Bit Definition
 */

#define TIM3_CR2_TI1S_SHIFT                             (7)
#define TIM3_CR2_TI1S_MASK                              (0x01U << TIM3_CR2_TI1S_SHIFT)
#define TIM3_CR2_TI1S(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_CR2_TI1S_SHIFT)) & TIM3_CR2_TI1S_MASK)

#define TIM3_CR2_MMS_SHIFT                              (4)
#define TIM3_CR2_MMS_MASK                               (0x07U << TIM3_CR2_MMS_SHIFT)
#define TIM3_CR2_MMS(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_CR2_MMS_SHIFT)) & TIM3_CR2_MMS_MASK)

#define TIM3_CR2_CCDS_SHIFT                             (3)
#define TIM3_CR2_CCDS_MASK                              (0x01U << TIM3_CR2_CCDS_SHIFT)
#define TIM3_CR2_CCDS(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_CR2_CCDS_SHIFT)) & TIM3_CR2_CCDS_MASK)

/*!
 * @brief TIM3_SMCR Register Bit Definition
 */

#define TIM3_SMCR_MSM_SHIFT                             (7)
#define TIM3_SMCR_MSM_MASK                              (0x01U << TIM3_SMCR_MSM_SHIFT)
#define TIM3_SMCR_MSM(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_SMCR_MSM_SHIFT)) & TIM3_SMCR_MSM_MASK)

#define TIM3_SMCR_TS_SHIFT                              (4)
#define TIM3_SMCR_TS_MASK                               (0x07U << TIM3_SMCR_TS_SHIFT)
#define TIM3_SMCR_TS(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_SMCR_TS_SHIFT)) & TIM3_SMCR_TS_MASK)

#define TIM3_SMCR_SMS_SHIFT                             (0)
#define TIM3_SMCR_SMS_MASK                              (0x07U << TIM3_SMCR_SMS_SHIFT)
#define TIM3_SMCR_SMS(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_SMCR_SMS_SHIFT)) & TIM3_SMCR_SMS_MASK)

/*!
 * @brief TIM3_DIER Register Bit Definition
 */

