UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define TIM3_DIER_TIE_SHIFT                             (6)
#define TIM3_DIER_TIE_MASK                              (0x01U << TIM3_DIER_TIE_SHIFT)
#define TIM3_DIER_TIE(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_DIER_TIE_SHIFT)) & TIM3_DIER_TIE_MASK)

#define TIM3_DIER_CC4IE_SHIFT                           (4)
#define TIM3_DIER_CC4IE_MASK                            (0x01U << TIM3_DIER_CC4IE_SHIFT)
#define TIM3_DIER_CC4IE(x)                              (((uint32_t)(((uint32_t)(x)) << TIM3_DIER_CC4IE_SHIFT)) & TIM3_DIER_CC4IE_MASK)

#define TIM3_DIER_CC3IE_SHIFT                           (3)
#define TIM3_DIER_CC3IE_MASK                            (0x01U << TIM3_DIER_CC3IE_SHIFT)
#define TIM3_DIER_CC3IE(x)                              (((uint32_t)(((uint32_t)(x)) << TIM3_DIER_CC3IE_SHIFT)) & TIM3_DIER_CC3IE_MASK)

#define TIM3_DIER_CC2IE_SHIFT                           (2)
#define TIM3_DIER_CC2IE_MASK                            (0x01U << TIM3_DIER_CC2IE_SHIFT)
#define TIM3_DIER_CC2IE(x)                              (((uint32_t)(((uint32_t)(x)) << TIM3_DIER_CC2IE_SHIFT)) & TIM3_DIER_CC2IE_MASK)

#define TIM3_DIER_CC1IE_SHIFT                           (1)
#define TIM3_DIER_CC1IE_MASK                            (0x01U << TIM3_DIER_CC1IE_SHIFT)
#define TIM3_DIER_CC1IE(x)                              (((uint32_t)(((uint32_t)(x)) << TIM3_DIER_CC1IE_SHIFT)) & TIM3_DIER_CC1IE_MASK)

#define TIM3_DIER_UIE_SHIFT                             (0)
#define TIM3_DIER_UIE_MASK                              (0x01U << TIM3_DIER_UIE_SHIFT)
#define TIM3_DIER_UIE(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_DIER_UIE_SHIFT)) & TIM3_DIER_UIE_MASK)

/*!
 * @brief TIM3_SR Register Bit Definition
 */

#define TIM3_SR_CC3OF_SHIFT                             (11)
#define TIM3_SR_CC3OF_MASK                              (0x01U << TIM3_SR_CC3OF_SHIFT)
#define TIM3_SR_CC3OF(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_SR_CC3OF_SHIFT)) & TIM3_SR_CC3OF_MASK)

#define TIM3_SR_CC2OF_SHIFT                             (10)
#define TIM3_SR_CC2OF_MASK                              (0x01U << TIM3_SR_CC2OF_SHIFT)
#define TIM3_SR_CC2OF(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_SR_CC2OF_SHIFT)) & TIM3_SR_CC2OF_MASK)

#define TIM3_SR_CC1OF_SHIFT                             (9)
#define TIM3_SR_CC1OF_MASK                              (0x01U << TIM3_SR_CC1OF_SHIFT)
#define TIM3_SR_CC1OF(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_SR_CC1OF_SHIFT)) & TIM3_SR_CC1OF_MASK)

#define TIM3_SR_TIF_SHIFT                               (6)
#define TIM3_SR_TIF_MASK                                (0x01U << TIM3_SR_TIF_SHIFT)
#define TIM3_SR_TIF(x)                                  (((uint32_t)(((uint32_t)(x)) << TIM3_SR_TIF_SHIFT)) & TIM3_SR_TIF_MASK)

#define TIM3_SR_CC4IF_SHIFT                             (4)
#define TIM3_SR_CC4IF_MASK                              (0x01U << TIM3_SR_CC4IF_SHIFT)
#define TIM3_SR_CC4IF(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_SR_CC4IF_SHIFT)) & TIM3_SR_CC4IF_MASK)

#define TIM3_SR_CC3IF_SHIFT                             (3)
#define TIM3_SR_CC3IF_MASK                              (0x01U << TIM3_SR_CC3IF_SHIFT)
#define TIM3_SR_CC3IF(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_SR_CC3IF_SHIFT)) & TIM3_SR_CC3IF_MASK)

#define TIM3_SR_CC2IF_SHIFT                             (2)
#define TIM3_SR_CC2IF_MASK                              (0x01U << TIM3_SR_CC2IF_SHIFT)
#define TIM3_SR_CC2IF(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_SR_CC2IF_SHIFT)) & TIM3_SR_CC2IF_MASK)

#define TIM3_SR_CC1IF_SHIFT                             (1)
#define TIM3_SR_CC1IF_MASK                              (0x01U << TIM3_SR_CC1IF_SHIFT)
#define TIM3_SR_CC1IF(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_SR_CC1IF_SHIFT)) & TIM3_SR_CC1IF_MASK)

#define TIM3_SR_UIF_SHIFT                               (0)
#define TIM3_SR_UIF_MASK                                (0x01U << TIM3_SR_UIF_SHIFT)
#define TIM3_SR_UIF(x)                                  (((uint32_t)(((uint32_t)(x)) << TIM3_SR_UIF_SHIFT)) & TIM3_SR_UIF_MASK)

/*!
 * @brief TIM3_EGR Register Bit Definition
 */

#define TIM3_EGR_TG_SHIFT                               (6)
#define TIM3_EGR_TG_MASK                                (0x01U << TIM3_EGR_TG_SHIFT)
#define TIM3_EGR_TG(x)                                  (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_TG_SHIFT)) & TIM3_EGR_TG_MASK)

#define TIM3_EGR_CC4G_SHIFT                             (4)
#define TIM3_EGR_CC4G_MASK                              (0x01U << TIM3_EGR_CC4G_SHIFT)
#define TIM3_EGR_CC4G(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_CC4G_SHIFT)) & TIM3_EGR_CC4G_MASK)

#define TIM3_EGR_CC3G_SHIFT                             (3)
#define TIM3_EGR_CC3G_MASK                              (0x01U << TIM3_EGR_CC3G_SHIFT)
#define TIM3_EGR_CC3G(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_CC3G_SHIFT)) & TIM3_EGR_CC3G_MASK)

#define TIM3_EGR_CC2G_SHIFT                             (2)
#define TIM3_EGR_CC2G_MASK                              (0x01U << TIM3_EGR_CC2G_SHIFT)
#define TIM3_EGR_CC2G(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_CC2G_SHIFT)) & TIM3_EGR_CC2G_MASK)

#define TIM3_EGR_CC1G_SHIFT                             (1)
#define TIM3_EGR_CC1G_MASK                              (0x01U << TIM3_EGR_CC1G_SHIFT)
#define TIM3_EGR_CC1G(x)                                (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_CC1G_SHIFT)) & TIM3_EGR_CC1G_MASK)

#define TIM3_EGR_UG_SHIFT                               (0)
#define TIM3_EGR_UG_MASK                                (0x01U << TIM3_EGR_UG_SHIFT)
#define TIM3_EGR_UG(x)                                  (((uint32_t)(((uint32_t)(x)) << TIM3_EGR_UG_SHIFT)) & TIM3_EGR_UG_MASK)

/*!
 * @brief TIM3_CCMR1_OUTPUT Register Bit Definition
 */

#define TIM3_CCMR1_OUTPUT_OC2M_SHIFT                    (12)
#define TIM3_CCMR1_OUTPUT_OC2M_MASK                     (0x07U << TIM3_CCMR1_OUTPUT_OC2M_SHIFT)
#define TIM3_CCMR1_OUTPUT_OC2M(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_OUTPUT_OC2M_SHIFT)) & TIM3_CCMR1_OUTPUT_OC2M_MASK)

#define TIM3_CCMR1_OUTPUT_OC2PE_SHIFT                   (11)
#define TIM3_CCMR1_OUTPUT_OC2PE_MASK                    (0x01U << TIM3_CCMR1_OUTPUT_OC2PE_SHIFT)
#define TIM3_CCMR1_OUTPUT_OC2PE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_OUTPUT_OC2PE_SHIFT)) & TIM3_CCMR1_OUTPUT_OC2PE_MASK)

