UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define TIM3_CCMR1_OUTPUT_OC2FE_SHIFT                   (10)
#define TIM3_CCMR1_OUTPUT_OC2FE_MASK                    (0x01U << TIM3_CCMR1_OUTPUT_OC2FE_SHIFT)
#define TIM3_CCMR1_OUTPUT_OC2FE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_OUTPUT_OC2FE_SHIFT)) & TIM3_CCMR1_OUTPUT_OC2FE_MASK)

#define TIM3_CCMR1_OUTPUT_CC2S_SHIFT                    (8)
#define TIM3_CCMR1_OUTPUT_CC2S_MASK                     (0x03U << TIM3_CCMR1_OUTPUT_CC2S_SHIFT)
#define TIM3_CCMR1_OUTPUT_CC2S(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_OUTPUT_CC2S_SHIFT)) & TIM3_CCMR1_OUTPUT_CC2S_MASK)

#define TIM3_CCMR1_OUTPUT_OC1M_SHIFT                    (4)
#define TIM3_CCMR1_OUTPUT_OC1M_MASK                     (0x07U << TIM3_CCMR1_OUTPUT_OC1M_SHIFT)
#define TIM3_CCMR1_OUTPUT_OC1M(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_OUTPUT_OC1M_SHIFT)) & TIM3_CCMR1_OUTPUT_OC1M_MASK)

#define TIM3_CCMR1_OUTPUT_OC1PE_SHIFT                   (3)
#define TIM3_CCMR1_OUTPUT_OC1PE_MASK                    (0x01U << TIM3_CCMR1_OUTPUT_OC1PE_SHIFT)
#define TIM3_CCMR1_OUTPUT_OC1PE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_OUTPUT_OC1PE_SHIFT)) & TIM3_CCMR1_OUTPUT_OC1PE_MASK)

#define TIM3_CCMR1_OUTPUT_OC1FE_SHIFT                   (2)
#define TIM3_CCMR1_OUTPUT_OC1FE_MASK                    (0x01U << TIM3_CCMR1_OUTPUT_OC1FE_SHIFT)
#define TIM3_CCMR1_OUTPUT_OC1FE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_OUTPUT_OC1FE_SHIFT)) & TIM3_CCMR1_OUTPUT_OC1FE_MASK)

#define TIM3_CCMR1_OUTPUT_CC1S_SHIFT                    (0)
#define TIM3_CCMR1_OUTPUT_CC1S_MASK                     (0x03U << TIM3_CCMR1_OUTPUT_CC1S_SHIFT)
#define TIM3_CCMR1_OUTPUT_CC1S(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_OUTPUT_CC1S_SHIFT)) & TIM3_CCMR1_OUTPUT_CC1S_MASK)

/*!
 * @brief TIM3_CCMR1_INPUT Register Bit Definition
 */

#define TIM3_CCMR1_INPUT_IC2F_SHIFT                     (12)
#define TIM3_CCMR1_INPUT_IC2F_MASK                      (0x0FU << TIM3_CCMR1_INPUT_IC2F_SHIFT)
#define TIM3_CCMR1_INPUT_IC2F(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_INPUT_IC2F_SHIFT)) & TIM3_CCMR1_INPUT_IC2F_MASK)

#define TIM3_CCMR1_INPUT_IC2PSC_SHIFT                   (10)
#define TIM3_CCMR1_INPUT_IC2PSC_MASK                    (0x03U << TIM3_CCMR1_INPUT_IC2PSC_SHIFT)
#define TIM3_CCMR1_INPUT_IC2PSC(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_INPUT_IC2PSC_SHIFT)) & TIM3_CCMR1_INPUT_IC2PSC_MASK)

#define TIM3_CCMR1_INPUT_CC2S_SHIFT                     (8)
#define TIM3_CCMR1_INPUT_CC2S_MASK                      (0x03U << TIM3_CCMR1_INPUT_CC2S_SHIFT)
#define TIM3_CCMR1_INPUT_CC2S(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_INPUT_CC2S_SHIFT)) & TIM3_CCMR1_INPUT_CC2S_MASK)

#define TIM3_CCMR1_INPUT_IC1F_SHIFT                     (4)
#define TIM3_CCMR1_INPUT_IC1F_MASK                      (0x0FU << TIM3_CCMR1_INPUT_IC1F_SHIFT)
#define TIM3_CCMR1_INPUT_IC1F(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_INPUT_IC1F_SHIFT)) & TIM3_CCMR1_INPUT_IC1F_MASK)

#define TIM3_CCMR1_INPUT_IC1PSC_SHIFT                   (2)
#define TIM3_CCMR1_INPUT_IC1PSC_MASK                    (0x03U << TIM3_CCMR1_INPUT_IC1PSC_SHIFT)
#define TIM3_CCMR1_INPUT_IC1PSC(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_INPUT_IC1PSC_SHIFT)) & TIM3_CCMR1_INPUT_IC1PSC_MASK)

#define TIM3_CCMR1_INPUT_CC1S_SHIFT                     (0)
#define TIM3_CCMR1_INPUT_CC1S_MASK                      (0x03U << TIM3_CCMR1_INPUT_CC1S_SHIFT)
#define TIM3_CCMR1_INPUT_CC1S(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR1_INPUT_CC1S_SHIFT)) & TIM3_CCMR1_INPUT_CC1S_MASK)

/*!
 * @brief TIM3_CCMR2_OUTPUT Register Bit Definition
 */

#define TIM3_CCMR2_OUTPUT_OC4M_SHIFT                    (12)
#define TIM3_CCMR2_OUTPUT_OC4M_MASK                     (0x07U << TIM3_CCMR2_OUTPUT_OC4M_SHIFT)
#define TIM3_CCMR2_OUTPUT_OC4M(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_OUTPUT_OC4M_SHIFT)) & TIM3_CCMR2_OUTPUT_OC4M_MASK)

#define TIM3_CCMR2_OUTPUT_OC4PE_SHIFT                   (11)
#define TIM3_CCMR2_OUTPUT_OC4PE_MASK                    (0x01U << TIM3_CCMR2_OUTPUT_OC4PE_SHIFT)
#define TIM3_CCMR2_OUTPUT_OC4PE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_OUTPUT_OC4PE_SHIFT)) & TIM3_CCMR2_OUTPUT_OC4PE_MASK)

#define TIM3_CCMR2_OUTPUT_OC4FE_SHIFT                   (10)
#define TIM3_CCMR2_OUTPUT_OC4FE_MASK                    (0x01U << TIM3_CCMR2_OUTPUT_OC4FE_SHIFT)
#define TIM3_CCMR2_OUTPUT_OC4FE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_OUTPUT_OC4FE_SHIFT)) & TIM3_CCMR2_OUTPUT_OC4FE_MASK)

#define TIM3_CCMR2_OUTPUT_CC4S_SHIFT                    (8)
#define TIM3_CCMR2_OUTPUT_CC4S_MASK                     (0x03U << TIM3_CCMR2_OUTPUT_CC4S_SHIFT)
#define TIM3_CCMR2_OUTPUT_CC4S(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_OUTPUT_CC4S_SHIFT)) & TIM3_CCMR2_OUTPUT_CC4S_MASK)

#define TIM3_CCMR2_OUTPUT_OC3CE_SHIFT                   (7)
#define TIM3_CCMR2_OUTPUT_OC3CE_MASK                    (0x01U << TIM3_CCMR2_OUTPUT_OC3CE_SHIFT)
#define TIM3_CCMR2_OUTPUT_OC3CE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_OUTPUT_OC3CE_SHIFT)) & TIM3_CCMR2_OUTPUT_OC3CE_MASK)

#define TIM3_CCMR2_OUTPUT_OC3M_SHIFT                    (4)
#define TIM3_CCMR2_OUTPUT_OC3M_MASK                     (0x07U << TIM3_CCMR2_OUTPUT_OC3M_SHIFT)
#define TIM3_CCMR2_OUTPUT_OC3M(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_OUTPUT_OC3M_SHIFT)) & TIM3_CCMR2_OUTPUT_OC3M_MASK)

#define TIM3_CCMR2_OUTPUT_OC3PE_SHIFT                   (3)
#define TIM3_CCMR2_OUTPUT_OC3PE_MASK                    (0x01U << TIM3_CCMR2_OUTPUT_OC3PE_SHIFT)
#define TIM3_CCMR2_OUTPUT_OC3PE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_OUTPUT_OC3PE_SHIFT)) & TIM3_CCMR2_OUTPUT_OC3PE_MASK)

#define TIM3_CCMR2_OUTPUT_OC3FE_SHIFT                   (2)
#define TIM3_CCMR2_OUTPUT_OC3FE_MASK                    (0x01U << TIM3_CCMR2_OUTPUT_OC3FE_SHIFT)
#define TIM3_CCMR2_OUTPUT_OC3FE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_OUTPUT_OC3FE_SHIFT)) & TIM3_CCMR2_OUTPUT_OC3FE_MASK)

#define TIM3_CCMR2_OUTPUT_CC3S_SHIFT                    (0)
#define TIM3_CCMR2_OUTPUT_CC3S_MASK                     (0x03U << TIM3_CCMR2_OUTPUT_CC3S_SHIFT)
#define TIM3_CCMR2_OUTPUT_CC3S(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_OUTPUT_CC3S_SHIFT)) & TIM3_CCMR2_OUTPUT_CC3S_MASK)

/*!
 * @brief TIM3_CCMR2_INPUT Register Bit Definition
 */

