UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define TIM3_CCMR2_INPUT_CC4S_SHIFT                     (8)
#define TIM3_CCMR2_INPUT_CC4S_MASK                      (0x03U << TIM3_CCMR2_INPUT_CC4S_SHIFT)
#define TIM3_CCMR2_INPUT_CC4S(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_INPUT_CC4S_SHIFT)) & TIM3_CCMR2_INPUT_CC4S_MASK)

#define TIM3_CCMR2_INPUT_IC3F_SHIFT                     (4)
#define TIM3_CCMR2_INPUT_IC3F_MASK                      (0x0FU << TIM3_CCMR2_INPUT_IC3F_SHIFT)
#define TIM3_CCMR2_INPUT_IC3F(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_INPUT_IC3F_SHIFT)) & TIM3_CCMR2_INPUT_IC3F_MASK)

#define TIM3_CCMR2_INPUT_IC3PSC_SHIFT                   (2)
#define TIM3_CCMR2_INPUT_IC3PSC_MASK                    (0x03U << TIM3_CCMR2_INPUT_IC3PSC_SHIFT)
#define TIM3_CCMR2_INPUT_IC3PSC(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_INPUT_IC3PSC_SHIFT)) & TIM3_CCMR2_INPUT_IC3PSC_MASK)

#define TIM3_CCMR2_INPUT_CC3S_SHIFT                     (0)
#define TIM3_CCMR2_INPUT_CC3S_MASK                      (0x03U << TIM3_CCMR2_INPUT_CC3S_SHIFT)
#define TIM3_CCMR2_INPUT_CC3S(x)                        (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2_INPUT_CC3S_SHIFT)) & TIM3_CCMR2_INPUT_CC3S_MASK)

/*!
 * @brief TIM3_CCER Register Bit Definition
 */

#define TIM3_CCER_CC4NP_SHIFT                           (15)
#define TIM3_CCER_CC4NP_MASK                            (0x01U << TIM3_CCER_CC4NP_SHIFT)
#define TIM3_CCER_CC4NP(x)                              (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC4NP_SHIFT)) & TIM3_CCER_CC4NP_MASK)

#define TIM3_CCER_CC4P_SHIFT                            (13)
#define TIM3_CCER_CC4P_MASK                             (0x01U << TIM3_CCER_CC4P_SHIFT)
#define TIM3_CCER_CC4P(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC4P_SHIFT)) & TIM3_CCER_CC4P_MASK)

#define TIM3_CCER_CC4E_SHIFT                            (12)
#define TIM3_CCER_CC4E_MASK                             (0x01U << TIM3_CCER_CC4E_SHIFT)
#define TIM3_CCER_CC4E(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC4E_SHIFT)) & TIM3_CCER_CC4E_MASK)

#define TIM3_CCER_CC3NP_SHIFT                           (11)
#define TIM3_CCER_CC3NP_MASK                            (0x01U << TIM3_CCER_CC3NP_SHIFT)
#define TIM3_CCER_CC3NP(x)                              (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC3NP_SHIFT)) & TIM3_CCER_CC3NP_MASK)

#define TIM3_CCER_CC3P_SHIFT                            (9)
#define TIM3_CCER_CC3P_MASK                             (0x01U << TIM3_CCER_CC3P_SHIFT)
#define TIM3_CCER_CC3P(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC3P_SHIFT)) & TIM3_CCER_CC3P_MASK)

#define TIM3_CCER_CC3E_SHIFT                            (8)
#define TIM3_CCER_CC3E_MASK                             (0x01U << TIM3_CCER_CC3E_SHIFT)
#define TIM3_CCER_CC3E(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC3E_SHIFT)) & TIM3_CCER_CC3E_MASK)

#define TIM3_CCER_CC2NP_SHIFT                           (7)
#define TIM3_CCER_CC2NP_MASK                            (0x01U << TIM3_CCER_CC2NP_SHIFT)
#define TIM3_CCER_CC2NP(x)                              (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC2NP_SHIFT)) & TIM3_CCER_CC2NP_MASK)

#define TIM3_CCER_CC2P_SHIFT                            (5)
#define TIM3_CCER_CC2P_MASK                             (0x01U << TIM3_CCER_CC2P_SHIFT)
#define TIM3_CCER_CC2P(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC2P_SHIFT)) & TIM3_CCER_CC2P_MASK)

#define TIM3_CCER_CC2E_SHIFT                            (4)
#define TIM3_CCER_CC2E_MASK                             (0x01U << TIM3_CCER_CC2E_SHIFT)
#define TIM3_CCER_CC2E(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC2E_SHIFT)) & TIM3_CCER_CC2E_MASK)

#define TIM3_CCER_CC1NP_SHIFT                           (3)
#define TIM3_CCER_CC1NP_MASK                            (0x01U << TIM3_CCER_CC1NP_SHIFT)
#define TIM3_CCER_CC1NP(x)                              (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC1NP_SHIFT)) & TIM3_CCER_CC1NP_MASK)

#define TIM3_CCER_CC1P_SHIFT                            (1)
#define TIM3_CCER_CC1P_MASK                             (0x01U << TIM3_CCER_CC1P_SHIFT)
#define TIM3_CCER_CC1P(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC1P_SHIFT)) & TIM3_CCER_CC1P_MASK)

#define TIM3_CCER_CC1E_SHIFT                            (0)
#define TIM3_CCER_CC1E_MASK                             (0x01U << TIM3_CCER_CC1E_SHIFT)
#define TIM3_CCER_CC1E(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC1E_SHIFT)) & TIM3_CCER_CC1E_MASK)

/*!
 * @brief TIM3_CNT Register Bit Definition
 */

#define TIM3_CNT_CNT_SHIFT                              (0)
#define TIM3_CNT_CNT_MASK                               (0xFFFFU << TIM3_CNT_CNT_SHIFT)
#define TIM3_CNT_CNT(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_CNT_CNT_SHIFT)) & TIM3_CNT_CNT_MASK)

/*!
 * @brief TIM3_PSC Register Bit Definition
 */

#define TIM3_PSC_PSC_SHIFT                              (0)
#define TIM3_PSC_PSC_MASK                               (0xFFFFU << TIM3_PSC_PSC_SHIFT)
#define TIM3_PSC_PSC(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_PSC_PSC_SHIFT)) & TIM3_PSC_PSC_MASK)

/*!
 * @brief TIM3_ARR Register Bit Definition
 */

#define TIM3_ARR_ARR_SHIFT                              (0)
#define TIM3_ARR_ARR_MASK                               (0xFFFFU << TIM3_ARR_ARR_SHIFT)
#define TIM3_ARR_ARR(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM3_ARR_ARR_SHIFT)) & TIM3_ARR_ARR_MASK)

/*!
 * @brief TIM3_CCR1 Register Bit Definition
 */

#define TIM3_CCR1_CCR1_SHIFT                            (0)
#define TIM3_CCR1_CCR1_MASK                             (0xFFFFU << TIM3_CCR1_CCR1_SHIFT)
#define TIM3_CCR1_CCR1(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCR1_CCR1_SHIFT)) & TIM3_CCR1_CCR1_MASK)

/*!
 * @brief TIM3_CCR2 Register Bit Definition
 */

#define TIM3_CCR2_CCR2_SHIFT                            (0)
#define TIM3_CCR2_CCR2_MASK                             (0xFFFFU << TIM3_CCR2_CCR2_SHIFT)
#define TIM3_CCR2_CCR2(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCR2_CCR2_SHIFT)) & TIM3_CCR2_CCR2_MASK)

/*!
 * @brief TIM3_CCR3 Register Bit Definition
 */

#define TIM3_CCR3_CCR3_SHIFT                            (0)
#define TIM3_CCR3_CCR3_MASK                             (0xFFFFU << TIM3_CCR3_CCR3_SHIFT)
#define TIM3_CCR3_CCR3(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCR3_CCR3_SHIFT)) & TIM3_CCR3_CCR3_MASK)

/*!
 * @brief TIM3_CCR4 Register Bit Definition
 */

#define TIM3_CCR4_CCR4_SHIFT                            (0)
#define TIM3_CCR4_CCR4_MASK                             (0xFFFFU << TIM3_CCR4_CCR4_SHIFT)
#define TIM3_CCR4_CCR4(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_CCR4_CCR4_SHIFT)) & TIM3_CCR4_CCR4_MASK)

/*!
 * @brief TIM3_OR Register Bit Definition
 */

#define TIM3_OR_ETRRMP_SHIFT                            (0)
#define TIM3_OR_ETRRMP_MASK                             (0x03U << TIM3_OR_ETRRMP_SHIFT)
#define TIM3_OR_ETRRMP(x)                               (((uint32_t)(((uint32_t)(x)) << TIM3_OR_ETRRMP_SHIFT)) & TIM3_OR_ETRRMP_MASK)

/*!
 * @}
 */ /* end of group TIM3_Register_Masks */
/******************************************************************************
 * TIM3 Instance
 ******************************************************************************/

#define TIM3                ((TIM3_Type*)TIM3_BASE)

/*!
 * @}
 */ /* end of group TIM3_Peripheral_Access_Layer */

/*!
 * @addtogroup TIM14_Peripheral_Access_Layer TIM14 Peripheral Access Layer
 *  @{
 */

