UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
/*******************************************************************************
 * TIM14 Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                            ///< control register 1                           offset: 0x00
    __IO uint32_t Reserved0[2];                                                   ///< Reserved
    __IO uint32_t DIER;                                                           ///< DMA/Interrupt enable register                offset: 0x0C
    __IO uint32_t SR;                                                             ///< status register                              offset: 0x10
    __IO uint32_t EGR;                                                            ///< event generation register                    offset: 0x14
    __IO uint32_t CCMR1;                                                          ///< compare mode register 1 (output/input mode)  offset: 0x18
    __IO uint32_t Reserved1[1];                                                   ///< Reserved
    __IO uint32_t CCER;                                                           ///< compare enable register                      offset: 0x20
    __IO uint32_t CNT;                                                            ///< counter                                      offset: 0x24
    __IO uint32_t PSC;                                                            ///< prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                            ///< auto-reload register                         offset: 0x2c
    __IO uint32_t RCR;                                                            ///< repetition counter register                  offset: 0x30
    __IO uint32_t CCR1;                                                           ///< compare register 1                           offset: 0x34
    __IO uint32_t Reserved2[3];                                                   ///< Reserved
    __IO uint32_t BDTR;                                                           ///< Break and dead time register                 offset: 0x44
} TIM14_Type;

/*!
 * @addtogroup TIM14_Register_Masks Register Masks
 * @{ */

/*!
 * @brief TIM14_CR1 Register Bit Definition
 */

#define TIM14_CR1_CKD_SHIFT                             (8)
#define TIM14_CR1_CKD_MASK                              (0x03U << TIM14_CR1_CKD_SHIFT)
#define TIM14_CR1_CKD(x)                                (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_CKD_SHIFT)) & TIM14_CR1_CKD_MASK)

#define TIM14_CR1_ARPE_SHIFT                            (7)
#define TIM14_CR1_ARPE_MASK                             (0x01U << TIM14_CR1_ARPE_SHIFT)
#define TIM14_CR1_ARPE(x)                               (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_ARPE_SHIFT)) & TIM14_CR1_ARPE_MASK)

#define TIM14_CR1_URS_SHIFT                             (2)
#define TIM14_CR1_URS_MASK                              (0x01U << TIM14_CR1_URS_SHIFT)
#define TIM14_CR1_URS(x)                                (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_URS_SHIFT)) & TIM14_CR1_URS_MASK)

#define TIM14_CR1_UDIS_SHIFT                            (1)
#define TIM14_CR1_UDIS_MASK                             (0x01U << TIM14_CR1_UDIS_SHIFT)
#define TIM14_CR1_UDIS(x)                               (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_UDIS_SHIFT)) & TIM14_CR1_UDIS_MASK)

#define TIM14_CR1_CEN_SHIFT                             (0)
#define TIM14_CR1_CEN_MASK                              (0x01U << TIM14_CR1_CEN_SHIFT)
#define TIM14_CR1_CEN(x)                                (((uint32_t)(((uint32_t)(x)) << TIM14_CR1_CEN_SHIFT)) & TIM14_CR1_CEN_MASK)

/*!
 * @brief TIM14_DIER Register Bit Definition
 */

#define TIM14_DIER_CC1IE_SHIFT                          (1)
#define TIM14_DIER_CC1IE_MASK                           (0x01U << TIM14_DIER_CC1IE_SHIFT)
#define TIM14_DIER_CC1IE(x)                             (((uint32_t)(((uint32_t)(x)) << TIM14_DIER_CC1IE_SHIFT)) & TIM14_DIER_CC1IE_MASK)

#define TIM14_DIER_UIE_SHIFT                            (0)
#define TIM14_DIER_UIE_MASK                             (0x01U << TIM14_DIER_UIE_SHIFT)
#define TIM14_DIER_UIE(x)                               (((uint32_t)(((uint32_t)(x)) << TIM14_DIER_UIE_SHIFT)) & TIM14_DIER_UIE_MASK)

/*!
 * @brief TIM14_SR Register Bit Definition
 */

#define TIM14_SR_CC1OF_SHIFT                            (9)
#define TIM14_SR_CC1OF_MASK                             (0x01U << TIM14_SR_CC1OF_SHIFT)
#define TIM14_SR_CC1OF(x)                               (((uint32_t)(((uint32_t)(x)) << TIM14_SR_CC1OF_SHIFT)) & TIM14_SR_CC1OF_MASK)

#define TIM14_SR_CC1IF_SHIFT                            (1)
#define TIM14_SR_CC1IF_MASK                             (0x01U << TIM14_SR_CC1IF_SHIFT)
#define TIM14_SR_CC1IF(x)                               (((uint32_t)(((uint32_t)(x)) << TIM14_SR_CC1IF_SHIFT)) & TIM14_SR_CC1IF_MASK)

#define TIM14_SR_UIF_SHIFT                              (0)
#define TIM14_SR_UIF_MASK                               (0x01U << TIM14_SR_UIF_SHIFT)
#define TIM14_SR_UIF(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM14_SR_UIF_SHIFT)) & TIM14_SR_UIF_MASK)

/*!
 * @brief TIM14_EGR Register Bit Definition
 */

#define TIM14_EGR_CC1G_SHIFT                            (1)
#define TIM14_EGR_CC1G_MASK                             (0x01U << TIM14_EGR_CC1G_SHIFT)
#define TIM14_EGR_CC1G(x)                               (((uint32_t)(((uint32_t)(x)) << TIM14_EGR_CC1G_SHIFT)) & TIM14_EGR_CC1G_MASK)

#define TIM14_EGR_UG_SHIFT                              (0)
#define TIM14_EGR_UG_MASK                               (0x01U << TIM14_EGR_UG_SHIFT)
#define TIM14_EGR_UG(x)                                 (((uint32_t)(((uint32_t)(x)) << TIM14_EGR_UG_SHIFT)) & TIM14_EGR_UG_MASK)

/*!
 * @brief TIM14_CCMR1_OUTPUT Register Bit Definition
 */

#define TIM14_CCMR1_OUTPUT_OC1M_SHIFT                   (4)
#define TIM14_CCMR1_OUTPUT_OC1M_MASK                    (0x07U << TIM14_CCMR1_OUTPUT_OC1M_SHIFT)
#define TIM14_CCMR1_OUTPUT_OC1M(x)                      (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1_OUTPUT_OC1M_SHIFT)) & TIM14_CCMR1_OUTPUT_OC1M_MASK)

#define TIM14_CCMR1_OUTPUT_OC1PE_SHIFT                  (3)
#define TIM14_CCMR1_OUTPUT_OC1PE_MASK                   (0x01U << TIM14_CCMR1_OUTPUT_OC1PE_SHIFT)
#define TIM14_CCMR1_OUTPUT_OC1PE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1_OUTPUT_OC1PE_SHIFT)) & TIM14_CCMR1_OUTPUT_OC1PE_MASK)

#define TIM14_CCMR1_OUTPUT_OC1FE_SHIFT                  (2)
#define TIM14_CCMR1_OUTPUT_OC1FE_MASK                   (0x01U << TIM14_CCMR1_OUTPUT_OC1FE_SHIFT)
#define TIM14_CCMR1_OUTPUT_OC1FE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1_OUTPUT_OC1FE_SHIFT)) & TIM14_CCMR1_OUTPUT_OC1FE_MASK)

#define TIM14_CCMR1_OUTPUT_CC1S_SHIFT                   (0)
#define TIM14_CCMR1_OUTPUT_CC1S_MASK                    (0x03U << TIM14_CCMR1_OUTPUT_CC1S_SHIFT)
#define TIM14_CCMR1_OUTPUT_CC1S(x)                      (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1_OUTPUT_CC1S_SHIFT)) & TIM14_CCMR1_OUTPUT_CC1S_MASK)

/*!
 * @brief TIM14_CCMR1_INPUT Register Bit Definition
 */

