UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define TIM14_CCMR1_INPUT_IC1F_SHIFT                    (4)
#define TIM14_CCMR1_INPUT_IC1F_MASK                     (0x0FU << TIM14_CCMR1_INPUT_IC1F_SHIFT)
#define TIM14_CCMR1_INPUT_IC1F(x)                       (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1_INPUT_IC1F_SHIFT)) & TIM14_CCMR1_INPUT_IC1F_MASK)

#define TIM14_CCMR1_INPUT_IC1PSC_SHIFT                  (2)
#define TIM14_CCMR1_INPUT_IC1PSC_MASK                   (0x03U << TIM14_CCMR1_INPUT_IC1PSC_SHIFT)
#define TIM14_CCMR1_INPUT_IC1PSC(x)                     (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1_INPUT_IC1PSC_SHIFT)) & TIM14_CCMR1_INPUT_IC1PSC_MASK)

#define TIM14_CCMR1_INPUT_CC1S_SHIFT                    (0)
#define TIM14_CCMR1_INPUT_CC1S_MASK                     (0x03U << TIM14_CCMR1_INPUT_CC1S_SHIFT)
#define TIM14_CCMR1_INPUT_CC1S(x)                       (((uint32_t)(((uint32_t)(x)) << TIM14_CCMR1_INPUT_CC1S_SHIFT)) & TIM14_CCMR1_INPUT_CC1S_MASK)

/*!
 * @brief TIM14_CCER Register Bit Definition
 */

#define TIM14_CCER_CC1NP_SHIFT                          (3)
#define TIM14_CCER_CC1NP_MASK                           (0x01U << TIM14_CCER_CC1NP_SHIFT)
#define TIM14_CCER_CC1NP(x)                             (((uint32_t)(((uint32_t)(x)) << TIM14_CCER_CC1NP_SHIFT)) & TIM14_CCER_CC1NP_MASK)

#define TIM14_CCER_CC1P_SHIFT                           (1)
#define TIM14_CCER_CC1P_MASK                            (0x01U << TIM14_CCER_CC1P_SHIFT)
#define TIM14_CCER_CC1P(x)                              (((uint32_t)(((uint32_t)(x)) << TIM14_CCER_CC1P_SHIFT)) & TIM14_CCER_CC1P_MASK)

#define TIM14_CCER_CC1E_SHIFT                           (0)
#define TIM14_CCER_CC1E_MASK                            (0x01U << TIM14_CCER_CC1E_SHIFT)
#define TIM14_CCER_CC1E(x)                              (((uint32_t)(((uint32_t)(x)) << TIM14_CCER_CC1E_SHIFT)) & TIM14_CCER_CC1E_MASK)

/*!
 * @brief TIM14_CNT Register Bit Definition
 */

#define TIM14_CNT_CNT_SHIFT                             (0)
#define TIM14_CNT_CNT_MASK                              (0xFFFFU << TIM14_CNT_CNT_SHIFT)
#define TIM14_CNT_CNT(x)                                (((uint32_t)(((uint32_t)(x)) << TIM14_CNT_CNT_SHIFT)) & TIM14_CNT_CNT_MASK)

/*!
 * @brief TIM14_PSC Register Bit Definition
 */

#define TIM14_PSC_PSC_SHIFT                             (0)
#define TIM14_PSC_PSC_MASK                              (0xFFFFU << TIM14_PSC_PSC_SHIFT)
#define TIM14_PSC_PSC(x)                                (((uint32_t)(((uint32_t)(x)) << TIM14_PSC_PSC_SHIFT)) & TIM14_PSC_PSC_MASK)

/*!
 * @brief TIM14_ARR Register Bit Definition
 */

#define TIM14_ARR_ARR_SHIFT                             (0)
#define TIM14_ARR_ARR_MASK                              (0xFFFFU << TIM14_ARR_ARR_SHIFT)
#define TIM14_ARR_ARR(x)                                (((uint32_t)(((uint32_t)(x)) << TIM14_ARR_ARR_SHIFT)) & TIM14_ARR_ARR_MASK)

/*!
 * @brief TIM14_RCR Register Bit Definition
 */

#define TIM14_RCR_REP_SHIFT                             (0)
#define TIM14_RCR_REP_MASK                              (0xFFU << TIM14_RCR_REP_SHIFT)
#define TIM14_RCR_REP(x)                                (((uint32_t)(((uint32_t)(x)) << TIM14_RCR_REP_SHIFT)) & TIM14_RCR_REP_MASK)

/*!
 * @brief TIM14_CCR1 Register Bit Definition
 */

#define TIM14_CCR1_CCR1_SHIFT                           (0)
#define TIM14_CCR1_CCR1_MASK                            (0xFFFFU << TIM14_CCR1_CCR1_SHIFT)
#define TIM14_CCR1_CCR1(x)                              (((uint32_t)(((uint32_t)(x)) << TIM14_CCR1_CCR1_SHIFT)) & TIM14_CCR1_CCR1_MASK)

/*!
 * @brief TIM14_BDTR Register Bit Definition
 */

#define TIM14_BDTR_MOE_SHIFT                            (15)
#define TIM14_BDTR_MOE_MASK                             (0x01U << TIM14_BDTR_MOE_SHIFT)
#define TIM14_BDTR_MOE(x)                               (((uint32_t)(((uint32_t)(x)) << TIM14_BDTR_MOE_SHIFT)) & TIM14_BDTR_MOE_MASK)

/*!
 * @}
 */ /* end of group TIM14_Register_Masks */
/******************************************************************************
 * TIM14 Instance
 ******************************************************************************/

#define TIM14                ((TIM14_Type*)TIM14_BASE)

/*!
 * @}
 */ /* end of group TIM14_Peripheral_Access_Layer */

/*!
 * @addtogroup USART_Peripheral_Access_Layer USART Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * USART Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t SR;                                                             ///< Status register                              offset: 0x00
    __IO uint32_t DR;                                                             ///< Data register                                offset: 0x04
    __IO uint32_t BRR;                                                            ///< Baud rate register                           offset: 0x08
    __IO uint32_t CR1;                                                            ///< Control register 1                           offset: 0x0C
    __IO uint32_t CR2;                                                            ///< Control register 2                           offset: 0x10
    __IO uint32_t CR3;                                                            ///< Control register 3                           offset: 0x14
} USART_Type;

/*!
 * @addtogroup USART_Register_Masks Register Masks
 * @{ */

/*!
 * @brief USART_SR Register Bit Definition
 */

#define USART_SR_TXE_SHIFT                              (7)
#define USART_SR_TXE_MASK                               (0x01U << USART_SR_TXE_SHIFT)
#define USART_SR_TXE(x)                                 (((uint32_t)(((uint32_t)(x)) << USART_SR_TXE_SHIFT)) & USART_SR_TXE_MASK)

#define USART_SR_TC_SHIFT                               (6)
#define USART_SR_TC_MASK                                (0x01U << USART_SR_TC_SHIFT)
#define USART_SR_TC(x)                                  (((uint32_t)(((uint32_t)(x)) << USART_SR_TC_SHIFT)) & USART_SR_TC_MASK)

#define USART_SR_RXNE_SHIFT                             (5)
#define USART_SR_RXNE_MASK                              (0x01U << USART_SR_RXNE_SHIFT)
#define USART_SR_RXNE(x)                                (((uint32_t)(((uint32_t)(x)) << USART_SR_RXNE_SHIFT)) & USART_SR_RXNE_MASK)

#define USART_SR_IDLE_SHIFT                             (4)
#define USART_SR_IDLE_MASK                              (0x01U << USART_SR_IDLE_SHIFT)
#define USART_SR_IDLE(x)                                (((uint32_t)(((uint32_t)(x)) << USART_SR_IDLE_SHIFT)) & USART_SR_IDLE_MASK)

#define USART_SR_ORE_SHIFT                              (3)
#define USART_SR_ORE_MASK                               (0x01U << USART_SR_ORE_SHIFT)
#define USART_SR_ORE(x)                                 (((uint32_t)(((uint32_t)(x)) << USART_SR_ORE_SHIFT)) & USART_SR_ORE_MASK)

#define USART_SR_NF_SHIFT                               (2)
#define USART_SR_NF_MASK                                (0x01U << USART_SR_NF_SHIFT)
#define USART_SR_NF(x)                                  (((uint32_t)(((uint32_t)(x)) << USART_SR_NF_SHIFT)) & USART_SR_NF_MASK)

#define USART_SR_FE_SHIFT                               (1)
#define USART_SR_FE_MASK                                (0x01U << USART_SR_FE_SHIFT)
#define USART_SR_FE(x)                                  (((uint32_t)(((uint32_t)(x)) << USART_SR_FE_SHIFT)) & USART_SR_FE_MASK)

#define USART_SR_PE_SHIFT                               (0)
#define USART_SR_PE_MASK                                (0x01U << USART_SR_PE_SHIFT)
#define USART_SR_PE(x)                                  (((uint32_t)(((uint32_t)(x)) << USART_SR_PE_SHIFT)) & USART_SR_PE_MASK)

/*!
 * @brief USART_DR Register Bit Definition
 */

#define USART_DR_DR_SHIFT                               (0)
#define USART_DR_DR_MASK                                (0x1FFU << USART_DR_DR_SHIFT)
#define USART_DR_DR(x)                                  (((uint32_t)(((uint32_t)(x)) << USART_DR_DR_SHIFT)) & USART_DR_DR_MASK)

/*!
 * @brief USART_BRR Register Bit Definition
 */

