UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a.h
#define USART_BRR_MFD_SHIFT                             (4)
#define USART_BRR_MFD_MASK                              (0xFFFFU << USART_BRR_MFD_SHIFT)
#define USART_BRR_MFD(x)                                (((uint32_t)(((uint32_t)(x)) << USART_BRR_MFD_SHIFT)) & USART_BRR_MFD_MASK)

#define USART_BRR_FFD_SHIFT                             (0)
#define USART_BRR_FFD_MASK                              (0x0FU << USART_BRR_FFD_SHIFT)
#define USART_BRR_FFD(x)                                (((uint32_t)(((uint32_t)(x)) << USART_BRR_FFD_SHIFT)) & USART_BRR_FFD_MASK)

/*!
 * @brief USART_CR1 Register Bit Definition
 */

#define USART_CR1_SAS_SHIFT                             (17)
#define USART_CR1_SAS_MASK                              (0x01U << USART_CR1_SAS_SHIFT)
#define USART_CR1_SAS(x)                                (((uint32_t)(((uint32_t)(x)) << USART_CR1_SAS_SHIFT)) & USART_CR1_SAS_MASK)

#define USART_CR1_MLS_SHIFT                             (16)
#define USART_CR1_MLS_MASK                              (0x01U << USART_CR1_MLS_SHIFT)
#define USART_CR1_MLS(x)                                (((uint32_t)(((uint32_t)(x)) << USART_CR1_MLS_SHIFT)) & USART_CR1_MLS_MASK)

#define USART_CR1_OVER8_SHIFT                           (15)
#define USART_CR1_OVER8_MASK                            (0x01U << USART_CR1_OVER8_SHIFT)
#define USART_CR1_OVER8(x)                              (((uint32_t)(((uint32_t)(x)) << USART_CR1_OVER8_SHIFT)) & USART_CR1_OVER8_MASK)

#define USART_CR1_UE_SHIFT                              (13)
#define USART_CR1_UE_MASK                               (0x01U << USART_CR1_UE_SHIFT)
#define USART_CR1_UE(x)                                 (((uint32_t)(((uint32_t)(x)) << USART_CR1_UE_SHIFT)) & USART_CR1_UE_MASK)

#define USART_CR1_DL_SHIFT                              (12)
#define USART_CR1_DL_MASK                               (0x01U << USART_CR1_DL_SHIFT)
#define USART_CR1_DL(x)                                 (((uint32_t)(((uint32_t)(x)) << USART_CR1_DL_SHIFT)) & USART_CR1_DL_MASK)

#define USART_CR1_PCE_SHIFT                             (10)
#define USART_CR1_PCE_MASK                              (0x01U << USART_CR1_PCE_SHIFT)
#define USART_CR1_PCE(x)                                (((uint32_t)(((uint32_t)(x)) << USART_CR1_PCE_SHIFT)) & USART_CR1_PCE_MASK)

#define USART_CR1_PS_SHIFT                              (9)
#define USART_CR1_PS_MASK                               (0x01U << USART_CR1_PS_SHIFT)
#define USART_CR1_PS(x)                                 (((uint32_t)(((uint32_t)(x)) << USART_CR1_PS_SHIFT)) & USART_CR1_PS_MASK)

#define USART_CR1_PEIEN_SHIFT                           (8)
#define USART_CR1_PEIEN_MASK                            (0x01U << USART_CR1_PEIEN_SHIFT)
#define USART_CR1_PEIEN(x)                              (((uint32_t)(((uint32_t)(x)) << USART_CR1_PEIEN_SHIFT)) & USART_CR1_PEIEN_MASK)

#define USART_CR1_TXEIEN_SHIFT                          (7)
#define USART_CR1_TXEIEN_MASK                           (0x01U << USART_CR1_TXEIEN_SHIFT)
#define USART_CR1_TXEIEN(x)                             (((uint32_t)(((uint32_t)(x)) << USART_CR1_TXEIEN_SHIFT)) & USART_CR1_TXEIEN_MASK)

#define USART_CR1_TCIEN_SHIFT                           (6)
#define USART_CR1_TCIEN_MASK                            (0x01U << USART_CR1_TCIEN_SHIFT)
#define USART_CR1_TCIEN(x)                              (((uint32_t)(((uint32_t)(x)) << USART_CR1_TCIEN_SHIFT)) & USART_CR1_TCIEN_MASK)

#define USART_CR1_RXNEIEN_SHIFT                         (5)
#define USART_CR1_RXNEIEN_MASK                          (0x01U << USART_CR1_RXNEIEN_SHIFT)
#define USART_CR1_RXNEIEN(x)                            (((uint32_t)(((uint32_t)(x)) << USART_CR1_RXNEIEN_SHIFT)) & USART_CR1_RXNEIEN_MASK)

#define USART_CR1_IDLEIEN_SHIFT                         (4)
#define USART_CR1_IDLEIEN_MASK                          (0x01U << USART_CR1_IDLEIEN_SHIFT)
#define USART_CR1_IDLEIEN(x)                            (((uint32_t)(((uint32_t)(x)) << USART_CR1_IDLEIEN_SHIFT)) & USART_CR1_IDLEIEN_MASK)

#define USART_CR1_TE_SHIFT                              (3)
#define USART_CR1_TE_MASK                               (0x01U << USART_CR1_TE_SHIFT)
#define USART_CR1_TE(x)                                 (((uint32_t)(((uint32_t)(x)) << USART_CR1_TE_SHIFT)) & USART_CR1_TE_MASK)

#define USART_CR1_RE_SHIFT                              (2)
#define USART_CR1_RE_MASK                               (0x01U << USART_CR1_RE_SHIFT)
#define USART_CR1_RE(x)                                 (((uint32_t)(((uint32_t)(x)) << USART_CR1_RE_SHIFT)) & USART_CR1_RE_MASK)

#define USART_CR1_SBK_SHIFT                             (0)
#define USART_CR1_SBK_MASK                              (0x01U << USART_CR1_SBK_SHIFT)
#define USART_CR1_SBK(x)                                (((uint32_t)(((uint32_t)(x)) << USART_CR1_SBK_SHIFT)) & USART_CR1_SBK_MASK)

/*!
 * @brief USART_CR2 Register Bit Definition
 */

#define USART_CR2_SWAP_SHIFT                            (15)
#define USART_CR2_SWAP_MASK                             (0x01U << USART_CR2_SWAP_SHIFT)
#define USART_CR2_SWAP(x)                               (((uint32_t)(((uint32_t)(x)) << USART_CR2_SWAP_SHIFT)) & USART_CR2_SWAP_MASK)

#define USART_CR2_STOP_SHIFT                            (12)
#define USART_CR2_STOP_MASK                             (0x03U << USART_CR2_STOP_SHIFT)
#define USART_CR2_STOP(x)                               (((uint32_t)(((uint32_t)(x)) << USART_CR2_STOP_SHIFT)) & USART_CR2_STOP_MASK)

#define USART_CR2_CPOL_SHIFT                            (10)
#define USART_CR2_CPOL_MASK                             (0x01U << USART_CR2_CPOL_SHIFT)
#define USART_CR2_CPOL(x)                               (((uint32_t)(((uint32_t)(x)) << USART_CR2_CPOL_SHIFT)) & USART_CR2_CPOL_MASK)

#define USART_CR2_CPHA_SHIFT                            (9)
#define USART_CR2_CPHA_MASK                             (0x01U << USART_CR2_CPHA_SHIFT)
#define USART_CR2_CPHA(x)                               (((uint32_t)(((uint32_t)(x)) << USART_CR2_CPHA_SHIFT)) & USART_CR2_CPHA_MASK)

/*!
 * @brief USART_CR3 Register Bit Definition
 */

#define USART_CR3_TXTOG_SHIFT                           (29)
#define USART_CR3_TXTOG_MASK                            (0x01U << USART_CR3_TXTOG_SHIFT)
#define USART_CR3_TXTOG(x)                              (((uint32_t)(((uint32_t)(x)) << USART_CR3_TXTOG_SHIFT)) & USART_CR3_TXTOG_MASK)

#define USART_CR3_RXTOG_SHIFT                           (28)
#define USART_CR3_RXTOG_MASK                            (0x01U << USART_CR3_RXTOG_SHIFT)
#define USART_CR3_RXTOG(x)                              (((uint32_t)(((uint32_t)(x)) << USART_CR3_RXTOG_SHIFT)) & USART_CR3_RXTOG_MASK)

#define USART_CR3_CKINE_SHIFT                           (16)
#define USART_CR3_CKINE_MASK                            (0x01U << USART_CR3_CKINE_SHIFT)
#define USART_CR3_CKINE(x)                              (((uint32_t)(((uint32_t)(x)) << USART_CR3_CKINE_SHIFT)) & USART_CR3_CKINE_MASK)

#define USART_CR3_ONEBIT_SHIFT                          (11)
#define USART_CR3_ONEBIT_MASK                           (0x01U << USART_CR3_ONEBIT_SHIFT)
#define USART_CR3_ONEBIT(x)                             (((uint32_t)(((uint32_t)(x)) << USART_CR3_ONEBIT_SHIFT)) & USART_CR3_ONEBIT_MASK)

#define USART_CR3_HDSEL_SHIFT                           (3)
#define USART_CR3_HDSEL_MASK                            (0x01U << USART_CR3_HDSEL_SHIFT)
#define USART_CR3_HDSEL(x)                              (((uint32_t)(((uint32_t)(x)) << USART_CR3_HDSEL_SHIFT)) & USART_CR3_HDSEL_MASK)

#define USART_CR3_ERRIEN_SHIFT                          (0)
#define USART_CR3_ERRIEN_MASK                           (0x01U << USART_CR3_ERRIEN_SHIFT)
#define USART_CR3_ERRIEN(x)                             (((uint32_t)(((uint32_t)(x)) << USART_CR3_ERRIEN_SHIFT)) & USART_CR3_ERRIEN_MASK)

/*!
 * @}
 */ /* end of group USART_Register_Masks */
/******************************************************************************
 * USART Instance
 ******************************************************************************/

#define USART1                ((USART_Type*)USART1_BASE)
#define USART2                ((USART_Type*)USART2_BASE)


/* --------  End of section using anonymous unions and disabling warnings  -------- */
#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

#ifdef __cplusplus
}
#endif

#endif /* __MM32G0001_H__ */